{"sections":[{"body":"CCS CONCEPTS • Human-centered computing → Interactive systems and tools; • Computing methodologies→ Machine learning.\nKEYWORDS Citizen science, smell, air quality, sustainable HCI, machine learning, community empowerment\nACM Reference Format: Yen-Chia Hsu, Jennifer Cross, Paul Dille, Michael Tasota, Beatrice Dias, Randy Sargent, Ting-Hao (Kenneth) Huang, and Illah Nourbakhsh. 2019. Smell Pittsburgh: Community-Empowered Mobile Smell Reporting System.\nPermission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. IUI ’19, March 17–20, 2019, Marina del Ray, CA, USA © 2019 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 978-1-4503-6272-6/19/03. . . $15.00 https://doi.org/10.1145/3301275.3302293\nIn 24th International Conference on Intelligent User Interfaces (IUI ’19), March 17–20, 2019, Marina del Ray, CA, USA. ACM, New York, NY, USA, 16 pages. https://doi.org/10.1145/3301275.3302293"},{"header":"1 INTRODUCTION","body":"Air pollution has been associated with adverse impacts on human health, including respiratory and cardiovascular diseases [43, 72, 101, 105, 127]. Addressing air pollution often involves negotiations between corporations and regulators, who hold power to improve air quality. However, the communities, who are directly affected by the pollution, are rarely influential in policy-making. Their voices typically fail to persuade decision-makers because collecting and presenting reliable evidence to support their arguments is resourceintensive. Forming such evidence requires collecting and analyzing multiple sources of data over a large geographic area and an extended period. This task is challenging due to the requirements of financial resources, organizational networks, and access to technology. Due to the power imbalance and resource inequality, affected residents usually rely on experts in governmental agencies, academic institutions, or non-governmental organizations to analyze and track pollution sources.\nA straightforward solution is to empower the affected communities directly. In this research, we demonstrate how citizen science can be used for communities to pool resources and efforts to gather evidence for advocacy. Data-driven evidence, especially when integrated with narratives, is essential for communities to make sense of local environmental issues and take action [94]. However, citizencontributed data is often held in low regard because the information can be unreliable or include errors during data entry. Also, sufficient citizen participation and data transparency are required for the evidence to be influential. For instance, the city involved in this study, Pittsburgh, is one of the ten most polluted cities in the United States [4]. Currently, Pittsburgh citizens report air quality problems to the local health department via its phone line or website.\nNevertheless, the quality of the gathered data is doubtful. Citizens may not remember the exact time and location that pollution odors occurred. Asking citizens to submit complaints retrospectively is hard for capturing accurate details and prone to errors. Such errors can result in missing or incomplete data that can affect the outcome of statistical analysis to identify pollution sources [36].\nFurthermore, the reporting process is not transparent and does not encourage citizens to contribute data. There is no real-time feedback or ways of sharing experiences to forge a sense of community. Without data that adequately represents the community, it is difficult to know if an air pollution problem is at a neighborhood or city-wide scale. This approach is inadequate for data collection and hinders the participation in bringing air quality issues to the attention of regulators and advocating for policy changes.\nBecause of these challenges, resident-reported smell data did not gain much attention as a critical tool for monitoring air pollution. However, literature has shown that the human olfactory can distinguish more than one trillion odors [23] and outperform sensitive measuring equipment in odor detection tasks [116]. Although there have been discussions about the potential of using smell to indicate pollution events and support decision making [89, 91], no prior works collected long-term smell data at a city-wide scale and studied if these data are useful for air pollution monitoring and community advocacy.\nWe propose a system, Smell Pittsburgh [2], for citizens to report pollution odors to the local health department with accurate time and GPS location data via smartphones. The system visualizes odor complaints in real-time, which enables residents to confirm their experiences by viewing if others also share similar experiences. Additionally, we present a dataset of smell reports and air quality measurements from nearby monitoring stations over 21 months [1]. We use the dataset to develop a model that predicts upcoming pollution odors and send push notifications to users. We also apply machine learning to identify relationships between smell reports\nand air quality measurements. Finally, we describe qualitative and quantitative studies for understanding changes in user engagement and motivation. To the best of our knowledge, Smell Pittsburgh is the first system of its kind that demonstrates the potential of collecting and using smell data to form evidence about air quality issues at a city-wide scale. Although stakeholders typically view odor experiences as subjective and noisy, our work shows that smell data is beneficial in identifying urban air pollution patterns and empowering communities to pursue a sustainable environment."},{"header":"2 RELATEDWORK","body":"This research is rooted in citizen science, which empowers amateurs and professionals to form partnerships and produce scientific knowledge [16, 17, 46, 85, 114]. Historically, there exist both research and community-oriented strategies [31]. Research-oriented citizen science aims to address large-scale research questions which are infeasible for scientists to tackle alone [14, 15, 28, 30, 39, 40, 86, 118]. Research questions under this strategy are often driven by professional scientists. Researchers applying this strategy study how scientists can encourage the public to participate in scientific research. In contrast, community-oriented citizen science aims to democratize science by equipping citizens with tools to directly target community concerns for advocacy [26, 32, 53, 64, 67– 69, 92, 96, 119, 120, 128]. Research questions under this strategy are often driven by community members, exploring how scientists can engage in social and ethical issues that are raised by citizens or communities. Our research focuses on the community-oriented\napproach. This approach is highly related to sustainable HumanComputer Interaction [13, 20, 41, 42, 45, 84], which studies the intervention of information technology for increasing the awareness of sustainability, changing user behaviors, and influencing attitudes of affected communities. We seek to generate scientific knowledge from community data to support citizen-driven exploration, understanding, and dissemination of local air quality concerns."},{"header":"2.1 Community Data in Citizen Science","body":"Modern technology allows communities to collect data that can contextualize and express their concerns. There are typically two types of community data, which are generated from either sensors or proactive human reports. Each type of data provides a small fragment of evidence. When it comes to resolving and revealing community concerns, human-reported data can show how experiences of residents are affected by local issues, but it is typically noisy, ambiguous, and hard to quantify at a consistent scale. Sensing data can complement human-reported data by providing temporally dense and reliable measurements of environmental phenomena but fails to explain how these phenomena affect communities. Without integrating both types of data, it is difficult to understand the context of local concerns and produce convincing evidence.\n2.1.1 Human-Reported Data. Human-reported data includes observations contributed by users. Modern computational tools can collect volunteered geographic information [57] and aggregate them to produce scientific knowledge. However, most prior works focused on collecting general information of particular interest, rather than data of a particular type of human sense, such as odor. Ushahidi gathers crisis information via text messages or its website to provide timely transparent information to a broader audience [90]. Creek Watch is amonitoring systemwhich enabled citizens to report water flow and trash data in creeks [76]. Sensr is a tool for creating environmental data collection and management applications on mobile devices without programming skills [73, 74]. Encyclopedia of Life is a platform for curating species information contributed by professionals and non-expert volunteers [112]. eBird is a crowdsourcing platform to engage birdwatchers, scientists, and policy-makers to collect and analyze bird data collaboratively [122, 123]. Tiramisu was a transit information system for collecting GPS location data and problem reports from bus commuters [130]. One of the few examples focusing on information of a specific modality is NoiseTube, a mobile application that empowered citizens to report noise via their mobile phones and mapped urban noise pollution on a geographical heatmap [38, 83]. The tool could be utilized for not only understanding the context of urban noise pollution but also measuring short-term or long-term personal exposure.\n2.1.2 Sensing Data. Sensing data involves environmental measurements quantified with sensing devices or systems, which enable citizens to monitor their surroundings with minimal to no assistance from experts. However, while many prior works used sensors to monitor air pollution, none of them complemented the sensing data with human-reported data. MyPart is a low-cost and calibrated wearable sensor for measuring and visualizing airborne particles [126]. Speck is an indoor air quality sensor for measuring\nand visualizing fine particulate matter [124, 125]. Kim et al. implemented an indoor air quality monitoring system to gather air quality data from commercial sensors [75]. Kuznetsov et al. developed multiple air pollution monitoring systems which involved low-cost air quality sensors and a map-based visualization [78, 79]. Insights from these works showed that sensing data, especially accompanied by visualizations, could provide context and evidence that might raise awareness and engage local communities to participate in political activism. But none of these work asked users to report odors, and thus can not directly capture how air pollution affects the living quality of community members."},{"header":"2.2 Machine Learning for Citizen Science","body":"Citizen science data are typically high-dimensional, noisy, potentially correlated, and spatially or temporally sparse. The collected data may also suffer from many types of bias and error that sometimes can even be unavoidable [11, 22]. Making sense of such noisy data has been a significant concern in citizen science [88, 93], especially for untrained contributors [17, 28, 35, 91]. To assist community members in identifying evidence from large datasets efficiently, prior projects used machine learning algorithms to predict future events or interpret collected data [8, 11, 12, 58, 70, 71, 87].\n2.2.1 Prediction. Prediction techniques aim to forecast the future accurately based on previous observations. Zheng et al. developed a framework to predict air quality readings of a monitoring station over the next 48 hours based on meteorological data, weather forecasts, and sensor readings from other nearby monitoring stations [129]. Azid et al. used principal component analysis and an artificial neural network to identify pollution sources and predict air pollution [6]. Donnelly et al. combined kernel regression and multiple linear regression to forecast the concentrations of nitrogen dioxide over the next 24 and 48 hours [44]. Hsieh et al. utilized a graphical model to predict the air quality of a given location grid based on data from sparse monitoring stations [63]. These studies applied prediction techniques to help citizens plan daily activities and also inform regulators in controlling air pollution sources. Most of these studies focus on forecasting or interpolating sensing data. To the best of our knowledge, none of them considered humanreported data in their predictive models.\n2.2.2 Interpretation. Interpretation techniques aim to extract knowledge from the collected data. This knowledge can help to discover potential interrelationships between predictors and responses, which is known to be essential in analyzing the impacts of environmental issues in the long-term [19, 35]. Gass et al. investigated the joint effects of outdoor air pollutants on emergency department visits for pediatric asthma by applying Decision Tree learning [51]. The authors suggested using Decision Tree learning to hypothesize about potential joint effects of predictors for further investigation. Stingone et al. trained decision trees to identify possible interaction patterns between air pollutants andmath test scores of kindergarten children [121]. Hochachka et al. fused traditional statistical techniques with boosted regression trees to extract species distribution patterns from the data collected via the eBird platform [61]. These previous studies utilized domain knowledge to fit machine learning models with high explanatory powers on filtered citizen science\ndata. In this paper, we also used Decision Tree to explore hidden interrelationships in the data. This extracted knowledge can reveal local concerns and serve as convincing evidence for communities in taking action."},{"header":"3 DESIGN PRINCIPLES AND CHALLENGES","body":"Our goals are (i) to develop a system that can lower the barriers to contribute smell data and (ii) to make sure the data is useful in studying the impact of urban air pollution and advocating for better air quality. Each goal yields a set of design challenges."},{"header":"3.1 Collecting Smell Data at Scale with Ease","body":"Outside the scope of citizen science, a few works have collected human-reported smell data in various manners. However, these manners are not suitable for our projects. For example, prior works have applied a smell-walking approach to record and map the landscape of smell experiences by recruiting participants to travel in cities [59, 106, 107]. This process is labor intensive and hard for long-term air quality monitoring. Hsu et al. has also demonstrated that resident-reported smell reports, collected via Google Forms, can form evidence about air pollution when combined with data from cameras and air quality sensors [65, 66]. While Google Form is usable for a small-size study, it would not be effective in collecting smell reports on a city-wide scale with more than 300,000 affected residents over several years. Therefore, we developed a mobile system to records GPS locations and timestamps automatically. The system is specialized for gathering smell data at a broad temporal and geographical scale."},{"header":"3.2 What is Useful Data? A Wicked Problem","body":"There is a lack of research in understanding the potential of using smell as an indicator of urban air pollution. Moreover, we recognized that there are various methods of collecting, presenting, and using the data. It is not feasible to explore and evaluate all possible methods without deploying the system in the real-world context. These challenges form a wicked problem [29, 111], which refers to problems that have no precise definition, cannot be fully observed at the beginning, are unique and depend on context, have no opportunities for trial and error, and have no optimal or “right” solutions. In response to this challenge, our design principle is inspired by how architects and urban designers address wicked problems. When approaching a community or city-scale problem, architects and urban planners first explore problem attributes (as defined in [98]) and then design specific solutions based on prior empirical experiences. We made use of an existing network of community advocacy groups, including ACCAN [3], GASP [50], Clean Air Council [24], PennFuture [100], and PennEnvironment [99]. These groups were pivotal in shaping the design of Smell Pittsburgh and providing insights into how to engage the broader Pittsburgh community.\nMoreover, to sustain participation, we visualized smell report data on a map and also engage residents through push notifications. To add more weight to citizen-contributed pollution odor report, we engineered the application to send smell reports directly to the Allegheny County Health Department (ACHD). This strategy ensured that the local health department could access high-resolution citizen-generated pollution data to ascertain better and address\npotential pollution sources in our region. We met and worked with staff in ACHD to determine how they hoped to utilize smell report data and adjusted elements of the application to better suit their needs, such as sending data directly to their database and using these data as evidence of air pollution. Based on their feedback, the system submitted all smell reports to the health department, regardless of the smell rating. This approach provided ACHD with a more comprehensive picture of the local pollution landscape.\nIn summary, when developing Smell Pittsburgh, we considered the system as an ongoing infrastructure to sustain communities over time (as mentioned in [34]), rather than a software product which solves a single well-defined problem. The system is designed to influence citizen participation and reveals community concerns simultaneously, which is different from observational studies that use existing data, such as correlating air quality keywords from social media contents with environmental sensor measurements [49]."},{"header":"4 SYSTEM","body":"Smell Pittsburgh is a system, distributed through iOS and Android devices, to collect smell reports and track urban pollution odors. We now describe two system features: (1) a mobile interface for submitting and visualizing odor complaints and (2) push notifications for predicting the potential presence of odor events."},{"header":"4.1 Submitting and Visualizing Smell Reports","body":"Users could report odor complaints via Smell Pittsburgh from their mobile devices via the submission console (Figure 1, left). To submit a report, users first selected a smell rating from 1 to 5, with one being “just fine” and five being “about as bad as it gets.” These ratings, their color, and the corresponding descriptions were designed by affected local community members to mimic the US EPAAir Quality Index [47]. Also, users could fill out optional text fields where they could describe the smell (e.g., industrial, rotten egg), their symptoms related to the odor (e.g., headache, irritation), and their personal experiences. Once a user submitted a smell report, the system sent it to the local health department and anonymously archived it on our backend database. Users could decide if they were willing to provide their contact information to the health department through the system setting panel. Regardless of the setting, our database did not record the personal information.\nThe system visualized smell reports on a map that also depicted fine particulate matter and wind data from government-operated air quality monitoring stations (Figure 1, right). All smell reports were anonymous, and their geographical locations were skewed to preserve privacy. When clicking or tapping on the playback button, the application animated 24 hours of data for the currently selected day, which served as convincing evidence of air quality concerns. Triangular icons indicated smell reports with colors that correspond to smell ratings. Users could click on a triangle to view details of the associated report. Circular icons showed government-operated air quality sensor readings with colors based on the Air Quality Index [47] to indicate the severity of particulate pollution. Blue arrows showed wind directions measured from nearby monitoring stations. The timeline on the bottom of the map represented the concentration of smell reports per day with grayscale squares. Users could view data for a date by selecting the corresponding square."},{"header":"4.2 Sending Push Notifications","body":"Smell Pittsburgh sent post hoc and predictive event notifications to encourage participation. When there were a sufficient number of poor odor reports during the previous hour, the system sent a post hoc event notification: “Many residents are reporting poor odors in Pittsburgh. Were you affected by this smell event? Be sure to submit a smell report!” The intention of sending this notification was to encourage users to check and report if they had similar odor experiences. Second, to predict the occurrence of abnormal odors in the future, we applied machine learning to model the relationships between aggregated smell reports and air quality measurements from the past. We defined the timely and geographically aggregated reports as smell events, which indicated that there would be many high-rating smell reports within the next 8 hours. Each day, whenever the model predicted a smell event, the system sent a predictive notification: “Local weather and pollution data indicates there may be a Pittsburgh smell event in the next few hours. Keep a nose out and report smells you notice.” The goal of making the prediction was to support users in planning daily activities and encourage community members to pay attention to the air quality. To keep the prediction system updated, we computed a new machine learning model every Sunday night based on the data collected previously."},{"header":"5 EVALUATION","body":"The evaluation shows that using smell experiences is practical for revealing urban air quality concerns and empowering communities to advocate for a sustainable environment. Our goal is to evaluate the impact of deploying interactive systems on communities rather than the usability (e.g., the time of completing tasks).We believe that it is more beneficial to ask “Is the system influential?” instead of “Is the system useful?” We now discuss three studies: (i) system usage information of smell reports and interaction events, (ii) a dataset for predicting and interpreting smell event patterns, and (iii) a survey of attitude changes and motivation factors."},{"header":"5.1 System Usage Study","body":"In this study, we show the usage patterns on mobile devices by parsing server logs and Google Analytics events. From our initial testing with the community on September 2016 to the end of September 2018, we had about 5,790 and 1,070 installations (rounded to the nearest 10) of Smell Pittsburgh on iOS and Android devices respectively in the United States. We excluded data generated during the system stability testing phase in September and October 2016. From our soft launch in November 2016 to the end of September 2018 over 23 months, there were 3,917 unique anonymous users (estimated by Google Analytics) in Pittsburgh. Our users contributed 17,280 smell reports, 582,108 alphanumeric characters in the submitted text fields, and 163,609 events of interacting with the visualization (e.g., clicking on icons on the map). Among all reports, 76% of them had ratings greater than two.\nTo investigate the distribution of smell reports and interaction events among our users, we divided all users into four types: enthusiasts, explorers, contributors, and observers (Table 1). Contributors submitted reports but did not interact with the visualization. Observers interacted with the visualization but did not submit reports. Enthusiasts submitted more than 6 reports and interacted with the\nvisualization more than 31 times. Thresholds 6 and 31 were the median of the number of submitted reports and interaction events for all users respectively, plus their semi-interquartile ranges. Explorers submitted 1 to 6 reports or interacted with the visualization 1 to 31 times. We were interested in four variables with different distributions among user groups, which represented their characteristics (Table 2). First, for each user, we computed the number of submitted reports and interaction events. Then, for each smell report, we calculated the number of alphanumeric characters in the submitted text fields. Finally, for interaction events that involved viewing previous data, we computed the time difference between hit timestamps and data timestamps. These two timestamps represented when users interacted with the system and when the data were archived respectively. Distributions of all variables differed from normal distributions (normality test p<.001) and were skewed toward zero.\nThe user group study showed highly skewed user contributions. About 32% of the users submitted only one report. About 48% and 81% of the users submitted less than three and ten reports respectively, which aligned with the typical pattern in citizen science projects that many volunteers participated for only a few times [113]. Moreover, these three user groups differed regarding the type and amount of data they contributed. Table 1 shows that enthusiasts, corresponding to less than 10% of the users, contributed\nabout half of the data overall. Table 2 indicates the characteristics of these groups. Enthusiasts tended to contribute more smell reports, the number of alphanumeric characters of reports, and interaction events. Observers tended to browse data that were far away from the interaction time. Further investigation of the enthusiast group revealed a moderate positive association (Pearson correlation coefficient r=.50, n=375, p<.001) between the number of submitted reports and the number of user interaction events.\nTo identify critical topics in citizen-contributed smell reports, we analyzed the frequency of words (unigram) and phrases (bigram) in the text fields. We used python NLTK package [10] to remove stop words and group similar wordswith different forms (lemmatization). Figure 2 shows that high-frequency words and phrases mostly described industrial pollution odors and symptoms of air pollution exposure, especially hydrogen sulfide that has rotten egg smell and can cause a headache, dizziness, eye irritation, sore throat, cough, nausea, and shortness of breath [33, 54, 82, 109]. This finding inspired us to examine how hydrogen sulfide affected urban odors in the next study."},{"header":"5.2 Smell Dataset Study","body":"In this study, we show that human-reported smell data, despite noisy, can still enable prediction and contribute scientific knowledge of interpretable air pollution patterns. We first constructed and introduced a dataset with air quality sensor readings and smell\nreports fromOctober 31 in 2016 to September 27 in 2018 [1]. The sensor data were recorded hourly by twelve government-operatedmonitoring stations at different locations in Pittsburgh, which included timestamps, particulate matters, sulfur dioxide, carbon monoxide, nitrogen oxides, ozone, hydrogen sulfide, and wind information (direction, speed, and standard deviation of direction). The smell report data contained timestamps, zip-codes, smell ratings, descriptions of sources, symptoms, and comments. For privacy preservation, we dropped the GPS location (latitude and longitude) of the smell reports and used zip-codes instead.\nWe framed the smell event prediction as a supervised learning task to approximate the function F that maps a predictor matrix X to a response vector y. The predictor matrix and the response vector represented air quality data and smell events respectively. To build X , we re-sampled air quality data over the previous hour at the beginning of each hour. For example, at 3 pm, we took the mean value of sensor readings between 2 pm and 3 pm to construct a new sample. Wind directions were further decomposed into cosine and sine components. To equalize the effect of predictors, we normalized each column of matrix X to zero mean and unit variance. Missing values were replaced with the corresponding mean values.\nTo build y that represents smell events, we aggregated highrating smell reports over the future 8 hours at the beginning of each hour. We specifically chose the geographic regions that have\nsufficient amount of data during aggregation (Figure 3). For instance, at 3 pm, we took the sum of smell ratings with values higher than two between 3 pm and 11 pm to obtain a confidence score, which represented agreements of how likely a smell event occurred. The scores were further divided into positive and negative classes (with or without smell events) by using threshold 40. In this way, we simplify the task to a binary classification problem, with 64 predictor variables (columns of X ) and 16,766 samples (rows of X and y). The distribution of classes was highly imbalanced (only 8% positive). Besides classification, we also applied a regression approach to predict the confidence scores directly without thresholding initially. Then the predicted scores were thresholded post hoc with value 40 to produce positive and negative classes, which enabled us to compare the performance of these two approaches.\nWhen performing classification and regression, we added 3-hour lagged predictor variables, days of the week, hours of the day, and days of the month into the original predictor variable, which expanded its length from 64 to 195. The lagged duration was chosen during model selection. We implemented two models, Random Forest [18] and Extremely Randomized Trees [52], by using python scikit-learn package [97]. These algorithms build a collection of decision trees using the CART algorithm [81], where the leaves represent the responses y and the branches represent the logical conjunction of predictors in X . There were three tunable model parameters: the number of trees in the model, the number of features to select randomly for splitting a tree node, and the minimum number of samples required to split a tree node. For simplicity, we fixed the number of trees (1,000 for classification and 200 for regression) and chose other parameters during model selection.\nTo evaluate model performance, we defined and computed true positives (TP), false positives (FP), and false negatives (FN) to obtain precision, recall, and F-score [104] (Figure 5). We first merged consecutive positive samples to compute the starting and ending time of smell events. Then, if a predicted event overlapped with a ground truth event, we counted this event as a TP. Otherwise, we counted a non-overlapped predicted event as an FP. For ground truth events that had no overlapping predicted events, we counted them as FN. When computing these metrics, we considered only daytime events because residents rarely submitted reports during nighttime (Figure 4). We defined daytime from 5 am to 7 pm. Since\nthe model predicted if a smell event would occur in the next 8 hours, we only evaluated the prediction generated from 5 am to 11 am.\nWe chosemodel parameters by using time-series cross-validation [5, 77], where the entire dataset was partitioned and rolled into several pairs of training and testing subsets for evaluation. Because our predictors and responses were all time-dependent, we used previous samples to train the models and evaluated them on future data. We first divided all samples into folds, with each fold approximately representing a week. Then, starting from fold 49, we took the previous 48 folds as training data (about 8,000 samples) and the current fold as testing data (about 168 samples). This procedure was iterated for the rest of the folds, which reflected the setting of the deployed system where a new model was trained on every Sunday night by using data from the previous 48 weeks. Table 3 reports the evaluation metrics after cross-validating the models 100 times with various random seeds.\nWhile these models enabled us to predict future smell events, they were typically considered as black box models and not suitable for interpreting patterns. Although these models provided feature importances, interpreting these weights could be problematic because several predictors in the dataset were highly correlated, which might appear less significant than other uncorrelated counterparts. Inspired by several previous works related to extracting knowledge from data [25, 51, 115], we utilized a white box model, Decision Tree, to explain a representative subset of predictors and samples, which were selected by applying feature selection [55] and cluster analysis. One can view this process as performing model compression to distill the knowledge in a large black box model into a compact model that is explainable to human [21, 60].\nDuring data interpretation, we only considered the classification approach due to better performance. First, we used domain knowledge to manually select features. As there were many highly correlated features, selecting a subset of them arbitrarily for extracting patterns was impractical. The knowledge obtained from informal community meetings and the result discovered in the text analysis (Figure 2) suggested that hydrogen sulfide might be the primary source of smell events. This finding inspired us to chose hydrogen sulfide, wind direction, wind speed, and standard deviation"},{"header":"50% smell events. The first line of a tree node indicates the ratio of the number of positive (with smell event) and negative samples (no smell event). The second and third lines of the node show the feature and its threshold for splitting. The most important predictor is the interaction between the east-west wind directions at Parkway and the previous 1-hour hydrogen","body":"sulfide readings at Liberty (r=.58, n=16,766, p<.001), where r means the point-biserial correlation of the predictor and smell events.\nof wind direction from all of the other available predictors. The current and up to 2-hour lagged predictor variables were all included. Also, we added interaction terms of all predictors, such as hydrogen sulfide multiplied by the sine component of wind direction. This manual feature selection procedure produced 781 features.\nThen, we used DBSCAN [48] to cluster positive samples and to choose a representative subset. The distance matrix for clustering was derived from a Random Forest fitted on the manually selected features. For each sample pair, we counted the number of times that the pair appeared in the same leaf for all trees in the model. The numbers were treated as the similarity of sample pairs and scaled to the range between 0 and 1. We converted the similarity s into distance d by using d = 1 − s . This procedure identified a cluster with about 25% of positive samples from 50% of the smell events.\nFinally, we used recursive feature elimination [56] to remove 50 features that had the smallest weights iteratively, which resulted in 30 most important features. These feature importance weights were computed by fitting a Random Forest. We trained a Decision Tree using the CART algorithm [81] to interpret the cluster and the selected 30 features. Parameters for data interpretation (DBSCAN, Random Forest, and Decision Tree) were selected by using\ncross-validation. Table 3 reports the evaluation metrics after crossvalidating the model for 100 times with random seeds. The result showed that the model was capable of explaining the underlying pattern of about 50% of the smell events, which was a joint effect of wind information and hydrogen sulfide readings (Figure 6)."},{"header":"5.3 Survey Study","body":"In this study, we show that the system can motivate active community members to contribute data and increase their self-efficacy, beliefs about how well an individual can achieve desired effects through actions [7]. We recruited adult participants via snowball sampling [9]. We administered and delivered an anonymous online survey via email to community advocacy groups and asked them to distribute the survey to others. Paper surveys were also provided. All responses were kept confidential, and there was no compensation. We received 29 responses in total over one month from March 20th to April 20th, 2018. Four responses were excluded due to incomplete questions or no experiences in interacting with the system, which gave 25 valid survey responses. There were 8 males, 16 females, and 1 person with undisclosed gender information. All but one participant had a Bachelor’s degree at minimum. The demographics of the sample population (Table 4) were not typical for\nthe region. The survey had three sections: (1) Self-Efficacy Changes, (2) Motivation Factors, (3) System Usage Information.\nFor Self-Efficacy Changes, we measured changes to user confidence mitigating air quality problems. This section was framed as a retrospective pre-post self-assessment. The items were divided between pre-assessment, “BEFORE you knew about or used Smell Pittsburgh,” and post-assessment, “AFTER you knew about or used Smell Pittsburgh.” For both assessments, we used a scale developed by the Cornell Lab of Ornithology [37, 103]. The scale was customized for air quality to suit our purpose. The scale consisted of eight Likert-type items (from 1 “Strongly Disagree” to 5 “Strongly Agree”).\nTheMotivation Factors sectionwas based on a scale developed by the Cornell Lab of Ornithology [37, 102] with 14 Likert-type items (from 1 “Strongly Disagree” to 5 “Strongly Agree”). The scale was customized for air quality and measured both internal (7 items) and external motivations (7 items). Examples of internal motivations included enjoyment during participation and the desire to improve air quality. Examples of external motivations included the attempt to gain rewards and to avoid negative consequences if not taking actions. A text field with question “Are there other reasons that you use Smell Pittsburgh?” was provided for open responses.\nIn the System Usage Information section, we collected individual experiences with Smell Pittsburgh. We documented participation level through a multiple-choice and multiple-response question, “How did you use Smell Pittsburgh?” as shown in Figure 7 (right). This question allowed participants to select from a list of 11 activities, which include submitting reports, interacting with the system, sharing experiences, and disseminating data (Table 6). We identified the frequency of system usage through a multiple-choice question, “How often do you use Smell Pittsburgh?” as shown in Table 5. Text fields were provided for both of the above two questions.\nAt the end of the survey, we asked an open-response question “Do you have any other comments, questions, or concerns?” Our analysis is presented below along with each related question and\nselected quotes. Bold emphases in the quotes were added by researchers to highlight key user sentiments.\nFor Self-Efficacy, we averaged the scale items to produce total self-efficacy pre score (Mdn=3.50) and post score (Mdn=4.13) for each participant (Figure 7, left). A two-tailed Wilcoxon SignedRanks test (a nonparametric version of a paired t-test) indicated a statistically significant difference (W=13.5, Z=-3.79, p<.001). This finding indicated that there were increases in self-efficacy during participation.\nFor Motivation Factors, we averaged the internal (Mdn=4.29) and external (Mdn=3.14) motivation scores for each participant (Figure 7, center). A two-tailed Wilcoxon Signed-Ranks test indicated a statistically significant difference (W=0, Z=-4.29, p<.001). This result suggested that internal factors were primary motivations for our participants rather than external factors. Open-ended answers showed that nine participants (36%) mentioned that the system enabled them to contribute data-driven evidence efficiently and intuitively.\n“I used to try to use the phone to call in complaints, but that was highly unsatisfactory. I never knew if my complaints were even registered. With Smell Pittsburgh, I feel that I’m contributing to taking data, as well as to complaining when it’s awful. [...]” “It’s seems to be the most effective way to report wood burning that can fill my neighborhood with the smoke and emissions from wood burning.” “The Smell appquantifies observations in real time. Researchers can use this qualitative information along quantitative data in real time. Added benefit is to have [the health department] receive this information in real time without having to make a phone call or send separate email. I have confidence that the recording of Smell app data is quantified more accurately than [the health department]’s.” “It is an evidence based way for a citizen to register what is going on with the air where I live and work.” “I believe in science and data and think this can help build a case. [...]”\nAlso, four participants (16%) indicated the benefit to validate personal experiences based on the data provided by others.\n“I used to (and sometimes still do) call reports in to [the health department]. I love how the map displays after I post a smell report.Wow! I’m not alone!” “It validates my pollution experiences because others are reporting similar experiences.” “I like using it for a similar reason that I like checking the weather. It helps me understand my environment and confirms my sense of what I’m seeing.”\nWe also found that altruism, the concern about the welfare of others, was another motivation. Six participants (24%) mentioned the desire to address climate changes, activate regulators, raise awareness of others, expand air quality knowledge, influence policy-making, and build a sense of community.\n“Because climate change is one of our largest challenges, [...] Also, the ACHD isn’t as active as they should be, and needs a nudge.” “I use [Smell Pittsburgh] to demonstrate to others how they can raise their own awareness. I’ve also pointed out to others that many who have grown up in this area of Western PA have grown up with so much pollution, to them air pollution has become normalized and many do not even smell the pollution any more. This is extremely dangerous and disturbing.” “I want to help expand the knowledge and education of air quality in Pittsburgh and believe the visuals Smell Pittsburgh provides is the best way to do that.” “I believe in the power of crowd-sourced data to influence policy decisions. I also believe that the air quality activism community will find more willing participants if there is a very easy way for nonactivists to help support clean air, and the app provides that mechanism. It is basically a very easy onramp for potential new activists. The app also acts as a way for non-activists to see that they are not\nalone in their concerns about stinky air, which I believe was a major problem for building momentum in the air quality community prior to the app’s existence.”\nFor System Usage Information, we reported the counts for system usage frequency questions (Table 5). The result showed that our users had awide variety of system usage frequency. Open-responses indicated that instead of using the system regularly, eight participants (32%) only submitted reports whenever they experienced poor odors. To quantify participation levels, we counted the number of selected choices for each participant, as shown in Figure 7 (right). We found that our participation levels were normally distributed. In the open-response text field for this question, two participants (8%) mentioned using personal resources to help promote the system.\n“I ran a Google Adwords campaign to get people to install Smell Pittsburgh. It turns out that about $6 of ad spending will induce someone to install the app.” “I take and share so many screenshots! Those are awesome. [...] I alsomade two large posters of the app screen– one on a very bad day, and one on a very good day. I bring them around to publicmeetings and try to get county officials to look at them.”\nIn the open-ended question to freely provide comments and concerns, two participants (8%) were frustrated about the lack of responses from regulators and unclear values of using the data to take action.\n“After using this app for over a year, andmakingmany dozens of reports, I haven’t once heard from the [health department]. That is disappointing, and makes me wonder, why bother? [...] Collecting this data is clever, but towards what end? I sometimes don’t see the point in continuing to report.” “It wasn’t clear when using the app that my submission was counted [...]. I want to be able to see directly that my smell reports are going somewhere and being used for something. [...]”\nAlso, five (20%) participants suggested augmenting the current systemwith new features and offering this mobile computing tool to\nmore cities. Such features involved reporting smell retrospectively and viewing personal submission records.\n“I get around mostly by bike, so it is difficult to report smells the same moment I smell them. I wish I could report smells in a different location than where I am so that I could report the smell once I reach my destination.” “It would be nice to be able to add a retroactive report. We often get the strong sulfur smells in Forest Hills in the middle of the night [...] but I strongly prefer to not have to log in to my phone at 3 am to log the report as it makes it harder to get back to sleep.” “This app should let me see/download all of my data: how many times I reported smells, what my symptoms and comments were and how many times the [health department] didn’t respond [...]”"},{"header":"6 DISCUSSION","body":"We have shown that the smell data gathered through the system is practical in identifying local air pollution patterns. We released the system in September 2016. During 2017, the system collected 8,720 smell reports, which is 10-fold more than the 796 complaints collected by the health department regulators in 2016. All smell reports in our system had location data, while the location information was missing from 45% of the regulator-collected complaints. Although there is a significant increase in data quantity (as described in the system usage study), researchers may criticize the reliability of the citizen-contributed data, since lay experiences may be subjective, inconsistent, and prone to noise. Despite these doubts, in the smell dataset study, we have applied machine learning to demonstrate the predictive and explainable power of these data. It is viable to forecast upcoming smell events based on previous observations. We also extracted connections between predictors and responses that reveal a dominant local air pollution pattern, which is a joint effect of hydrogen sulfide and wind information. This pattern could serve as hypotheses for future epidemiological studies. Since users tended not to report when there is no pollution odor, we recommend aggregating smell ratings by time to produce samples with no smell events. According to the experiments of different models, we suggest using the classification approach by thresholding smell ratings instead of the regression approach. In reality, the effect of 10 and 100 smell reports with high ratings may be the same for a local geographical region. It is highly likely that the regression function tried to fit the noise after a certain threshold that indicates the presence of a smell event.\nWe have also shown that the transparency of smell data empowered communities to advocate for better air quality. The findings in the survey study suggested that the system lowered the barrier for communities to contribute and communicate data-driven evidence. Although the small sample size limited the survey study, the result showed increases in self-efficacy after using the system. Several participants were even willing to use their resources to encourage others to install the system and engage in odor reporting. Moreover, in July 2018, activists attended the Board of Health meeting with the ACHD (Allegheny County Health Department)\nand presented a printed 230-foot-long scroll of more than 11,000 complaints submitted through the system. These reports allowed community members to ground their personal experiences with concrete and convincing data. The presented smell scroll demonstrated strong evidence about the impact of air pollution on the living quality of citizens, which forced regulators to respond to the air quality problem publicly. The deputy director of environmental health mentioned that ACHD would enact rigorous rules for coke plants: “Every aspect of the activity and operation of these coke plants will have a more stringent standard applied [27, 62].” In this case, Smell Pittsburgh rebalanced the power relationships between communities and regulators."},{"header":"6.1 Limitation","body":"We have explained the design, deployment, and evaluation of a mobile smell reporting system for Pittsburgh communities to collect and visualize odor events. However, our survey study only targeted community activists, which led to a relatively small sample size. The commitment of these users may be driven by internal motivations, such as altruism, instead of the system. Also, due to system limitations in tracking user behaviors and the sparsity of air pollution events, we leave the analysis of whether push notifications encourage user engagement to future work. Additionally, our community members might be unique in their characteristics, such as the awareness of the air quality problem, the tenacity of advocacy, and the power relationships with other stakeholders. Involving citizens to address urban air pollution collaboratively is a wicked problem by its nature, so there is no guarantee that our success and effectiveness can be replicated in a different context. It is possible that interactive systems like Smell Pittsburgh can only be practical for communities with specific characteristics, such as high awareness. Future research is needed to study the impact of deploying this system in other cities that have similar or distinct community characteristics compared to Pittsburgh. It can also be beneficial to explore ways to connect citizens and regulators, such as visualizing smell reports by voting districts, providing more background information with demographics and industry data, and sending push notifications regarding health agency public meetings.\nFurthermore, from a machine-learning standpoint, communitypowered projects such as Smell Pittsburgh often face two challenges that compromise model performances: data sparsity and label unreliability. Recent research has shown that deep neural networks can predict events effectively when equipped with a significant amount of training data [80]. However, the number of collected smell reports are far away from such level due to the limited size of the community and active users. The participated 3,917 users out of the 300,000 residents (1.3%) is not sufficient to cover the entire Pittsburgh area. Additionally, in our case, air pollution incidents can only be captured at the moment because our communities lack resources to deploy reliable air quality monitoring sensors. It is impractical to annotate these incidents off-line such as in Galaxy Zoo [108]. While adopting transfer learning could take advantage of existing large-scale datasets from different domains to boost our performance [95], data sparsity is a nearly inevitable issue that must be taken into consideration for many community-powered projects. Another issue is the label unreliability. There is no real\n“ground truth” air pollution data in our case. The smell events defined in this research were based on the consensus from a group of users. As a consequence, the quality of the labels for the prediction and interpretation task could be influenced by confirmation bias, where people tend to search for information that confirms their prior beliefs. Such type of systematic error may be difficult to avoid, especially for community-powered projects. Future work to address these two challenges involves adding more predictors (e.g., weather forecasts, air quality index) and using generalizable data interpretation techniques that can explain any predictive model to identify more patterns [110]."},{"header":"7 CONCLUSION","body":"This paper explores the design and impact of a mobile smell reporting system, Smell Pittsburgh, to empower communities in advocating for better air quality. The system enables citizens to submit and visualize odor experiences without the assistance from professionals. The visualization presents the context of air quality concerns from multiple perspectives as evidence. In our evaluation, we studied the distribution of smell reports and interaction events among different types of users. We also constructed a smell event dataset to study the value of these citizen-contributed data. By adopting machine learning, we developed a model to predict smell events and send push notifications accordingly. We also trained an explainable model to reveal connections between air quality sensor readings and smell events. Using a survey, we studied motivation factors for submitting smell reports and measured user attitude changes after using the system. Finally, we discussed limitations and future directions: deploying the system in multiple cities and using advanced techniques for pattern recognition. We envision that this research can inspire engineers, designers, and researchers to develop systems that support community advocacy and empowerment."},{"header":"ACKNOWLEDGMENTS","body":"The Heinz Endowments, the CREATE Lab (Jessica Pachuta, Ana Tsuhlares), Allegheny County Clean Air Now (ACCAN), PennEnvironment, Group Against Smog and Pollution (GASP), Sierra Club, Reducing Outdoor Contamination in Indoor Spaces (ROCIS), Blue Lens, PennFuture, Clean Water Action, Clean Air Council, the Global Communication Center of CarnegieMellon University (Ryan Roderick), the Allegheny County Health Department, and all other participants."},{"header":"8 CORRECTIONS","body":"We found errors in the system usage study and the analysis of the air pollution patterns when discussing this research with a colleague. We apologize for the errors in this paper, and this section describes the corrections. These errors do not affect the conclusions."},{"header":"8.1 System Usage Study","body":"In the caption of Table 2, and also in the second paragraph of section 5.1 (System Usage Study), the “interquartile range” texts should be “semi-interquartile range.”"},{"header":"8.2 Smell Dataset Study","body":"The followings provide the corrections for the last two paragraphs in section 5.2 (Smell Dataset Study). Figure 6 should be replaced by Figure 8, and Table 3 should be replaced by Table 7. We also added a new reference [117] and a new table (Table 8).\n[Correction for the second to the last paragraph in section 5.2] Then, we used DBSCAN [48] to cluster positive samples and to choose a representative subset. The distance matrix for clustering was derived from a Random Forest in an unsupervised manner, as described in [117]. The goal was to construct another synthetic dataset and use both datasets to predict if a data sample came from the original one. For each predictor in the original dataset, we sampled the predictor values for n times uniformly at random (with replacement) and put the values in the synthetic dataset for the corresponding predictor, where n is the size of the original dataset. After fitting the model, for each sample pair, we counted the number of times that the pair appeared in the same leaf for all trees in the model. The numbers were treated as the similarity of sample pairs, and we scaled the similarity by dividing it with the number of trees in the model. We converted the similarity s into distance d by using d = 1 − s . This procedure identified a cluster with about 25% of positive samples.\n[Correction for the last paragraph in section 5.2] Finally, we used recursive feature elimination [56] to remove 50 features that had the smallest weights iteratively, which resulted in 30 most important features. These feature importance weights were computed by fitting a Random Forest. We trained a Decision Tree using the CART algorithm [81] to interpret the cluster and the selected 30 features. Parameters for data interpretation (DBSCAN, Random Forest, and Decision Tree) were selected by using cross-validation. Table 8 reported the evaluation metrics after running the data interpretation pipeline for 100 times, including the cluster analysis and recursive feature elimination. The result showed that the model explains the underlying pattern of about 30% of the smell events, which was a joint effect of wind information and hydrogen sulfide readings. Figure 8 indicated the model and the most important two features, which were consistent for 99 times, out of the total 100 times experiment."}],"type":"Sections"}