{"paper_id": "2101.11778", "sentences": ["In the attention economy, social media apps employ a variety of design mechanismssuch as eye-catching notification icons, tempting clickbait, and never-ending autoplayto maximize their share of the users time.", "In this pursuit, designers and tech industry insiders warn that many of these mechanisms exploit psychological vulnerabilities and harm the interests of the user [18, 63].", "place.Onepromising approach is to redesign these mechanisms for a greater sense of agency, i.e., an individuals experience of being the initiator of their actions in the world [113].", "Low sense of agency over technology use is associated with negative life impacts such as a loss of social opportunities, productivity, and sleep [20] that often motivate digital wellbeing efforts to begin with.", "Moreover, a lack of sense of agency itself can be understood as a driver of the dissatisfaction that people often feel with their social media use [72].", "In response, digital wellbeing researchers have innovated what we term external mechanisms that help users manage or monitor their app use, such as lockout timers [56] and productivity dashboards [58].", "While these mechanisms apply universally to many different apps, they do not change the internal mechanisms within an app, such as autoplay, that might lead it to be problematic in the first", "this work, we take the mobile app for YouTube, the most widely used social media service in the United States [91], as a test case to understand and redesign how internal mechanisms influence sense of agency.", "The design of YouTube must balance the interests of many different stakeholders.", "For example, policymakers may wish to exert control over extremist content.", "Advertisers may wish to control how much time users spend on ads.", "Designers may wish to control how much time users spend in the app.", "It is no accident then that social media use is often associated with a loss of sense of agency [10].", "People self-report that their desire to consume media frequently conflicts with their plans or goals and that they fail to resist about three-quarters of the time [33].", "And loss of control is a key component of many measures of problematic technology use [24].", "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page.", "Copyrights for components of this work owned by others than the author(s) must be honored.", "Abstracting with credit is permitted.", "To copy otherwise, or republish,topostonserversortoredistributetolists,requirespriorspecificpermissionand/orafee.Requestpermissionsfrompermissions@acm.org.", "CHI 21, May 813, 2021, Yokohama, Japan  2021 Copyright held by the owner/author(s).", "Publication rights licensed to ACM.", "ACM ISBN 978-1-4503-8096-6/21/05..", ".$15.00 https://doi.org/10.1145/3411764.3445467", "University of Oxford ulrik.lyngs@cs.ox.ac.uk", "Ulrik lyngs", "Human-centered computing  Empirical studies in HCI .", "Himanshu Zade University of Washington himanz@uw.edu", "J. Vera Liao University of Washington ljzj@uw.edu", "ACM Reference Format:", "University of Washington kai1@uw.edu", "University of Washington", "James Choi University of Washington jchoi408@uw.edu", "At Netflix, we are competing for our customers time, so our competitors include Snapchat, YouTube, sleep, etc.  Reed Hastings, Netflix CEO [118, p.50]", "Sean A. Munson", "Kaiyue Fan", "YouTube is an important case for better understanding the design mechanisms of attention capture.", "YouTube has over two billion monthly users worldwide [120] and is extremely popular in the U.S., where about three-quarters of adults report using YouTube on their smartphone, with 32% using it several times a day, 19% about once per day, and 49% less often [91].", "It is also frequently reported as a source of distraction [2], suggesting that it is a good site for the investigation of attention capture dark patterns.", "In particular, Youtubes algorithmic recommendations merit special consideration as they drive more than 70% of watchtime [108].", "However, a weakness of this approach is that reducing screentime is often a poor proxy for what users actually want.", "Instead, user intentions are often highly specific, such as wanting to reduce the time spent on targeted features of an app (e.g., on the Facebook newsfeed, but not in Facebook groups) or in certain contexts (e.g., when with family, but not when commuting on the bus) [49, 68, 71].", "Within YouTube, there are two digital wellbeing features that do move beyond time spent controls and offer more granular control.", "The Notifications digest lets a user bundle push notifications together into a single notification each day, which may reduce the triggers that lead to non-conscious, habitual use [69].", "Autoplay toggle lets a user decide to stop the next video from playing automatically; this may preserve the natural stopping point that comes at the end of the video, a mechanism that has been shown to help users set more deliberate boundaries around use [48].", "While the notification digest and the autoplay toggle clearly do more than just track and limit time, it is not immediately clear by what measure of success they might be evaluated.", "One promising alternative to the screentime paradigm is to design for sense of agency , the focus of this paper.", "Sense of agency is a construct that refers to an individuals experience of being the initiator of their actions in the world [113].", "Sense of agency can be broken down into feelings of agency , that is, the in-the-moment perception of control, and judgments of agency , that is, the post hoc,", "Reducing screentime in certain apps is a common measure of success in digital wellbeing tools.", "The two most popular mobile operating systems, Android and iOS, both come pre-installed with tools for the user to track and limit their time in mobile apps.", "Within the YouTube app itself, there are also features to manage time spent: Time watched statistics, which shows how much time a user has spent on YouTube in each of the last 7 days, and the Take a break reminder, which periodically prompts the user to take a rest.", "A strength of addressing digital wellbeing via such screentime tools is that time spent is easy to track and easy to understand.", "pattern is  playing by appointment,  wherein a player must return to play on a schedule defined by the game, or else lose their precious resources [121].", "For social media, a common suggestion in popular self-help guides is to take back control by turning off notifications [1, 55].", "However, it is not yet established that these mechanisms are the ones that lead users to feel a loss of control.", "For example, some users report that notifications actually reduce their checking habits, since they know they will be alerted when their desired content is ready [87].", "We investigate two research questions in two studies that build upon each other:", "Design practitioners have raised concerns about dark patterns, interfaces that are designed to manipulate a user into behavior that goes against their best interests [43, 67].", "Brignulls original types of dark patterns focus on financial and privacy harms to the user [16].", "However, given that people routinely report using technology in ways that are a waste of their time and that they later regret [4, 49, 59, 68], there is a need for research to examine which design patterns prompt such attentional harms for the user.", "We might term these attention capture dark patterns, designs that manipulate the user into spending time and attention in an app against their best interests.Techindustry", "insiders, like the ex-President of Facebook, warn that social media apps are especially likely to innovate and employ design patterns that \"consume as much of your time and conscious attention as possible\" [88].", "For social games, one such a proposed", "creators may wish to control how much time users spend on their channel.", "All of these stakeholders merit consideration, however, in this work we focus specifically on users and how design influences the control they feel over the time they spend in the mobile app.", "The two contributions of this work are:", "Second, internal mechanisms shift the focus from fighting distractions to aligning interests.", "External mechanisms often respond to the temptations of problematic apps with microboundaries [29] or restraints on interactions [89].", "However, this sets up an arms race in which the designers of digital wellbeing tools are always in a defensive position.", "An alternative is for designers to reenvision the internal mechanisms that lead to compulsive use in the first place [115].", "Looking at the mechanisms inside of specific apps may encourage designers to not just block existing mechanisms but to innovate better ones, such as Flowstates seven seconds rule for writing.", "This paper presents an examination how such internal mechanisms can be redesigned to support sense of agency.", "At the other end of the spectrum, internal mechanisms contribute to the redesign or rebuild of an experience.", "For example, Focus Mode in Microsoft Word redesigns the writing process by hiding all formatting options [6].", "Going a step further, the standalone app Flowstate not only offers a minimal interface, but also deletes all text on the page if the user stops writing for longer than seven seconds [111].", "Internal mechanisms fundamentally change the experience within a problematic app, or rebuild it into a new experience entirely.", "In contrast to external mechanisms, the space of internal mechanisms is relatively underexplored (see [45, 66] for notable exceptions), but holds particular promise for increasing user agency in two ways.", "First, designers can craft more targeted interventions with internal mechanisms than with external ones.", "External mechanisms, such as locking the user out of a device, often require sacrifices that users are reluctant to accept [56, 115].", "Whereas an external mechanism might block the Facebook app after time is up, a more internal could reconfigure the newsfeed to show only content from close personal friends.", "A redesign of internal mechanisms may be able to remove problematic aspects from an app, while still retaining its benefits.", "The mechanisms 1 of digital wellbeing interventions can be placed along a spectrum (see Figure 1 ).", "At one end are external mechanisms that monitor or police apps, such as screentime statistics and lockout timers.", "A hallmark of an external mechanism is that it functions identically across multiple apps, as in a timer that locks the user out of social media, gaming, and video apps.", "However, external mechanisms do not significantly change the experience within individual apps.", "Sense of agency matters for digital wellbeing in at least three ways.", "First, supporting user control is a common principle in HCI design guidelines [30, 83, 103].", "Designing for an  internal locus of control  is one of Shneiderman and Plaisants Eight Golden Rules of Interface Design, arising from the observation that users want  the sense that they are in charge of an interface and that the interface responds to their actions  [103].", "Second, a low sense of control over technology use predicts greater negative life effects, e.g., internet use leading to missed social activities [20] and smartphone use leading to the loss of a career opportunity or significant relationship [54].", "Scales of problematic technology use generally measure both", "(a) lack of control and", "(b) negative life impacts, suggesting that the problem is a combination of these two factors [21, 24].", "Third, and perhaps most importantly, sense of agency matters in its own right.", "Feeling in control of ones actions is integral to autonomy, one of the three basic human needs outlined in self-determination theory [96].", "More specific to technology use, it is also central to user (dis)satisfaction with smartphones [31, 46] and Facebook use [24, 72].", "work has investigated different ways that interfaces can support sense of agency.", "First, some input modalities seem to support a greater sense of agency than others (e.g., keyboard input versus voice commands) [65].", "Second, a systems feedback should match a users predicted feedback [64].", "Third, a study of flight navigation systems found that increasing the level of automation reduced sense of agency [11].", "These lessons might be revisited in the domain of digital wellbeing, as how an interface modulates sense of agency may vary with context [64].", "explicit attribution of an action to the self or other [113].", "In the present paper, we focus on the latter, judgments of agency.", "Study 1 examines how existing mechanisms in the YouTube mobile app support or undermine sense of agency ( RQ1 ).", "We decided to start by investigating users experiences in the current app before proceeding to design and evaluate potential changes in Study 2 ( RQ2 ).", "Both studies were approved by the University of Washingtons Institutional Review Board.", "all apps, such as the screentime tools that come pre-installed on Android and iOS.", "At present, design researchers have innovated many tools on the external side of the spectrum, that monitor and police multiple apps in the same way [27, 56, 57, 79, 86].", "Likewise, industry designers have built tools that apply the same time lockout mechanism to", "3.1.1 Recruitment.", "To obtain a general sample of users of the YouTube mobile app, we recruited from Amazon Mechanical Turk workers in the United States.", "Participants were invited to  Help us understand how people spend their time on the YouTube mobile app.  They were required to meet four inclusion criteria:", "background; however, Google reports that only 1% of YouTubes monthly visitors subscribe to this service [109].", "Participants answered questions in an online survey.", "The initial questions asked about our four inclusion criteria.", "Eligible participants continued on to background questions about their demographics and YouTube use.", "The complete survey wording, along with all of the other appendices for this study can be found at: https://osf.io/w3hmdToinvestigate", "RQ1 , one question table asked about things that made participants feel most in control of how they spend their time on YouTube (See Table 2 ).", "A second question table asked about things that made them feel less in control .", "The order of these two question tables was randomized.", "In terms of wording, we chose to ask about feeling \"in control,\" as this is how sense of agency has been measured in previous studies of sense of agency in HCI (e.g., [78]) and on a self-report scale [114].", "We used the informal term  things  because, in piloting the survey, we found that testers were unsure about whether certain things (e.g., recommendations and ads) counted as  mechanisms  of the app and we did not want to provide examples that would bias responses.", "In total, each participant was required to submit 6 responses for things that influenced their sense of agency on YouTube (3 for most in control, 3 for least in", "We conducted a coding reliability thematic analysis [12, 15], in which we first established reliable codes for design mechanisms and then used them to generate themes that captured shared meanings.", "We started by iteratively coding the 720 responses (6 per participant).", "Each  thing  was analyzed as a single response, combining answers to the Thing Question and the Explain Question", "3.1.3 YouTube use.", "Participants spent a median of 101 minutes per day (interquartile range: 57-156) on YouTube across all devices in the week prior to the survey.", "Of this time, participants estimated they spent a median of 50% (interquartile range: 30-75%) in the mobile app.", "For comparison, the YouTube press page states that mobile accounts for over 70% of watchtime [120].", "Upon multiplying these two responses together for each participant, we found that participants spent an average of 70 minutes per day in the YouTube mobile app.", "This is similar to the average for all YouTube users: in 2017, YouTube shared that signed-in users spend an average of more than 60 minutes per day in the mobile app [74].", "We neglected to ask whether participants were using the paid YouTube premium service, which removes ads and can play videos offline and in the", "Participants were compensated $6.00 for answering all questions, an amount that exceeds the U.S. minimum wage ($7.25 per hour).", "The survey took a median of 21 minutes to complete (interquartile range: 15-29).", "3.1.2 Demographics.", "A total of 120 participants met the inclusion criteria and completed the survey (see demographics in Table 1 ).", "We excluded responses from an additional 7 participants who started but did not complete the survey.", "We oversampled men, Asians, and young people relative to the 2019 estimates of the United States Census Bureau [116].", "Other participant samples may use the YouTube mobile app differently, e.g., users in emerging countries for whom a smartphone is often their only device for watching videos [105].", "Further research is required to determine whether our results apply to other populations.", "mechanism.Inoursecond pass, we applied the initial codes to 120 randomly selected responses and met to discuss.", "Since one mechanism (recommendations) came up more often than all others, we developed three subcodes for how recommendations affected participant experiences on YouTube.", "After merging similar codes, our codebook consisted of 21 design mechanisms, such as autoplay, playlists, and multiple device sync.", "In our third pass, we each independently coded the same 50 randomly selected responses.", "Interrater reliability was assessed using Cohens kappa, with  = 0.73 indicating substantial agreement [61].", "In our fourth pass, we each coded half of the remaining responses, discussed the final counts, and selected", "In summary, recommendations were the most frequently mentioned mechanism, accounting for 27% of all responses.", "Recommendations, ads, and autoplay primarily made respondents feel less in control.", "Playlists, search, subscriptions, play controls, and watch history & stats primarily made respondents feel more in control.", "Notifications were divided with about half of responses in each direction.", "several representative quotes for each code.", "The first author then wrote up a draft of the coding results and reviewed together with the other authors.", "We mapped codes (design mechanisms) to potential themes, generating three higher-level themes that structured our final writeup.", "In our analysis and writeup, we noted cases where responses for an individual code were split with regards to a theme, e.g., notifications sometimes supported and sometimes undermined planning ahead.", "We further limited coding to responses that specified a mechanism within the interface of the YouTube mobile app, i.e., something the apps designers could directly change.", "This included responses such as,  Recommended videos Being shown recommended videos is like a moth to a light for me,  which was coded as recommendations.", "It excluded responses about situational factors that are largely outside of the control of the designer such as,  I make my own decisions I am a conscious person who can make decisions on what I do.  This eliminated 141 more responses (59 from less in control and 82 from more in control).", "Interestingly, more in control included 28 responses that we coded as willpower, e.g.,  I make my own decisions,  with only 1 such response for less.", "This suggests a potential self-serving bias [40] wherein in-control behavior is attributed to ones own willpower whereas out-of-control behavior is attributed to external factors.", "The other responses that we removed were about characteristics of mobile phones (e.g., The app is easy to access and tempt me on my phone... ) and usability issues (e.g., it crashes on me every other day or so and it consumes a lot of battery life ) that are not specific to the interface of the YouTube mobile app.", "After excluding these responses, we continued with coding the 467 responses that referenced a specific design", "3.4.1 Design Mechanisms.", "467 responses referenced a specific design mechanism (246 for less in control, 221 for more in control).", "Nine mechanisms were described as influencing sense of agency 15 or more times and are the focus of our analysis.", "2 Figure 2 provides a glanceable view of how many times each of these nine mechanisms was mentioned as leading to more or less control.", "Table 3 shows the same data with a description and example response for each mechanism.", "Appendix I contains annotated screenshots that show the exact implementation of these nine mechanisms in the YouTube mobile app as they appeared when participants provided their feedback.", "(i.e., one row in Table 2 ).", "In our first pass, two researchers individually reviewed all responses and met to develop initial codes.", "At this stage, we eliminated 112 responses without any substantive content, e.g., I cant think of anything else.", "Of the 112 responses without substance, 55 came from less in control and 57 from more.", "The design mechanisms we identified in the YouTube mobile app informed three higher-level themes.", "First, users experience actions in the app along a spectrum of consent .", "Second, mechanisms for", "Non-consent was often felt as a result of (perceived) deception.", "For example, users disliked ads, but also expected them and indicated their reluctant consent.", "However, they seemed more upset when the app was unpredictable or violated expectations, as in:  I understand the reason for the ads, but I dont get why some are 5 seconds and you can skip them while others are 60 seconds and you cant.  Other cases where participants felt manipulated included when a  small accidental click  triggered an ad, when video creators were  not upfront  about the products they promoted, and when", "3.4.2 The spectrum of consent.", "Participants sense of agency depended on whether it felt like they had agreed to the actions of the app.", "Participants gave their active consent through actions such as tapping on a play control:  Im watching a video thats taken too long of my time, so I can just pause it and come back to it. I feel control there.  Participants could also issue ongoing consent for the app, e.g., by subscribing to a creator:  My subscriptions show me what I asked to see and I can choose what and when I wish to watch", "planning ahead help them feel more in control.", "Third, the accuracy of YouTube algorithms has mixed consequences for control.", "The writeup for each theme draws upon examples from our coding of the design mechanisms.", "Given their mixed experiences with recommendations, participants expressed frustration with the customization settings at their disposal (or lack thereof).", "Participants lacked the ability to customize the location, quantity, and content of recommendations.", "Having recommendations on almost every screen led to a loss of control:  It seems like there are video recommendations everywhere.", "They are obviously in my home feed; they are in the explore menu; and they are under and beside and within other videos.", "It often takes me", "For relevant recommendations, participants control responses were divided nearly 50-50.", "In contrast to irrelevant recommendations, relevant ones supported control with their personalization (e.g.,  It has some very good algorithms that know what I like, when I want it  ) or with suggestions that reached just beyond the users comfort zone (e.g.,  I can expand my tastes based on my own preference  ).", "However, relevant recommendations sometimes undermined control by being too engaging , i.e., recommending videos that users watch, but that are unplanned and later regretted.", "This was captured in participants use of terms like the  wormhole  (two mentions) and  rabbit hole  (five mentions), as in  The way that videos get promoted to my home page and have appealing thumbnails I end up clicking on them and wonder how I got to this place and why I am watching this video. I ended up going down the rabbit hole and watching the video and then others like it and so on.  Some of these recommendations were described as  clickbait  (six mentions) that misled with content that did not meet expectations and sometimes also violated participants consent (e.g., by showing  inappropriate content ).", "More often though, participants seemed to like the content, but felt that it was too much (e.g.,  At times there is no escape when I become interested in documentary after documentary ) or not the right time (e.g.,  Some of the church videos are addicting and I keep watching them at night  ).", "this, as in  I often spend more time than I meant to because there is a good related video that seems worth watching so ya know, Just one more which becomes a couple hours.  The Watch Later playlist again served as a safety valve in  just one more  situations:  Watch Later means I dont feel pressured into watching a recommended video from autoplay right when I see it.", "Notifications sometimes supported planning and sometimes not.", "For example, they put participants on the spot:  Based on my viewing history, the app will push me new content and I may not have the fortitude to not click to view.  However, notifications also helped participants plan when to check the app by reducing their fear of missing out:  With notifications I will know exactly when a new video goes up that I may be interested in watching. This way I am not randomly checking for uploads and spending extra time searching and browsing.  This may explain why notifications were split between more in control and less in control responses (47% vs. 53% ).", "By contrast, sense of agency was diminished by mechanisms that prompted and pressured participants with suggestions that were hard to decline.", "Autoplay and recommendations frequently led to", "3.4.4 The accuracy of algorithms has mixed consequences for control.", "Irrelevant recommendations, i.e., those that were repetitive or unrelated to personal interests, universally undermined sense of agency:  Seeing recommended videos that have nothing to do with my viewing history leads to unwanted scrolling and possibly unwanted content.  Similarly, irrelevant search results undermined control because they forced participants to keep scrolling for what they wanted, e.g.,  I use specific search terms, but I still have to scan past a lot of vaguely or even unrelated stuff to find what I want.", "3.4.3 Planning ahead.", "Participants felt more in control when they planned their consumption in advance.", "Playlists helped participants plan how much to watch (e.g.,  I can create playlists or queue videos in advance to limit what I watch to a specific list instead of endlessly searching around for what I want ).", "Participants described the end of a playlist as a  good place to stop  , in contrast to browsing recommendations, which they described as endless.", "Watch Later, a default playlist on YouTube, also let participants control when and where to watch.", "A guitar teacher described how Watch Later empowered them to save videos on-the-go and watch them later in their music studio.", "Watch history & stats also supported planning by providing an awareness that participants could use to adjust their behavior:  I can look at my watch history and see how many videos I have watched today. That puts it into perspective if I should spend time doing something else if I am spending too much time on YouTube.  Several participants described using this awareness in conjunction with the Watch Later playlist:  I am able to put a video in my Watch Later playlist if I think I have spent too much time on YouTube for the day.", "autoplay  automatically  turned on.", "Participants disliked when the app openly acted against their interests, but expressed stronger sentiments when they felt that the app also misled them about it.", "A minority of responses described recommendation settings that do support sense of agency.", "For instance, three participants appreciated how the settings menu (:  ) allows them to mark Not interested on specific videos, e.g.,  When Im tempted but know a video is not educational I can hide it.  In this case, the user is in fact interested in the sense that the video recommendation arouses their curiosity and attention.", "However, they must paradoxically mark it as Not interested in order to tell the interface to stop showing videos of this kind because they conflict with their longerterm goals.", "YouTubes settings also allow participants to delete videos from their watch historywhich stops them from being used in personalized recommendationsbut only one participant mentioned this feature.", "The vast majority of participants seemed either unaware of YouTubes existing customization settings for recommendations or found them inadequate.", "We note that although our research focuses at the level of design mechanisms, the details of these designs matter.", "For instance, although the recommendations in the current version of YouTube seemed to reduce sense of agency in most of the Study 1 responses, a different implementation of recommendations might produce different effects.", "This is true of our mockups too: in our search redesign we showed a task-oriented example query (  How to cook a turkey  ) , whereas a leisure-oriented example query (e.g.,  Funny cat videos ) could have led to different results.", "We include descriptions of the most relevant details of each of these design mechanisms in the body of the paper, screenshots of their current implementation in the YouTube mobile app in Appendix I , and images of all of our mockups in Appendix II .", "In preparation for the evaluation co-design activity, five of the authors (KL, HZ, JVL, JC, KF), all advanced-degree students in a technology design program, created mockups of changes to mechanisms in the YouTube mobile app that we expected to impact sense of agency.", "To generate a wide range of possible changes, we started with a design brainstorm that generated 67 different ideas, e.g., creating a How-to mode for viewing only educational content, reducing video playback speed to 50% after a daily time limit is exceeded, or making Watch Later the default action for recommendations.", "Ideas were reviewed as a group and favorites could be claimed by one author who further refined it.", "This generated a total of 33 different sketches.", "We presented, discussed, and then scored these sketches according to three criteria: expected impact", "mockups for the seven sketches with the highest average scores.", "We wanted participants to evaluate a variety of potential changes to each mechanism, so we created three versions of each mockup: low, medium, and high-control.", "For example, the recommendations mechanism in the YouTube app was redesigned to change the number of recommendations shown on the homepage, with the low-control version showing unlimited recommendations, the medium-control version showing only three recommendations with a button to show more, and the high-control version not showing any recommendations (see images in Table 4 ).", "To focus on RQ2, our results and analysis here address only the four mockups (see Table 5 ) that directly change one of the existing internal mechanisms in YouTube that we identified in Study 1.", "The other three mockups we testedactivity-goal setting, time-goal setting, and a timerare more external mechanisms that might apply equally well to other apps.", "However, we decided to focus this paper on the unique potential of internal mechanisms.", "Study 1 identified existing mechanisms in the YouTube mobile app that influence user sense of agency ( RQ1 ).", "In Study 2, we sought to understand how changes to these design mechanisms might influence sense of agency ( RQ2 ).", "We conducted 13 study sessions with individual YouTube users that included two co-design activities:", "1) sketching participant-generated changes; and", "2) evaluating researcher-generated changes that were based on the results of Study 1.", "Consistent with a research-through-design approach [122], the aim of these activities was not to converge upon a single solution but rather to generate knowledge, i.e., what to design for a sense of agency.", "down the rabbit hole.", "Up next recommendations that appear below the current video (and autoplay after it finishes) were specifically mentioned seven times.", "The  endless  quantity of recommendations also made it hard to stop watching.", "Finally, participants also wanted to control what content is recommended, particularly when recommended content did not match their aspirations:  There are cases in a particular day where I just want to watch cat videos. But I do not want my entire screen to recommend cat videos.  Participants wanted to customize the content of recommendations more directly than just by generating a watch history:  The only thing you can do to control the algorithm is to watch videos. But you get no say how itll recommend new ones.", "4.2.2 Demographics and YouTube use.", "13 YouTube users (7 women, 6 men) participated in our sessions.", "The median age was 29 (range: 18-36).", "Participants reported using YouTube a median of 52 minutes per day (range: 27-70), again based on checking their time watched statistics in the YouTube mobile app.", "For reference, this amount of time is slightly lower than the average of signed-in YouTube users (60 minutes) [74] and considerably lower than the median of participants in Study 1 (101 minutes).", "on sense of agency (based on the results of Study 1), novelty relative to existing digital wellbeing tools, and feasibility of implementation.", "3 Expected effect on sense of agency was weighted twice in our scoring.Wecreated", "4.2.1 Recruitment.", "We recruited YouTube users in Seattle via email lists and social media channels to  Help us understand how people spend their time in the YouTube mobile app.  We did not initially set inclusion criteria for participation (beyond adult YouTube users) as we viewed our co-design activities as exploratory.", "However, after our initial sessions proved insightful for our team of design researchers, we sent a follow-up survey to participants that asked about demographics and YouTube use.", "Participants were compensated with a $30 voucher.", "We used codebook thematic analysis to analyze the data [13, 15], wherein we generated themes that are more interpretive than just a summary of all of the data, but less interpretive than in reflexive thematic analysis where the researchers subject position plays a central role in the analysis [14].", "After each co-design session, the researcher leading the session completed a debriefing form with their top three takeaways and shared participant sketches with the rest of the research team.", "We held weekly meetings to discuss these data and discuss initial ideas.", "After finishing data collection, all codesign sessions were transcribed.", "To further familiarize ourselves with the data, three of the authors read the transcripts and again reviewed the sketches.", "We next independently coded the data using a web app for collaborative coding [104] to generate our set of initial codes.", "After reviewing this first pass of coding together, we refined and consolidated codes and generated initial themes.", "Our final set of codes included: user freedom of choice, situational", "features affecting control, design mechanisms for control, setting clear expectations for the user, and triggers to stop, each of which had further subcodes.", "We applied our codes to all transcripts and sketches and reviewed the results to create our final themes.", "For each theme, we extracted vivid exhibits [7], which we used to write analytical memos.", "4.3.2 Co-design Activity1: Sketching.", "Toelicitparticipant-generated ideas, we asked participants to sketch over paper mockups of three key screens: home, search, and video player (see Figure 3 ).", "Each screen represented a minimal version of a video app without recommendations, rather than a direct copy of the current YouTube interface.", "We chose this minimal version to encourage participants to generate new ideas, rather than to evaluate the existing interface (which we did in Study 1).", "Participants were handed a pen and a copy of one mockup (e.g., the home screen) and were asked,  What would you change on this page to feel more in control of how you spend your time on YouTube?  They then received a second copy of the same mockup and were asked to sketch changes that would make them feel  less in control.  Each participant created a total of six sketches (two versions of three different screens).", "As they sketched, participants were asked to explain their thinking [99].", "Sessions included an initial think-aloud demonstration of their current YouTube use, followed by sketching and evaluation codesign activities.", "The median length of a session was 73 minutes (range: 57-105 minutes).", "We generated two themes about how participants expected changes to the design mechanisms of YouTube would affect their sense of agency.", "First, participants wanted design mechanisms that provided more control when they had an intention in mind as opposed to when they just wanted to explore.", "Second, participants envisioned and wanted mechanisms for active and informed choices to increase control.", "4.3.3 Co-design Activity 2: Evaluation.", "To receive feedback on our changes from YouTube users, we asked participants to evaluate our mockups of the redesigned mechanisms in the YouTube mobile app (see Table 5 ).", "For each mockup, the three different versions were placed in front of the participant in a random order, they reviewed for about one minute, and then asked any questions they had.", "We did not tell participants which one was the low, medium, or highcontrol version.", "The participant was then asked to rank the three versions in order from the one they would least prefer to use to the one they would most prefer, and explain why.", "4.5.1 Specific intentions call for more control.", "When individual participants reviewed the different versions of their own sketches and our mockups, they were often conflicted about how much control they preferred.", "It depended upon the situation.", "When they had a specific intention or goal for their YouTube visit (e.g., to cook a", "4.3.1 Think-aloud Demonstrations with YouTube App.", "In a modified version of a think-aloud-protocol [53], the participant opened YouTube on their smartphone and talked us through a typical engagement cycle (how they start and stop use) [115].", "Next, they showed and talked us through the mechanisms that made them feel most and least in control of how they spend their time on YouTube.", "Together, our two studies identify design mechanisms that influence sense of agency in the YouTube mobile app and how they might be changed to increase it.", "In Study 1, participants reported that, in the current app, recommendations, ads, and autoplay mostly led them to feel less in control, whereas playlists, search, subscriptions, play controls, and watch history & stats mostly made them feel more in control.", "Across all existing mechanisms, participants felt less in control when the app took actions of its own without their consent (e.g., autoplaying a new video recommendation).", "Recommendations were of special concern and participants expressed frustration at their inability to customize their location, quantity, and content.", "In contrast, by helping participants plan ahead for even just a short while, existing mechanisms like playlists and watch stats made participants feel more in control.", "Sometimes participants held intentions with a moderate level of specificity, in which case participants wanted to retain some control but also delegate some to YouTube.", "Often these intentions were topical, as in when P11 wanted to be able to use the app in an  active way  to search and browse videos about programming, but not in a  passive way  to follow just any recommendation.", "Sometimes, these intentions were temporal, such as when working or studying, participants preferred a version of YouTube that helps them watch a moderate number of videos without making them  fall down a rabbit hole of similar related stuff  (P13).", "To address these cases, participants sketched both changes to internal mechanisms that were specific to YouTube (e.g., limits on the number of recommended videos) and also more external mechanisms that might apply across a variety of social media apps (e.g., time reminders).", "sketches also supported more informed choices.", "These designs made it easier for users to know what to expect from a video by surfacing metadata like view count, user ratings, and descriptions.", "Five participants proposed novel metadata, such as an activity time filter that would sort how-to videos by the time it takes to perform the activity they teach, e.g., cook a recipe (P12).", "Another suggested expert ratings as an indicator of quality (P5).", "Conversely, in sketches to undermine control, it was common to remove video metadata.", "P12 likened this to the experience at Costco, a supermarket chain that deliberately shows no signs in its stores [84]:  If you want to go find cookies, they wont actually show you where the cookies are so you literally have to go through every single aisle. You have to go find it.", "We expect that our findings on how design mechanisms influence sense of agency on YouTube are most likely to generalize to other social media and media apps where users", "(a) report feeling out of control at times (e.g., Facebook [72]); and", "(b) use the app for both", "When participants envisioned and evaluated changes in Study 2, they wanted more opportunities to make active choices, rather than respond to a set of choices proposed by the app.", "This preference was stronger when they had a specific intention in mind (e.g., to watch a certain video or topic), whereas when their intention was more general (e.g., to pass the time) they favored turning control over to YouTube.", "More choice alone did not lead to more control.", "In sketches of designs to undermine control, participants covered every corner of the home screen with video recommendations that scrolled infinitely (P11) and in every direction (P5).", "P13 described,  If they didnt have [recommended videos], it would be a lot harder to follow these different rabbit holes. I imagine that I would have to intentionally seek out another video, so I wouldnt feel sucked in as much.  Recommendations prompted a passive form of choice, in which users reacted to the apps infinite scroll of suggestions, rather than making active choices on their own terms.", "a billion recommendations on the home screen.", "Its just a search bar.", "You go straight to what you want to watch, you watch it, and then youre done.", "Participants described search as a paragon of user-led choice, and many foregrounded the search option in their sketches to increase control and hid it in ones to decrease control (see Figure 3", "recipe), they wanted design mechanisms that provided greater control.", "When they had a non-specific intention such as relaxing, they preferred design mechanisms that turned control over to YouTube.", "For participants, specific intentions varied from watching a video of a favorite dance, to the latest basketball highlight, to a tutorial on solving a Rubiks Cube.", "When they had such a specific intention in mind, they wanted greater control than YouTube currently gives them.", "P4 removed recommendations from their sketch, explaining:  If I have a specific goal, I know what I want, I dont need recommendations to guide my search, I just want to be in control of my search.  P2 evaluated our redesign of the search mechanism that emphasized results with higher entertainment value by saying,  Im probably going to click on it because its cute and Im just going to waste so much time. So its going to make me feel totally out of control of what I actually wanted to come here for.  In these cases, participants wanted stronger control mechanisms so that the app would not hijack their specific intention.", "4.5.2 Active and informed choices.", "The Study 1 theme Spectrum of consent addressed whether the user had agreed to an action taken by the app (e.g., autoplaying the next video).", "To support control, Study 2 participants envisioned more active choices, where the user felt like they were the one to initiate the action.", "As a step in this direction, P1 described a home screen that presented,  Six categories we think youre most interested in, and then youre at least making the active choice, I want to watch some interviews right now.  In this design, the apps algorithm would recommend a set of personalized topics, but the user would be the one to choose between them.", "A still more active choice was when the user was the one to generate the set of choices in the first place, as in P7s sketch:  There arent", "By contrast, when participants had only a non-specific intention (e.g., to unwind or explore), they wanted YouTube to lead the way.", "Our redesigns of the recommendations mechanism showed either unlimited, limited, or no video recommendations, to which P2 responded  If I came here for a specific reason, like my goal is to learn how-to do something, then I prefer this one without recommendations. However, if I just want to watch something that gets my mind off things, I prefer the one where I can choose to show more recommendations.  At times when participants just wanted to be entertained, designing for greater control could actually get in the way.", "P13 shared,  If youre not giving me recommendations, and if youre making me search, then Im not in control. Or, Im in control, but the problem is Im spending more time. Theres no point.", "Our findings call for rethinking what relevance means for recommendations in the context of digital wellbeing.", "Prior research on recommender systems has argued that being accurate is not enough, as a fixation on accuracy can lead designers to ignore important facets of user experience like serendipity [77, p.1].", "For participants in our study, sense of agency was clearly a neglected facet of user experience, as YouTubes recommendations led them to actions (i.e., watching more videos) they did not feel in control of.", "To be clear, this does not mean that Google or others should try to create an algorithm for life that recommends between watching another video, writing a term paper, and going to sleep.", "However, it does suggest that recommender systems could first start with the global problem of when to show recommendations, before moving on to the local problem of which items to recommend.", "For example, a decision not to show recommendations might be informed by the time of day (e.g., 2am is too late), screentime preferences (e.g., when the user has already exceeded their goal of 30-minutes per day on entertainment apps), or explicit user preferences (e.g., only show three recommendations unless I clickto-show-more).", "In HCI research, sometimes the implication of a user needs assessment is not to design technology, as a new technology might not be appropriate in the context of the larger situation [9].", "Similarly, for recommender systems, our findings suggest that sometimes the implication is not to recommend.", "Prior work has addressed how a system can display the level of confidence it has", "Whereas both of the studies in this work elicit user preferences (what users say), the dominant paradigm of recommender systems today, including YouTube, is behaviorism: recommendations largely neglect explicit preferences and instead rely on behavior traces (what users do) [37].", "The present bias effect [85] predicts that actual behavior will favor the choice that offers immediate rewards at the expense of long-term goals.", "In this way, recommender systems reinforce the sometimes problematic behavior of the current self rather than helping people realize their aspirational self that reflects long-term goals [37, 69].", "Second, recommendations were sometimes too relevant, which presents a more vexing problem from a digital wellbeing perspective.", "For example, participants reported that they sometimes saw too many interesting recommendations (e.g., for documentaries or for church videos late at night), which made them feel a loss of control.", "In this case, YouTubes algorithm is arguably too good at a local optimization problem: Out of millions of videos, which one is the user most likely to watch?", "But it misses a more global optimization problem: Out of many possible actions, which one does the user most want to take?", "In these cases, recommendations appealed to a users impulse or short-term desire to watch more videos, but conflicted with their long-term goals, creating a self-control dilemma for the user [36, 70].", "First, recommendations were sometimes irrelevant, showing videos that participants were simply not interested in.", "However, due to rapid advances in artificial intelligence and recommender systems like YouTube specifically (e.g., [28]), one might expect recommendations in social media apps to become more and more relevant in the coming years.", "Participants also wanted to customize the content of recommendations, e.g.,  I do not want my entire screen to recommend cat videos.  Today, the dominant paradigm of recommender systems, including YouTube, is behaviorism: recommendations rely on behavior traces (what users do) and largely neglect explicit preferences (what users say).", "In this way, recommender systems reinforce the sometimes problematic behavior of the current self rather than helping people realize their aspirational self that reflects long-term goals [37, 69].", "Designers might address this by making it easier for users to", "(a) explicitly state preferences for topics they would like to see or not see;", "(b) explicitly rate recommendations (e.g., show me more like this one);", "(c) edit their viewing history to influence future recommendations (e.g., delete all cat videos); or", "(d) select an algorithmic personae to curate their recommendations (e.g., The Diplomat, who brings news videos from the other side) [45, p.72].", "The current YouTube app offers limited support for these first three features (e.g., users can select from among topics for recommendations on the home page of the app), but participants in our study seemed mostly either unaware of these customization settings or found them to be inadequate.", "Behavior change researchers have long known that plans can help bridge the gap between intentions and behavior.", "In this work, plans are usually crafted in advance through careful deliberation and guide behavior for some time into the future [3].", "For example, a screentime tool in this mold might ask the user to review and reflect upon their past usage data and develop a plan for their use over the next month.", "Participants in our study also planned, but they did so in a more ad hoc manner.", "For example, they queued videos in advance to limit what they watched during a single session or glanced at their Time watched statistics to know whether to watch another video or add it to their Watch Later playlist.", "Recommendations were mentioned by participants as undermining sense of agency far more times than any other design mechanism in the YouTube mobile app, suggesting that recommender systems [93] should be of central concern to digital wellbeing designers.", "However, they led to a reduced sense of agency via two very different routes: irrelevance and relevance.", "in its recommendations to the user [76], but this should be preceded by a more fundamental question of whether or not to show recommendations in the first place.", "To summarize, we encourage designers of recommender systems to think beyond just optimizing for the item that is most likely to be clicked, watched, or liked.", "This includes considering when to show recommendations in the first place.", "It also means exploring how recommendations can support user aspirations rather than just reinforce current behaviors, which requires better measures of long-term preferences.", "Designers and researchers should continue to explore how to personalize recommendations to satisfy these broader user needs, or provide customization options that put users in control at least to the extent they want.", "specific and non-specific intentions (e.g., Pinterest [24]).", "We first discuss our findings mostly with respect to our test case of YouTube, before considering implications for digital wellbeing more broadly.", "These types of actions might be called microplanning, making lightweight plans that guide behavior for a short time, usually just a single session of use.", "Our naming takes inspiration from Cox et al.", "s coining of the term microboundary to describe  a small obstacle prior to an interaction that prevents us rushing from one context to another , which serves as a micro version of a commitment device that prevents the user from  acting hastily and regretting it later  [29].", "Microboundary has helped center an important concept from behavioral economics, commitment devices that restrict future choices to reflect long-term goals [17, 97], in the research and development of digital wellbeing tools, e.g., [56, 57, 70, 92].", "participants preferred higher-control mechanisms when they had a specific intention in mind and lower-control ones when they had a non-specific intention.", "This finding broadly aligns with two types of viewing that have been identified in uses and gratifications research on television use [95]: (1) ritualized use, openended use to gratify diversionary needs; and (2) instrumental use, goal-directed use to gratify informational needs.", "On this view, the current version of the YouTube app appears to offer good support for ritualized use, but poor support for instrumental use, as participants often felt that their specific intentions were hijacked by its autoplay and endless recommendations.", "Similarly, we hope that the concept of microplans encourages the use of behavior planning knowledge in the design of digital wellbeing tools.", "For example, this literature finds that plans are more likely to succeed if they specify where, when, and how a behavior will be enacted [41].", "A microplan might incorporate just the where part, and be supported by a video playlist that is tied to a specific location, e.g., song tutorials for my guitar studio .", "Triggers are also a key component of effective plans [39], so in this case the playlist might be the primary recommendation in the app anytime the user is within 50 meters of the studio.", "In another example, Hiniker et al. adapted an evidence-based Plan-Do-Review sequence [38] for an app that asked children to plan out their video-watching, finding that it helped them transition to their next activity with ease [50].", "In the domain of impulse buying [81], an e-commerce site (or third-party extension) might foreground shopping list tools to support intentional buying.", "How might a single app support sense of agency for both ritualized and instrumental use?", "One approach is a customizable interface that lets the user switch between low and high levels of control.", "This can be done at the app-level, e.g., switching between an Explore Mode and a Focus Mode.", "Or it can be done at a mechanism-level, e.g., YouTube currently offers an on/off toggle for autoplay, but does not provide any way to toggle recommendations,", "We caution that the message of attention capture dark patterns should not be never X, but rather be careful when X.", "Participants in both of our studies reported mixed experiences with many design mechanisms, including autoplay and recommendations.", "An outright", "In Study 2, participants suggested ways that the YouTube mobile app might be redesigned to increase sense of agency (e.g., by reducing the number of recommendations it displays).", "However, such changes might lead to adverse effects as there were also times when participants preferred low-control features.", "Although HCI design guidelines advise supporting user sense of agency [83, 103], we should not assume that a greater sense of agency is always desirable.Specifically,", "which were the mechanism most frequently mentioned as leading to a loss of control in Study 1.", "This approach may be particularly suitable for power users, as prior research indicates that power users prefer interfaces that are customizable (user-tailored) by a toggle, whereas non-power users prefer ones that are personalized (system-tailored) for them [112].", "A second approach then is an interface that is personalized for the user based on a prediction model.", "Recent work has found that classifiers can be trained to predict these types of media use with high confidence, e.g., for Pinterest [25] and smartphone use [51].", "For example, if YouTube expects that the user is visiting for ritualistic use, it could remain as is, or even go further to take control as in its Leanback mode for  effortless viewing  that autoplays a neverending stream of high-definition recommendations [42].", "Both our own findings on autoplay and previous work suggest that such a high level of automation would reduce sense of agency [11], but it may still be the interface that the user prefers in this situation.", "Conversely, if YouTube has high confidence that the user is visiting for instrumental use, it could present a search-only interface and hide all recommendations.", "Finally, if it has low confidence in its prediction, it could present a middle-ground interface that shows limited recommendations, or it might err on the side of caution and lead with a search-first interface in case the user has an intention to express.", "Developing such a lingua franca of attention capture design patterns could be integrated into design education [43], influence designer thinking, and reputations, as is done by the name-andshame campaign of the darkpatterns.org website [16].", "At the company level, it could help inspire products that are mindful of the users sense of agency.", "For example, in spite of the incentives of the attention economy, Apple is now working to make privacy a selling point [44], e.g., by preventing developers from tracking users across multiple apps without their active consent [5].", "At the regulatory level, a recent review of dark patterns by Naraynan et al. notes that if the design community does not self-regulate by setting standards for itself, it may be regulated by more onerous standards set by others [82].", "The U.S. Senate is currently considering how to regulate social media, with one bill that would make it illegal to  manipulate a user interface with the purpose or substantial effect of obscuring, subverting, or impairing user autonomy  [75] and another that would ban autoplay and infinite scroll [23].", "For designers, the language of dark patterns is an important way to contribute to a broader critical discussion of design practices in the the technology industry [43].", "Our findings address what and when to design to increase sense of agency.", "However, in the attention economy, what might motivate key stakeholders to support such designs?", "One step is for the design community to develop a common language of attention capture dark patterns that recognizes designs that lead to attentional harms.", "In addition to the previously stated limitations of our participant sampling and focus on design mechanisms as a unit of analysis, our work also has at least four conceptual limitations that could be explored in future work.", "First, both of our studies asked participants to share their preferences, however present bias [85] predicts that actual behavior will favor the choice that offers immediate rewards at the expense of long-term goals.", "An in-situ study of how people respond to redesigns intended to influence sense of agency would yield results on (what users do), which might need to be reconciled with the present results on (what users say).", "Second, time and attention are not the only factors that influence sense of agency.", "By asking participants in both studies to reflect on  ...in control of how you spend your time on YouTube  we discouraged participants from considering other factors such as privacy [112].", "In Study 2, this may have primed participants to focus on sense of agency over other factors when evaluating which version of the mockup they preferred.", "Third, self-reported agency can be quite different from the facts of agency [30, 80].", "For example, many people continue to press placebo buttons like the close door button in their apartments elevator, even when doing so has no effect [90].", "There is therefore a concern that designs to increase sense of agency may be disconnected from actual ability to influence the world.", "Fourth, users are not the only stakeholders on YouTube, and it would be a mistake to optimize for their sense of agency alone.", "Google, creators, advertisers, and even society itself all have a stake in what happens on YouTube.", "For instance, radicalizing political videos can make viewers feel as if they have uncovered powerful conspiracies that were previously hidden from them [94]; to support sense of agency in this use case would be dangerous.", "User sense of agency needs to be integrated into larger design frameworks as one important consideration among many for social media apps.", "ban on these mechanisms is likely to reduce sense of agency in a substantial number of situations where the user just wants to explore.", "Instead, a nuanced guide to dark patterns might present examples of the problem, followed by counterexamples where such a pattern is appropriate.", "While this creates a murky gray middle, it also better describes the effects of the design mechanisms that we identified in our studies.", "of use, to increase user sense of agency.", "Finally, we propose language that the design community might adopt to recognize design patterns that impose attentional harms upon the user.", "Whereas a common approach to digital wellbeing is designing to reduce screentime, this work takes an alternative approach of designing to increase sense of agency.", "In two studies, we identify mechanisms within the YouTube mobile app that participants report influence their sense of agency and how they want to change them.", "We find that participants generally prefer mechanisms like autoplay and recommendations to be redesigned for a greater sense of agency than the YouTube mobile app currently provides.", "For digital wellbeing designers, we highlight a need for recommender systems that better reflect user aspirations rather than just reinforce their current behavior.", "We also propose mechanisms that support microplanning, making lightweight plans to guide a single session", "This work was funded in part by National Science Foundation award #1849955.", "We thank Xuecong Xu, Ming Yao Zheng, Kevin Kuo, Tejus Krishnan, Laura Meng, Linda Lai, and Stefania Druga for helping to conceptualize this study and design the mockups."]}
