{"paper_id": "2103.06807", "sentences": ["Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page.", "Copyrights for components of this work owned by others than ACM mustbehonored.Abstractingwithcreditispermitted.Tocopyotherwise,orrepublish,topostonserversortoredistributetolists,requirespriorspecificpermissionand/orafee.Requestpermissionsfrompermissions@acm.org.", "2021 Association for Computing Machinery.", "CHI 21, May 813, 2021, Yokohama, Japan", "ACM Reference Format:", "https://doi.org/10.1145/3411764.3445497", "ACM ISBN 978-1-4503-8096-6/21/05..", "We believe that adaptive systems could provide greater benefits by planning sequences of adaptations that gracefully lead a user through gradual changes.", "However, non-stationarity makes planning challenging: considering only a short period of time (i.e. a short horizon) can result in suboptimal designs.", "An adaptation that is overfit to a novice could be impossible to recover from later on when the user is more experienced.", "On the other hand, planning a long sequence of adaptations increases the size of search space, growing exponentially with the length of the planning horizon.", "Adaptive user interfaces can autonomously change the content, layout, or style of an interface to improve their fit with the users capabilities and interests.", "This paper looks at a foundational technical problem of adaptive interfaces that lies at the intersection of humancomputer interaction and machine learning research: How to select adaptations?", "An adaptive system must decide what to adapt, and when  or when not  to make changes.", "Different computational approaches to this problem have been studied, among others, rule-based systems, heuristics, bandits, Bayesian optimisation, and supervised learning (see section 2).", "Although positive empirical results have been obtained (e.g., [4, 13, 17, 46, 49, 51, 52, 54]), known approaches have been criticised for being unpredictable and unreliable; they pick detrimental adaptations unacceptably often [16, 22, 33, 36, 56].", "Our work contributes to methods for adaptive interfaces designed to operate autonomously, that is without explicit feedback or training samples from user.", "The core computational problem we review here is how to pick an adaptation; we do not cover issues like prior elicitation, explainability, nor the design space of intelligent interaction techniques.", "sequence of adaptations with predictive models  is computationally costly, especially when considering sequences of changes over a long horizon.", "To solve this computational problem in an online setting, we use a combination of Monte Carlo Tree Search (MCTS) for planning, and deep learning to boost performance.", "To avoid extensive trial-and-error with users in the loop, our deep learning models are trained offline using HCI models.", "Our general approach can be applied for various HCI applications, such as adaptive mobile homescreens, graphical layouts, and application menus.", "We demonstrate it specifically in the context of adaptive menus .", "The task is to adapt the interface by changing the arrangement and grouping of menu items (Figure 1), thus improving the menus usability.", "We exploit and extend multiple menu search models from literature to estimate the upper and lower bounds of the value of an adaptation as well as their change as the user learns.", "This helps us form an adaptation policy that accounts for different user strategies and avoids adaptations that incur high costs to users.", "Our technical evaluation shows that our solution can tackle realistic problem sizes, and find favourable adaptations, on a commodity computer.", "Finally, we present results from an empirical evaluation where the approach compared favourably against a non-adaptive baseline design and a frequency-based adaptation policy.", "Estimation of utility is required for selecting an adaptation.", "Utility  in this case  refers to the usefulness of an adaptation to the user, or how it is perceived to benefit interaction when possible costs are taken into account.", "Picking an adaptation can be considered a hypothesis on how useful it is for user.", "Unfortunately, utility is very hard to estimate accurately  hard both at design time as well as interactively from the kind of data these systems have access to, such as clicks or viewing duration.", "In machine learning terms, utility is latent .", "Moreover, in adaptive interaction, utility is also non-stationary .", "That is, the skills and interests of the user evolve over time.", "A change that would make sense in the beginning when the user is novice with the design may be devastating for an experienced user.", "Early work on this topic studied rule systems, heuristics, and logic as the basis of deciding what to adapt (see, e.g., [44]).", "For example, in menu-based interaction, most systems still follow a heuristic approach, where adaptation is picked based on hand-written heuristics that exploit click frequency, visit duration, recency or other specific features that can be computed from observation data [21].", "These approaches, in general, are feasible only when sensed input is highly predictive of the most appropriate adaptation.", "Another limitation is that writing a comprehensive and accurate rule system requires plenty of foresight.", "A rule system must be developed that, on the one hand, covers conceivable conditions the system can enter and, on the other, can graciously resolve conflicts when multiple rules apply.", "Model-based reinforcement learning is here developed as a principled and effective approach to these issues.", "We define the adaptation problem as a stochastic sequential decision problem [7], where the adaptive system should plan a sequence of adaptations over a long horizon.", "Reinforcement learning (RL) is a class of machine learning methods appropriate for this type of problems.", "Typically, a policy is learnt via trial-and-error that maximises future cumulative utility.", "Our RL approach is model-based as it uses predictive HCI models to estimate utility.", "These models simulate consequences  benefits and costs  of possible adaptation sequences without actually executing them [28, 50].", "However, their application is conditioned on their accuracy: They should accurately predict short-term costs such as due to relearning as well as longer-term improvements to performance.", "Generally, such models are available at least in the areas of pointing, menu interaction, and graphical layouts.", "In comparison with an alternative, the model-free approach, the model-based approach requires less training and better generalises across conditions [28, 50].", "However, finding the best adaption  by assessing the value of each", "To sum up, this paper makes three key contributions:", "We formulate the problem of adaptation as a stochastic sequential decision-making problem [7].", "The adaptive system must decide what to adapt, if anything, given its observations.", "It should pick a sequence of adaptations in order to maximise their expected value to user over a longer window of interactions.", "For example, in our application example later on, we optimise for performance improvements in menu selection tasks achievable over multiple sessions of interactions.", "Further, in a stochastic problem, the world is neither fully known nor under the control of the system.", "In our case, while the system can change the interface, it cannot change the human, which has its own latent processes.", "For example, humans learn and change interests.", "This complicates the problem: Any greedily chosen adaptation may lead to irreversibly poor interactions later on.", "Thus, adaptations must be picked with a horizon of such developments in mind.", "rest of the section, we focus on the general case, where both inference and decision-making are required and non-trivial.", "In the following, we formulate this problem as a Markov decision process (MDP).", "The benefit of an MDP formulation is that it offers a rigorous and actionable understanding of the problem.", "In particular, it (1) illuminates the decision problem, (2) links it to a body of theoretical results and practical approaches in AI and ML research, and (3) points toward appropriate algorithmic solutions.", "The prevailing understanding is that learning is a key capability for adaptive systems [32].", "Two learning capabilities are needed: (1) inference , the capability to update assumptions about the user based on observations; and (2) decision-making , the capability to choose appropriate adaptation in the light of assumptions about the user [41].", "The two challenges can be relaxed, for example if user state is trivially known, or if the state is highly predictive of appropriate adaptation.", "In the latter case, the problem can be approached as a supervised learning problem, where a mapping is learned between user data and suitable adaptations.", "While this approach has been successful for input techniques, such as gesture recognition [57], it is an open question if this scales up to adaptive interfaces, which must not only learn user state but flexibly decide how to intervene in the user interface.", "A practical obstacle is how to obtain a dataset that describes the consequences of possible adaptations on possible users.Inthe", "Bayesian optimisation generalises bandit systems to the case of multiple interrelated decision variables [47].", "It is a global optimisation method that tries to find optimal adaptation by probing to a black box function; here, the user.", "It is a robust and sample-efficient and well-suited for noisy, expensive-to-evaluate functions.", "The method uses a surrogate model for approximating the model fit across the parameter space and quantify uncertainty.", "This is necessary for the acquisition rule to address the explorationexploitation trade-off.", "This way, it is possible to learn adaptive responses via trial and error.", "Applications have been shown in human-in-the-loop design of interface features [15] and adaptation of low-dimensional design features [30].", "However, while bandits and BO have been successful in simpler adaptation problems, like recommendations and calibration of interface parameters, their intrinsic limitation is that they are myopic; that is, they do not plan over a series of changes  a capability we need in adaptive interaction.", "learn a good policy [50] This makes it poorly suitable for situations with very large state-action spaces.", "Model-based RL uses a predictive model to simulate possibilities without first trying them out, which is useful for adaptive interfaces, because it significantly improves the efficiency of finding good solutions [28].", "A policy can be determined with much fewer trials, and if the model is good, at times directly.", "Outside of user interfaces, we find applications of model-based RL, for example in board games, robots, video games [29], as well as behaviour-change applications, such as in generating behavioural instructions for people with dementia [23].", "A grand obstacle for applications in adaptive systems is the model: where to get a good one?", "A related problem is that of drift : prediction errors can have a compounding, cumulative effect on planning performance.", "In HCI, although previous work has explored the use of model-free RL (e.g., see [35]), model-based RL has not been explored in adaptive interfaces at large, as far as we know.", "Also, while predictive models have been used for oneshot design generation [42], design space exploration [53], and for selecting a single action in a myopic manner [27, 51], they have not been used for simulation-based planning in an adaptive system.", "In this paper, we approach the fundamental problem of selecting user interface adaptations by applying model-based RL, and exploiting predictive HCI models, to simulate and plan adaptations.", "Unlike bandits, reinforcement learning permits learning policies for sequences of actions where rewards are not immediately achievable.", "While applications have been shown for example in crowdsourcing [14], dialogue systems [58], and gaze-based interactions [20], a known limitation with the prevailing model-free RL approach is still the extensive amount of poor attempts (or trials) that are required to", "The problem of adaptive interfaces is that of maximising expected cumulative discounted rewards  (   ,  ) from acting according to an optimal policy   (see e.g. [26]):", "Bandit systems are one of the most successful probabilistic approaches to this problem, not only for recommendation systems but also for interface design and adaptation [38].", "Each adaptation is modelled as an arm associated with a distribution describing expected gains.", "Given prior data and new evidence on the measured success of an adaptation, bandits use Bayes theorem to update expectation.", "Importantly, a principled solution is offered to the exploration/exploitation problem.", "Methods like Thompson sampling can optimally balance between exploring actions, to learn about which actions work, and exploitation, to converge to good designs.", "is a state of interaction; This consists of both the interface design (  ) and the user (  )", "Consider the case of adapting the homescreen layout of smartphones, consisting of a grid of application icons.", "Here, a state  of the system consists of both the homescreen design  and latent state of the user  who is interacting with the device.", "More specifically, the design  can encapsulate factors such as the arrangement of icons, their grouping or relationship to other icons, and other relevant features.", "With regard to the user  , aspects such as expertise, interests, and abilities, can be considered.", "Given an initial homescreen design, with which the user has interacted, an adaptation  would result in a new design by, for example, changing the layout or ordering of icons.", "Upon adaptation, the transition function  specifies how the internal state of the user (e.g. their expertise) changes along with the external design state.", "The reward  then signifies the benefit an adaptation provides to the user by improving future interactions, for example, by reducing the time required to select an icon.", "Finally, the discount factor  indicates to the adaptive system how immediate benefits and long-term improvements contribute towards the reward.", "Given this setting, the goal of the system is to find a suitable policy  that can be used to select adaptations that maximise the estimated cumulative reward.", "Monte Carlo Tree Search (MCTS) has been successfully employed in various game-playing applications to plan a sequence of moves efficiently (see [9]).", "MCTS can operate under uncertainty by analysing the most promising moves, and expanding tree nodes using random sampling based approaches.", "A well-known, inspiring application of MCTS is in AlphaGo [48], the computer program capable of playing the game of Go competitively against human players.", "A key insight here has been to incorporate neural networks to help predict which branches have highest expected value, and thereby deal with larger problem instances.", "In our work, we incorporate a value neural network to compute longer sequence cases faster.", "Finding a policy to select adaptations can be challenging for adaptive interfaces.", "While the true state of the design is fully observable, the system does not have access to the true state of the user.", "We can only estimate it through HCI models, where predictions provide us a belief about the user status (for the theoretical implications of this, see [2]).", "Further, due to the lack of user feedback, computing reward is not straightforward.", "Instead, predictive HCI models can be used to build objective functions related to performance and re-learning costs.", "Note that this formulation does not take a stance on what is the right objective function.", "Finally, at any given state, there is a large number of possible adaptations that can change the design.", "When considering a sequence of adaptations over a long horizon, the state space grows exponentially.", "In the following, we describe how these challenges are addressed via model-based RL.", "The core of this approach considers planning: the selection of a sequence of adaptation with the goal of maximising utility to user.", "Planning algorithms such as minimax and A-star, among others, utilise a tree representation of the search space.", "They have found several applications (e.g. game-playing [8], circuit-routing [11], etc.).", "The tree consists of nodes, connected by branches, representing valid states and transitions between them.", "However, classic tree search algorithms often require expansion of the entire tree.", "In contrast to game-playing applications, where a win/loss defines the terminal state, our case does not have a well-defined horizon.", "The user could keep interacting for years.", "We thus need to estimate a cumulative reward over a horizon of reasonable length.", "In other parts, our solution follows standard implementations of MCTS (Figure 2):", "This is computationally expensive given the large number of possible adaptations (breadth) and long horizons (depth) in adaptive interfaces.", "where   is the total reward for child state   ,   is the number of times   has been visited, and   is the number of times parent state   has been visited.", "Exploration constant  in our application is set to 1 / 2 following convention.", "If all adaptations from the selected state   have been previously explored, then selection is repeated until a leaf state is selected with unexplored adaptations.", "2. Expansion : The selected node   is next expanded by picking an adaptation    that results in a new state   + 1 .", "At this point,   + 1 ,  + 1 = 0.", "In our application, we further assume that the expanded state is either visible or invisible to the user.", "Invisibility can be exploited to plan multiple adaptations in a single turn.", "3. Roll-outs and simulations : During one roll-out , as the tree has no value estimates to inform the selection of consequential states, adaptations {  0 , .", ",  }   are chosen at random, and rewards are estimated using predictive HCI models.", "All models simulate what would happen with that adaptation sequence and return an estimate of values over the whole window.", "This is repeated for a fixed number of steps, given by the horizon  , and cumulative rewards are computed for each predictive model:", "As illustrated in Figure 3, we propose an  -headed  -tailed architecture that is trained end-to-end with backpropagation.", "Each of the  input parameters is treated as an independent model branch (head) that is eventually concatenated and passed to  independent model branches (tails).", "During offline training, model-based data is generated using MCTS roll-outs from randomly sampled initial states.", "Value estimates, along with state (design and user) information, are given as input samples to a deep neural network model.", "Elementary design and user features are parameterised with the neural network model.", "This is then used to predict value estimates for any given state in an online setting.", "Note that we decouple value estimations from objective functions (see above), leaving it up to the adaptive system to decide how to use information from multiple models.", "The main advantages of using neural networks for estimation are that they have high learning capacity, and can evaluate thousands of states in real-time without running expensive simulations.", "We support several ways for selecting adaptation that allows controlling for the trade-off between risk and gain.", "Our approach assumes that there are multiple predictive HCI models that bound the true behaviour, for example by offering best-case and (realistic) worst-case estimates.", "Alternatively, predictive models can be included to address multiple objectives, such as task completion time, cognitive load, and disruption [25].", "Combining value estimations from all models, we can implement different objective functions, such as:", "To address large problem sizes in online settings, where repeating a sufficient number of MCTS simulations to attain robust estimates is infeasible, we develop a deep neural network architecture that can efficiently provide predictions in real-time.", "In place of rollouts, where simulations can be costly for longer horizons, a pretrained value network is used to directly obtain value estimates for unexplored states.", "With certain conditions we outline here, the approach we outline is broadly useful across applications of adaptive interfaces.", "For example, it can be used to adapt the structure of webpages layouts,", "Selecting the next adaptation : Given these value estimates, the system can now choose the best adaptation (by setting  = 0 in Equation 2) to maximise expected utility for the user while avoiding costly changes.", "The above steps (14) are repeated several times to obtain value estimates for each adapted state.", "Feasible Adaptations (  ): The set of possible adaptations  , through which a menu can be reorganised, includes (1) moving a menu item to a certain position, (2) swapping two items, (3) adding or removing a separator, (4) moving an entire group, (5) swapping two groups, and (6) not making any changes.", "any application case, a core aspect of our approach relies on HCI models [42] to sufficiently accurately capture the effects of these adaptations on the chosen goals.", "For instance, Fitts law [39] can be used to adapt the location and the size of an elements to minimise pointing time.", "Other practical limitations include the size of stateaction space.", "In the following section, we demonstrate our approach with an application in adaptive menus, and present a novel HCI model to predict selection time in menus.", "To demonstrate the applicability of our approach, we tackle a challenging and open question in the field of adaptive interfaces: adaptive menus .", "Menus have received extensive attention in HCI research because they are widely used, and adaptation has potential to improve usability [4, 55].", "It is known that unexpected changes in menus can introduce a temporary performance drop, increase cognitive load, and potentially lead to the rejection of the adaption/techniques [4, 55].", "No general solution has been proposed for autonomous adaptation that could not only move items to the top, but handle reorganisations more comprehensively.", "We provide a general solution here considering linear menus with up to 20 items, which covers a wide number of menus typically found in common operating systems, applications, and websites [3, 4, 6].", "As menu adaptations, we only consider those modifying the position and grouping of items in the menus, leaving other presentation adaptations, such as highlighting and split menus, for future work.", "While we consider linear menus with textual labels, our solution can be extended to address the problem of adaptive homescreens (introduced in section 3) by extending the menu search model to consider two-dimensional grids and graphical icons.", "We define a design    as a pair < , > where  is a nonhierarchical linear menu [40] containing an ordered list of items.", "An item is either a word or a separator (used to create semantic groups).", "is an association matrix defining the semantic relatedness between menu items.", "In our implementation,  is given by the designer as binary relationships by specifying lists of related items.", "For common words, it can be inferred using word embedding models [43].", "arrange icons on mobile homescreens, or reorganise application menus.", "Depending on the application, the goal or objective can differ and might include minimising selection time, increasing saliency, reducing cognitive load, increasing engagement, or a combination of them.", "The approach can handle different types of adaptations including the presentation of the graphical elements (position, size, colour, etc.) or their behaviour (number of elements, animations, etc.).", "where  (   ) is the level of activation of item  at location  in the memory,  is the current time,  ,  is the time of the   selection of   , and  is a decay parameter equal to 0 .", "User interest (or prediction scheme [55]) is given by the frequency distribution of commands selected during the previous interaction session, containing  clicks.", "Additional statistical models of user interest and expertise [18, 19, 21, 51], can be plugged into our architecture.", "Transition function (  ): We use MCTS, where the probability of making an adaptation from state  0 to  1 is given by UCT (Equation 2).", "During planning, we balance between exploiting highreward adaptations and exploring others.", "When selecting an adaptation  to make on the current design  0 , resulting in a new design  1 , a greedy strategy is chosen:", "State (  ): A state    gives information about the menu design and the user.", "Following the general formulation in section 3, we first define the adaptive menu problem.", "Figure 4 presents an exemplary illustration.", "The system observes user clicks on menu items to approximate a users expertise and interest .", "We use a simplified version of the learning component from ACT-R [1] to compute user expertise for each menu item   in a menu with  items:", "To support foraging search, it is desirable for an adaptive system to create groups of related items, or eliminate groups where items have no associations.", "When an adapted state is assumed to be displayed (visible) to the user, we simulate an interaction session (new clicks) based on user interest, and update expertise accordingly.", "Conversely, the system can use invisible states to withhold presentation and combine multiple adaptations, such that the state is used only as a pathway to another state without being displayed.", "Here, no user updates are applied.", "Reward (  ): We extend predictive HCI models of menu use to obtain reward estimates.", "A key feature of these models is to take into account the implicit cost of adaptations.", "Given a pair of menu designs and estimates of user expertise and interest, these models predict selection time for items for varying user strategies.", "For each model, the reward  then is the difference in average selection time, weighted by user interest.", "Rewards from multiple models can be combined using any of the objective functions given in section 4.1.", "To support serial search, it is advantageous for an adaptive system to move frequently-used items towards the top.", "Consider a menu where   is the number of groups,   (   ) is the location of the group that contains the target (   ), and  the expected target location within the group.", "(   ,  )  [ 0 , 1 ] specifies if   is associated to an anchor   .", "In a well-organised menu, where the anchor of one of the groups is related to the target item, foraging search time is:", "5.2.2 Foraging search .", "Here, semantic structure (grouping) is exploited to avoid wasting time inspecting groups that most likely do not contain the target item [4].", "The anchor , or first element of a group, signals what is in the group.", "If the anchor is unrelated to the target, the user skips the group.", "If the anchor is related, the user performs a serial search within this group.", "Several predictive models explain how users search within linear menus [5, 10, 12, 24, 40].", "We build on these models to define three search strategies, and use these to evaluate the utility of a menu design by simulating search tasks, illustrated in Figure 5:", "adapted menu, if the items new location  is before the expected location  (    ), the search time reduces following Equation 7.", "However, if  is after  (    ), surprise penalty   is imposed upon not finding the item as expected.", "Following this, the user cautiously inspects the remaining items at a slower rate  .", "The total search time is:", "Our choice of the three models was made with the hypothesis that they would provide bounds for best-case and worst-case performance.", "In the beginning, best-case performance would be governed by foraging and serial search, but as experience accumulates, the (rational) user would shift to foraging based and recall-based strategies.", "But making the assumption that a user might  for reasons like lack of effort or interest  use a poor strategy allows us to define a conservative policy for adaptation that is unlikely to annoy them.", "We note that it is possible to plug in additional search strategies (e.g. Random search [40]) without modifying the general architecture of the algorithm.", "5.2.1 Serial search .", "When searching for a menu item   at an expected position  , serial search [5, 13, 40] consists of a top-tobottom inspection of the menu, until the item is reached.", "Inspection", "In a poorly organised menu, where the target item is not located within the expected group(s), a user first attempts foraging search by inspecting all anchors, and all items within related anchors (given by Equation 9).", "Upon not finding the item, a surprise penalty   is incurred, and the user reverts to serial search under caution from the top of the menu.", "where  (   ) is the size of the group, and  (   ) is the location of the target item   within group   if it is located within the group,  otherwise.", "Finally,  trail remains the constant pointing time when the mouse cursor trails the eye gaze.", "Thus, items within related groups are inspected serially until the target is successfully found.", "Where  trail is a constant pointing time assuming that the mouse cursor trails the eye-gaze (tracking strategy) during serial search [5, 10].", "Notation Description   Target item  at location  model (  ) Search time for an item  with a given model  Constant for cautious inspection cost of an item   Constant surprise penalty when an item is not found as expected  trail Constant pointing time when the cursor trails eye gaze  (   ,  ) Boolean relationship between items   and   , from association matrix   (   ) Activation level for  at", "(or reading) cost for any item   is given by:", "where  (   ) is the activation of  at  , and  is the cautious inspection cost constant when there is no activation.", "The total serial search time for a target at expected location  is thus given by:", "serial (   ) =  serial (   ) +   + (    )   +  pointing", "The above search models enable us to predict selection times for varying user strategies.", "By simulating consequences of adaptations during roll-outs, we can estimate implications of design changes on user performance.", "However, given the varying length of menu sizes, running simulations with long horizons can be infeasible for online settings.", "For example, for a menu with 15 items, and up to 8 separators, there are over 500 feasible adaptations.", "To address large problem sizes, we instantiate our general network architecture (Figure 3) for adaptive menus.", "The key idea is to anticipate the rewards for a given menu adaptation taking into account the previous menu design and the user behaviour.", "The model inputs are: (1) design head: adapted menu design, association matrices of the current and adapted menu; (2) user head: previous and current clicks distribution.", "The model outputs reward predictions for each of the three search models: serial, foraging, and recall.", "Figure 6 illustrates the model architecture.", "Each input is treated as an independent model branch (head) that is eventually concatenated and passed to three independent model branches (tails), one for each output reward.", "Each item in the adapted menu is converted to a one-hot encoded vector, flattened, and then passed to a fully connected layer.", "The association matrices are diffed and passed to a long short-term memory (LSTM) layer, then passed to a fully connected layer.", "Finally, the click history is passed to an LSTM layer, which models sequential data and is", "5.2.3 Recall search .", "Recall (direct) search [5] relies on users memory, given by activations  , to directly glance at items without inspecting the entire menu.", "For a target item  , if there are no activations   above a threshold  (we use 0.5), the user reverts to serial search (Equation 7).", "When  (   )   for a target   at location  , the user attempts recall search by inspecting the item at  (Equation 6).", "If recall search fails (    or  ( , ) <  ), the user eventually reverts to serial search under caution (Equation 8).", "If found at  , the user then performs a pointing task.", "Here, the visual search and pointing task are performed sequentially as eye movement is faster than mouse movement [5].", "We use Fitts law to estimate pointing time in menus:", "If not found at  , after incurring surprise penalty   , the user attempts local search , by randomly inspecting   items in the vicinity of location  .", "In non-ordered menus,  local is equal to 2 times the number of items in the Fovea.", "In semantic menus,  local is the number of items in the group.Inanadaptive", "menu, the target item  might have been encountered at several locations.", "Here, the user attempts recall search at all locations    where  (   )   , until the target is found.", "The total recall search time for target   at adapted location  is given by:", "To support recall, it is advantageous for an adaptive system to place frequently-encountered items at locations where they have been seen before.", "where   = 10 .", "3 and   = 4 .", "8 according to [5].", "6.1.3 Result: Success Rate.", "With the above setup, we first evaluated whether our approach, and implementation, could successfully identify promising adaptations.", "As dependent variable, we measured success rate of finding beneficial adaptations.", "We define a successful trial as one where the predicted selection time is improved by adaptation.", "Figure 7 shows an example result for a challenging case with a 15-item menu.", "The overall success rate with model-based simulation was 92.7%, indicating that in most cases an improvement was found.", "Similarly, with the value network, success rate was 89.6%.", "These results support our approach towards planning menu adaptations that can improve user performance.", "The concatenated inputs are passed to each network tail, which comprises two stacked fully connected layers.", "At the end of each tail, we use linear activation to predict each reward, since they are not bounded.", "For regularisation purposes, our architecture uses Dropout layers with drop rate 0 .", "5 before each of the fully connected layers.", "This prevents overfitting the model to the training data, improving generalisability to unseen data.", "The loss function for all model tails is the mean squared error (MSE), which is computed as the average of the squared differences between the predicted and the actual values, which penalises large errors.", "We use the RMSProp optimiser, a popular stochastic gradient descent algorithm with momentums.", "We use learning rate  = 0 .", "001 and decay factor  = 0 .", "9 for the optimiser.", "We train the model for 200 epochs at most, using early stopping (10 epochs patience) to retain the best model weights, and monitor its performance on a validation set comprising 20% of training data.", "After training, our model achieved remarkable performance: MSE  = 0 .", "149, MSE  = 0 .", "408, MSE  = 0 .", "Reward Estimation: We compare two methods of estimating rewards: model-based simulations and value neural network predictions .", "With model-based simulations, predictive models are used during roll-outs to estimate rewards for each state.", "With value network predictions, our pre-trained network models are used to predict value estimates for each state.", "During each trial, a combination of {menu size  user history  menu design  objective function  reward source} was selected, and given as input to the system.", "In a constrained setting, the MCTS algorithm was allowed 400 iterations, and a shallow roll-out horizon of 4 steps, to build the search tree and find suitable adaptations.", "We conducted a technical evaluation with realistic and challenging scenarios, where the adaptive system must adapt menus for simulated users.", "The two main questions we seek to answer are:", "designed to handle long-term dependencies, and is then passed to a fully connected layer.", "Menu Designs and User Interest: We considered 3 menu sizes  5, 10, and 15 items  to address varying cases, from short contextual menus to longer application menus.", "In addition, up to 8 separators were allowed for grouping, resulting in menus with up to 23 items.", "We picked common labels for menu items, where categories specified pairwise associations (e.g. animals, furniture, vegetables, clothing).", "For each menu size, we created 4 starting menu designs by randomly assigning labels to item positions.", "We used a Zipfian distribution to reasonably model menu usage [13, 37].", "We sampled 8 different click histories by randomly assigning frequency to item labels.", "This resulted in 3  8  4 = 96 configurations, each assigned to a different simulated user.", "We validate our method, applied to adaptive menus, through technical and empirical evaluations.", "6.1.4 Result: Scalability.", "To assess the scalability of our solution, we compared computation time for model-based simulations vs. value network predictions.", "In addition to the horizon of 4 steps used to evaluate success rate, we evaluated 3 other search depths", "6.1.2 Implementation.", "Our MCTS-based planning algorithm, and the predictive menu models, are implemented in Python 3.7.", "The value neural network is implemented with TensorFlow 2.0.0.", "6.1.1 Tasks.", "Condition had a statistically significant effect on selection time ( 2 , 17 ) = 5.47,  < 0.05, with grand means Static = 2283 ms, Freqency = 2298 ms, and MCTS = 2162 ms (Figure 9a).", "Post-hoc test using Tukey HSD revealed that MCTS (2162 ms) was significantly faster (lower selection time) than both Freqency (2298 ms) and Static (2283 ms); the difference between Static and Freqency was not statistically significant.", "During each condition, the participant interacted with two different menus during 3 blocks.", "Within a block, the two menus appeared in an alternating order, separated by short breaks (3 seconds).", "For each menu, 20 selection tasks (trials) were completed.", "We introduced this design to reflect the fact that (1) users perform several sessions of work in the real life (one session == 1 block), (2) users regularly switch between applications within a session, and thus use different menus [45]: we wanted to avoid undesirable effects due to repetitive selection within a single menu, and (3) each menu has a different selection frequency, given by two Zipfian distributions.", "The primary goal of this evaluation is to test whether our planning approach (henceforth MCTS) applied to linear menus improves performance in comparison with static menus (Static), and with the well-known frequency-based adaptive approach (Freqency) as a baseline (e.g. as in [34]).", "In MCTS, the menu adapts after each block by planning adaptations; in Static, the menu does not adapt over time; in Freqency, the menu adapts based on the frequency of clicks on menu items.", "To this end, we conducted a lab study where participants completed selection tasks in a within-subject design with three conditions (Static, Freqency, MCTS).", "For each menu within a condition, a Zipfian distribution, known to accurately capture real-world command selections [13, 37], with shape  = 1.5 was used to control the frequency distribution of target items.", "The same frequency distribution was used for all three conditions within a participant.", "Unique frequency distributions", "Figure 8 illustrates computation time results for each depth level (for 400 MCTS iterations).", "We observe that for depths  4, the value network does not provide much benefit.", "However, as search depth increases, while the computation time with our value network remains constant (mean M = 7.77s, SD = 1.0), it drastically increases with simulations (from M = 7.9s, SD = 3.5s at depth 4 to M = 39.0s, SD = 7.4 at depth 10).", "6.2.5 Procedure and design.", "The experiment began with an introductory briefing and participant consent.", "In a within-subject experimental design, each participant tested the three conditions (Static, Freqency, MCTS) sequentially.", "Condition order was counterbalanced between participants using a 3  3 Latin square.", "6.2.1 Materials.", "For the experiment, linear menus with 15 item labels were randomly generated.", "Items labels were selected from common categories (e.g. animals, fruits, countries, etc.) to avoid prior biases.", "For each participant, two menus were generated for each of the three conditions, resulting in six unique menus.", "To avoid confusion, there were no overlaps in item labels or categories between the menus for a participant.", "Participants took mandatory breaks (1 minute) between two consecutive blocks, and longer breaks (5 minutes) between conditions where they answered open-ended interview questions.", "In summary, the design is: 18 participants  3 conditions  3 blocks  2 menus  20 selections = 6480 trials.", "6.2.4 Stimulus and Task.", "The target item name was displayed at the top of the browser window.", "Participants began a trial by clicking on a confirm button, upon which the menu was displayed directly below.", "Errors were logged, and participants had to select the target item to finish the trial.", "Upon clicking the target item, the menu was hidden, and a short break was provided.", "6, 8, and 10  depicting a range of planning horizons, from short sequences to longer sequences.", "6.2.3 Apparatus.", "The experiment was conducted on a Macbook Pro, with a 15 Retina display.", "An Apple Magic Mouse with default tracking speed was used for selection tasks.", "The study interface was implemented using HTML and Javascript, and was displayed in a browser window.", "Timestamped cursor movements and clicks on menu items were recorded.", "Average Selection Time: We created a mixed-effect model for repeated measures analysis of variance (one-way ANOVA) with selection time (in ms) as dependent variable, conditions (Static, Freqency, MCTS) as fixed independent variable, and participant ID and menu design as random variables.", "6.2.2 Participants.", "18 participants (10 masculine, 8 feminine, 0 others), aged 18 to 38 (mean 27.2), with varying educational backgrounds, were opportunistically recruited.", "All participants reported frequent desktop or mobile, and web usage.", "Participation was compensated with a movie ticket voucher (approx. 12.00).", "were generated for every participant, to consider variance in user interests.", "These frequency distributions were then used to generate sequences of target items, to be presented as stimulus during the trials.", "Results from our simulation-based evaluation offer evidence for our approach and technical solutions.", "First, MCTS-based planning consistently proposes adaptations that could improve predicted performance (Figure 9a).", "Second, as search depth increases, our results indicate that value network is more efficient for estimating reward predictions.", "Further, results from our user study highlight benefits over a static and an adaptive baseline.", "Through model-based planning, we can adapt menus that improve overall performance, as given by reduced selection time.", "A common pitfall of the frequencybased approach is that, although it can improve performance for commonly-used items or commands, it prevents recall and makes selection of other items increasingly difficult.", "In contrast, we observed (Figure 9b) that adaptations made through our approach could provide these benefits while avoiding costly changes that require relearning and cause annoyance.", "Target Item Position: Given the menu selection scenario, items near the top of the menu are typically faster to select than items that are near the bottom.", "However, this selection time depends not only on the cursor movement distance, but also the users ability to search for items in the menu.", "To get a better understanding of how the different conditions influenced performance, we further looked at how target item positions in the menu influence selection time.", "Figure 9b illustrates the linear increase in selection time with target position for the three conditions.", "It can be observed that while selection time for the top-most items (lower target positions) is quite similar for the three conditions, with MCTS being the fastest, it increases more drastically for the Freqency condition, as compared to Static and MCTS.", "When we exclude the top-three target items, the difference in selection time between MCTS (mean = 2454 ms) and Freqency (mean = 2799 ms) is 344 ms (i.e. Freqency is about 15% slower).", "6.2.7 Qualitative Results.", "During the study, participants were not informed about adaptations (if any) in advance.", "After each block, we asked them whether they noticed changes to menus during use, and their opinions about these changes (if any).", "15 participants commented that they noticed changes in the Freqency condition, but only 2 participants noticed how these changes were occurring.", "Participants commented that the reordering was confusing, and prevented them from remembering item locations: I might skip down instead of checking the top, and then go back to the top. (P3).", "In the Static condition, participants could use their memory to directly access some items, but commented on the lack of proper grouping: the items were not consistent in their grouping, and they were not intuitively grouped (P11).", "In the MCTS condition, participants noticed that the categorisation of items into groups improved upon adaptation, and helped them in searching for related items: the items were organised under categories often  that helped select items (P18).", "We have presented a model-based reinforcement learning method suitable for adaptive interactions.", "While recent successes of reinforcement learning have created renewed enthusiasm toward this", "We see several exciting topics for future research on model-based RL and its applications in HCI.", "First, one limitation to the applicability of the approach is the requirement for accurate models of shortand long-term consequences of adaptations.", "So far we have assumed that such models are expressed as step-by-step computer simulations or mathematical models.", "However, there is no reason why data-driven models (e.g. [59])  trained on larger datasets of user data  could not be used for this purpose, significantly expanding the scope of possible applications.", "Second, algorithm engineering is needed to deploy this approach to larger applications.", "In particular, presently, with our computing resources, problem sizes of up to 20 items are still within reach in the case of menu systems.", "To improve performance beyond that, techniques for GPU computation and more efficient training will need attention.", "Finally, while our work successfully used a value network, further improvements can be expected by implementing a policy network [48].", "To study and demonstrate the viability of the approach, we have applied it to the challenging case of adaptive menus by extending predictive models.", "Our simulated and empirical evaluations suggest significant and practically valuable improvements to usability.", "Importantly, the adaptive system does not require explicit user input, but is still able to perform conservatively without disadvantageous or annoying changes (Figure 10).", "Our empirical evaluation reveals that this approach can work even when starting from poor designs that would be hard to recover with approaches that do not consider planning.", "Future adaptive applications can benefit from our general approach by exploiting and extending predictive models of interaction.", "To conclude, we hope our work can be broadly appealing, and invite contributions from both the HCI and the machine learning community.", "At the core of model-based RL is an understanding of how users behave and what makes a good design in given conditions.", "We believe that future applications can benefit from this approach to improve interactions.", "Finland projects Human Automata and BAD, Agence Nationale de la Recherche (grant number ANR-16-CE33-0023), and HumaneAI Net (H2020 ICT 48 Network of Centers of Excellence).", "We support adoption and further research efforts by providing an open code repository, with examples and instructions, on our project page: https://userinterfaces.aalto.fi/adaptive .", "We thank all study participants for their time, and colleagues and reviewers for their helpful comments.", "This work was funded by the Department of Communications and Networking (Comnet), the Finnish Center for Artificial Intelligence (FCAI), Academy of", "approach in HCI, applications to adaptive user interfaces have remained scarce.", "To apply this class of machine learning methods for selecting adaptations, we have proposed the use of predictive models in HCI for value estimation during planning.", "We have presented solutions to several consequent technical challenges, most notably:"]}
