{"paper_id": "2108.11259", "sentences": ["The key contributions of this work are:", "Conversational agentsentities with some degree of intelligence and the capability of natural language discourseare becoming a prevalent tool for students within computer-mediated learning environments.", "Thus, it is essential to understand how best to design these agents to enhance learning experience and outcomes, while taking into account individual characteristics and differences.", "Pedagogical agents have been designed for a number of purposes including tutoring (e.g., [63]), conversation practice for language", "Teachable agents have the ability to be taught and are of particular interest in education, as learning-by-teaching can be a more enriching experience than learning by oneself [14].", "In human-human tutoring, the tutor learns more when the tutee struggles with the material, most likely because it leads them to use reflection, selfexplanation, and reworking of the problem from multiple angles [61].", "Unfortunately, tutee errors do not lead to more learning for the tutee [61] and thus teachable agents are able to capitalize on", "Previous studies have highlighted the usefulness of pedagogical agents that have socially-oriented conversations with students, e.g., reassuring them [27], initiating small-talk [26], and engaging in mutual self-disclosure [53], leading to more positive experiences and promoting learning gains.", "Little research exists on the effects of humour in task-oriented human-computer interaction and its use by pedagogical agents.", "However, the benefits of humour in education have long been alluded to as a result of humours psychological effects on learners.", "Humour and laughter have been shown to decrease stress and anxiety, and enhance self-esteem and self-motivation, leading to a more positive emotional and social environment in which students can pay better attention [2, 23].", "To our knowledge, there exists no systematic investigation into humour use by pedagogical agents, and, in particular, teachable agents.", "We therefore set out to investigate how varying humour styles in a teachable agent affected participants perceptions of the agent, experience with the task, and teaching behaviour during the interaction.", "Further, we explored whether individual characteristics of the learner (in terms of their own humour style) interacted with the humour style of the agent.", "learning (e.g., [38]), and promoting skills such as metacognition (e.g., [46]).", "Pedagogical agents commonly take on the role of a tutor, co-learner, or novice [34].", "This paper focuses on agents in the novice role, also called teachable agentsthose with the ability to be taught.", "These agents are based on learning-by-teaching; a widely studied and practiced technique within the education domain.", "The approach is inspired by the protg effect, which demonstrates that learning for the sake of teaching others is more beneficial than learning for ones own self [4].", "Human-centered computing  Empirical studies in interaction design .", "2021 Copyright held by the owner/author(s).", "Publication rights licensed to ACM.", "This is the authors version of the work.", "It is posted here for your personal use.", "Not for redistribution.", "The definitive Version of Record was published in CHI Conference on Human Factors in Computing Systems (CHI 21), May 813, 2021, Yokohama, Japan , https://doi.org/10.1145/3411764.3445068.", "ACM Reference Format:", "CHI 21, May 813, 2021, Yokohama, Japan", "Humour is an integral part of human communication and can be expressed verbally (produced by means of language or text, e.g., jokes, comics) and/or non-verbally (e.g., facial expression, gesture), intended to elicit responses such as laughter and mirth [36].", "Humour and laughter have been shown to decrease stress and anxiety, and enhance self-esteem, self-motivation, and psychological well-being [20, 31, 37].", "In education contexts, this effect creates a more positive emotional and social environment in which students can pay better attention [2, 23].", "Research also demonstrates that material taught with humour can lead to better retention and recall [6, 8, 21, 65] and humour can increase student interest and ability to engage in divergent thinking [12, 64, 65].", "In the field of personality research, humour as a part of an individuals character and the role it plays on the way they engage with others, has generated growing interest.", "Such work has lead to distinctions between individual differences in humour style behavioural tendencies related to the uses or functions of humour in everyday life.", "One of the most prominent contributions in the field distinguishes between four humour styles: affiliative (use of benign humour to enhance social relationships), self-defeating (use of humour to enhance relationships at ones own expense), selfenhancing (use of humour to enhance oneself), and aggressive (use of humour to enhance oneself at the expense of others) [37].", "Affiliative and self-defeating humour styles are considered conducive to social well-being and enhancing interpersonal relationships, whereas self-enhancing and aggressive humour are considered as detrimental to social relationships ([37] p.52).", "Little published research exists on using humour with social agents in learning contexts.", "One study [62] had a virtual human tutor use humorous jokes and pictures in an e-learning interface.", "In a preliminary experiment they found the humour to enhance learner motivation, performance, and ease emotions.", "Other research on alternative social expressions points to the possible usefulness of humour use in pedagogical agents.", "For example, Gulz, Haake, and Silvervarg [26] propose that positive learning outcomes after interacting with a teachable agent with off-task social conversational abilities may be due to the off-task social conversation providing an opportunity for cognitive rest, increasing engagement, providing memory cues, and promoting trust and rapport-building between the human and virtual agent.", "Similarly, Ogan et al.", "[43] suggest that agents should keep the student immersed in the experience by making teasing or joking face-threatening moves of their own following an incorrect assessment of their ability.", "Research on humour in agents has also found the style and form to impact perception and interaction in various ways.", "In robots, four forms of humour (wit and an ice-breaker, corny jokes, subtle humour, and dry humour and self-deprecation) are suggested to enhance sociality of a robot [30], and innocent humour (riddles and punning jokes) was found to improve perception of task enjoyment, robot personality, and speaking style [41].", "In interactions with virtual agents, conversational and situation-specific jokes have been found to affect how cooperation is perceived in an agent [32], humour is proposed as a means of recovering from error situations while providing a pleasant user experience [42], and affiliative humour has been shown to significantly motivate healthy behaviours [44].", "the beneficial effects for students as peer tutors, while avoiding the detrimental ones of being a peer tutee.", "Further, research has demonstrated the existence of the protg effect, by which students are found to try harder to learn for their agent than they do for themselves, and that the social nature of the interaction between student and teachable agent contributes to the effect [7].", "Thus, agent characteristics that enhance rapport with the teacher may promote the protg effect.", "In the present study, we focus on agent humour.", "The style of humour used can impact the way in which a teacher is perceived.", "Ziv, Gorenstein, and Moris [66] found that students responded differently to a human teacher who used four different types of humour during a lecture: when using a combination of selfand other-disparaging (also known as self-defeating and aggressive) humour, the teacher was rated most appealing and original, when using only other-disparaging humour, the teacher was rated most powerful, and when the teacher did not use humour they were evaluated as having the most systematic teaching style.", "The study also showed that students who possess a sense of humour are most appreciative of a teacher using humour.", "Tamborini and Zillman [54] found no difference in rated intelligence when a college lecturer used sexual, other or self-disparaging humour.", "However, use of selfdisparaging humour was perceived as influencing appeal.", "Gruner [25] showed that speakers using self-disparaging humour were perceived as wittier than those not using humour.", "Morkes, Kernal, and Nass [40] found that when participants communicated with a chatbot while working together on a task, but thought they were interacting with another human, the use of humour in on-task conversation lead participants to rate their conversation partner as more likable and reported greater cooperation with, and similarity to, their partner.", "They also made more jokes and responded more socially.", "On the other hand, when participants knew they were conversing with a computer agent, the use of humour lead to participants being less social, smiling and laughing less, and feeling less similar to their conversation partner.", "They also spent less time on the task.", "Conversely, Dybala et al.", "[15] reported that participants found a chatbot using puns in off-task conversation to be more natural, interesting, and easier to talk to than a non-humorous agent.", "In a follow-up study, the researchers also found that the humorous agent was rated as more human-like, funny, and likeable than the non-humorous agent [17].", "The researchers describe two major subclasses of conversational agents that use humour during the dialogue: on-task and off-task.", "They state: we believe that the presence of humour is of higher importance in non-task-oriented agents, for their main purpose is to entertain human interlocutors and socialize with them during the conversation.", "Thus, it appears that users are sensitive to an agents humour, but the impact on interactive behaviour varies depending on the nature of the task.", "2.3.1 Humour in Teachable Agents.", "Although prior work indicates the value of humour expression by pedagogical agents, to the best of", "Using the Curiosity Notebook [33], participants taught a virtual agent, Sigma, how to classify rocks.", "The gender of Sigma was never specified nor implied throughout the entire interaction, and Sigma was represented by a static avatar.", "We adapted and customized the original interface and participant-agent dialogue to fit this studys research questions (For reference, the original layout and task format are described in [33]).", "The teaching interface of the Curiosity Notebook (Figure 2) consists of a reading panel on the left-hand side, with a number of articles and pictures about the topic to be taught divided into different categories.", "Each rock is given its own article.", "The sentences in the articles could be selected and taught to the agent at certain moments during the interaction.", "A chat window, through which participants could converse with the agent, was on the right-hand side of the screen.", "Everything taught to the agent is recorded in a notebook that can be viewed at any time (See Figure 1).", "Every rock is given a page in the notebook and the notebook updates live.", "The text in the articles is adapted from https://geology.com.", "The sentences in each article are linked to features necessary for classification (large or small crystals, layers, a glassy appearance, holes, sand or pebbles, fossils, and formation process).", "These linked sentences are used as a ground truth to verify that participants select the correct sentence to teach the agent.", "If the sentence selected does not match the feature or rock the agent asked about, the agent asks the participant to select another sentence that would better answer the question.", "It also uses this ground truth in answering quiz questions (described in more detail below).", "our knowledge, there has been no previous research systematically investigating the use specifically in agents taking on the role of tutee.", "We therefore conducted an examination of humour in a teachable agent context.", "We chose to compare the two humour styles considered conducive to social well-being and enhancing interpersonal relationships: affiliative and self-defeating.", "These two styles were chosen because: (1) learning from a teacher can be considered a social, interpersonal collaboration between teacher and learner [60], and (2) learning-by-teaching is predicted to be effective as a result of the sense of responsibility the tutor feels for their tutee [7] and we hypothesize that enhancement of the human-agent relationship through humour will increase the sense of responsibility.", "In summary, we predict that humour will enhance the relationship between participant and agent, and decrease stress and anxiety, motivating participants to make more of an effort to teach their agents, and result in a positive effect on learning experience and outcomes.", "Describe involves the agent asking for the name of a rock, what rock type it belongs to, and selecting a sentence from the articles with information on what feature(s) or characteristic(s) help classify it.", "In the Explain interaction, the agent asks why a rock is of a certain type or why it has certain features.", "Participants answer by selecting a sentence and are sometimes prompted for an explanation in their own words.", "To select a sentence, the participant is required to navigate to the article of the appropriate rock and find the sentence that contains the answer.", "Compare has the participant compare two rocks to each other focusing on what is similar or different depending on whether the two rocks chosen are from the same category or different.", "The Correct button allows participants to change information they had taught the agent.", "The Quiz button gives participants the opportunity to ask the agent to classify a rock to assess its knowledge state.", "The Fun Fact button has the agent ask the participant to provide a fun fact and occasionally ask for an explanation of why they thought it was interesting, and the Tell Joke button allows participants to tell the agent a joke.", "Once the dialogue associated with a button finishes, participants can select another button, allowing them to take a break if needed, and decide what interaction to do next.", "3.1.1 Interaction.", "When the participant is ready to teach, they select one of seven buttons split into Teach (Describe, Explain, or Compare), Check (Correct or Quiz) and Entertain (Fun Fact or Tell Joke) groupings, which initiates the agent to begin a conversation.", "Although participants can choose the type of interaction to have with the agent, the agent drives the conversation by asking questions and making statements.", "The baseline personality of the agent in all conditions was enthusiastic and curious, saying things like: I can always use more information about rocks, Yes please tell me more about rocks!, I want to understand how rocks are formed, and Good idea, lets compare some rocks.", "At the end of each interaction associated with a button, there was an 80% probability the agent would make an extra statement, reflecting the condition.", "These statements were always on-topic, i.e., the affiliative jokes were rock-related, the selfdefeating jokes were related to the agents learning about rocks, and the neutral statements were related to the agents learning about rocks.", "3.2.1 Conditions.", "his study focuses on the effect of verbal humour as expressed through humour styles.", "Although there is a strong connection between humour and laughter, laughter can exist separate from humour.", "For example, social/conversational laughter can be distinguished from hilarious laughter, the latter being more directly associated with humour [13].", "Expression of laughter (haha) was included in all three conditions for consistency but not as an expression of verbal humour.", "To measure participants attitudes towards the agent we used the Likeability and Perceived Intelligence subscales of the Godspeed questionnaire [1], as well as questions on sense of humour, social", "We used a between-subjects experimental design, with three conditions: (1) Affiliative, (2) Self-defeating, and (3) Neutral (no verbal humour).", "Participants were randomly placed into one of the conditions.", "3.2.4 Procedure.", "The protocol was conducted entirely online.", "Participants were sent a link to the Curiosity Notebook, in which they completed all questionnaires as well as interacted with the agent.", "The system was designed to move participants through each step automatically.", "Each participant began by reading and signing the information letter and consent form.", "They then filled in the demographics questionnaire which contained questions on age, gender, cultural background, education, and prior experience with conversational agents.", "Following this, they completed a pre-study knowledge quiz on rocks.", "Once submitted, participants were shown a forty second video on how the Curiosity Notebook works and the task participants were expected to complete.", "They then moved to the teaching interface and were told to set themselves a timer for 40 minutes, after which they should click on the Stop Teaching button.", "Following the interaction, participants completed three questionnaires measuring their perception of the agent, their attitudes and motivation towards the teaching task, and their sense of humour (administered towards the end so as not to prime participants on the focus of humour in the study).", "The final questionnaire was a post-knowledge quiz to measure their recall of the material.", "Participants were given a total time of 90 minutes to complete the sequence of surveys and teaching, and at the very end were shown a feedback letter.", "3.2.5 Measures.", "We collected data through pre-study and poststudy questionnaires, as well as by logging all user interactions on the Curiosity Notebook including, all button and article clicks, conversations between participant and agent, articles discussed, and notes recorded in the notebook.", "3.2.2 Research Questions.", "Based on prior literature from areas of Education, Psychology, Humour, and Conversational Agents, our investigation explores the following research questions:", "3.2.3 Humorous Statements.", "To generate the humorous statements, six creative writers were recruited through Upwork.", "In the task, participants were told to imagine they were a conversational agent that is being taught about classifying rocks.", "During the conversation they (as the agent) interject different types of humorous statements.", "For each humour style, they were given the definition, as well as an example interaction between human and agent, and asked to provide 10 statements of each type.", "Next, a different set of participants (five, also recruited through Upwork) categorized the statements produced by the previous set into the type of humour they felt it belonged.", "The statements they were shown included those produced by the elicitation Upworkers, as well as control statements that did not contain humour, and should therefore be categorized as not belonging to a humour style.", "The final set of humorous statements were selected by filtering out any that required prior cultural knowledge, were not on the topic of rocks, or were duplicates.", "Affiliative humour is considered relatively benign and selfaccepting.", "Persons with this humour style commonly tell jokes and funny stories for the amusement of others and to facilitate relationships.", "The agent with an affiliative humour style therefore was designed to occasionally tell jokes throughout the interaction.", "The jokes were most often conundrum riddlesquestions that rely on a play on words in either the question or answer for comedic effect, e.g., Whats a rocks worst enemy? Paper, haha! or Ive got a joke! What did the one volcano say to the other?... I lava you!.", "Self-defeating humour is characterized by an excessive use of selfdisparaging humour, by which the user attempts to amuse others at their own expense.", "The main aim of this style of humour is to achieve social acceptance and approval from others.", "The agent with a self-defeating humour style interspersed self-disparaging humour throughout the conversation, e.g., You know that feeling when youre taught something and understand it right away?... Yeah, not me! Haha! or When youre a computer but cant learn things by yourself haha.", "The agent expressing no verbal humour, Neutral , made statements related to its self-reflection of learning, e.g., This topic is quite interesting! or Haha Im enjoying this topic a lot.", "According to the Similarity Attraction Hypothesis, people tend to like people they perceive as similar to themselves, and the Media Equation Hypothesis claims that this holds for artificial agents as well [48].", "Therefore:", "Q2 : Is there an interaction between participant characteristics (i.e., humour style) and the use of humour by a teachable agent, on the above measures?", "ability, and funniness (all presented as semantic differential scales from 1-5), and the Pick-a-Mood pictorial self-report scale for agents [11].", "To measure participants attitudes towards the teaching task we used the Pick-a-Mood pictorial self-report scale for self [11], and the Interest/Enjoyment and Pressure/Tensions subscales of the Intrinsic Motivation Inventory (IMI) [57].", "The Academic Motivation Scale (AMS) [58] was used to assess the type of motivation elicited by the interaction.", "The IMI and AMS scales were presented as a Likert scale from 1-7.", "Preand post-knowledge tests were used to measure recall of the material taught.", "The Humour Styles Questionnaire (HSQ) [37], a self-report scale, was used to measure individual differences in participants style of humour.", "Finally, to measure effort, we used: (1) the Effort/Importance subscale of the IMI [57], and (2) analysis of interaction behaviour while teaching the agent.", "by the humorous agents versus the non-humorous agent and the ability of participants to move through the procedure seamlessly without researcher involvement.", "It also made clear the importance of placing the HSQ towards the end of the session to counter-act possible priming effects, as well as having participants complete the post-study knowledge quiz at the very end, so as not to influence their evaluations of the agent based on how well they believe they did on the quiz.", "4.2.2 Data Preparation.", "Data from 5 participants was removed prior to analysis due to non-compliance with study instructions; therefore results are from N =53 ( n =17 neutral; n =18 self-defeating; n =18 affiliative).", "We collected both qualitative and quantitative data from each participant.", "For the numerous measures the following analyses were carried out: ANOVA, Kruskal-Wallis, linear model, cumulative link model, and stepwise selection method, with condition and demographics (age, humour style, etc.) as the independent factors, and Godspeed, Pick-a-Mood (for self and agent), IMI, AMS,", "Eight students took part in a pilot study and received a $15 Amazon Gift card upon completion.", "[4 women, 4 men; age range: 20-27 years, mean: 23.1, median: 23].", "All participants were undergraduate and graduate students of a research-based university and volunteered for the study by responding to posters.", "The pilot provided us with some initial results; indicating a clear perception of humour used", "4.2.1 Participants.", "58 participants took part in the main study and received a $15 Amazon Gift card upon completion.", "[35 women, 21 men, 2 non-binary; age range: 18-35 years, mean: 24.4, median: 25].", "All participants volunteered for the study by responding to posters and calls for participation on social media.", "Participants in the affiliative condition, on the other hand, reflected more positively on the teaching experience in general, with sixparticipantsreferringtoitasbeingfun(a01,a06,a07,a13,a17,a18)andacoolexperience(a14).", "Twoparticipantspointedouttheirpositiveopinionsoftheagentshumour.Participanta04expressed", "Participants were also asked a number of questions relating to experience of the task.", "The questions and results are shown in Figure 4 and analyzed with cumulative link models (CLM).", "The CLM model shows that compared to the other conditions, participants assigned to the self-defeating condition are less likely to have enjoyed teaching the agent (  =  1 .", "25 , ( 48 ) =  1 .", "92 , = 0 .", "Further, participants in the self-defeating condition with a higher self-enhancing humour style felt significantly worse at teaching the agent (  =  0 .", "64 , ( 21 ) =  3 .", "05 , = 0 .", "002), whereas those with a self-defeating humour style themselves in this condition felt better at teaching the agent (  = 0 .", "31 , ( 21 ) = 1 .", "892 , = 0 .", "Overall, although participants with a higher self-enhancing humour style are significantly more likely to think that the agent was a good student (  = 0 .", "23 , ( 31 ) = 2 .", "59 , = 0 .", "01), this probability is reduced significantly when the participants are assigned to the affiliative (  =  0 .", "35 , ( 31 ) =  2 .", "67 , = 0 .", "01), or self-defeating condition (  =  0 .", "38 , ( 31 ) =  3 .", "09 , = 0 .", "and teaching behaviour as the dependent factors.", "Interaction effects were investigated, but only those related to participants humour style (affiliative, aggressive, self-defeating, and self-enhancing; measured by the HSQ [37]) are reported in this paper.", "5.1.2 How do participants feel about the agents personality?", "There werenostatisticallysignificantdifferencesbetweenconditionmeansfortheLikeabilitysubscaleoftheGodspeedquestionnaire( F (2,15) = 0.25, p = 0.78).", "However, there was some evidence that as the participants self-reported self-enhancing humour style increases, the likeability subscale decreases significantly among those assigned to the self-defeating condition (  =  0 .", "10 , ( 15 ) =  1 .", "98 , = 0 .", "There was a significant difference found between condition means for the Perceived Intelligence subscale of the Godspeed questionnaire as determined by one-way ANOVA ( F (2,50) = 3.74, p = 0.03).", "Tukeys honestly significant difference (HSD) post-hoc test showed that both humorous conditions differed significantly at p = 0.02; the neutral condition was not significantly different from the humorous conditions.", "The amount the Sad mood pictogram was selected from the Pick-a-Mood pictorial self-report scale to describe the agents mood and personality was significantly different between conditions (  ( 50 ) = 0 .", "29 , = 0 .", "02), i.e., the Sad mood was selected significantly more to describe the agent in the self-defeating condition than in the other two conditions (Figure 3(a)).", "Teaching Experience Participants in the self-defeating condition explained: Sigma was a bit self-deprecating which wasnt a niceexperiencebeingon theteachingside(s10),theself-deprecation made me feel like I wasnt doing a good job (s15), and the agent kept making jokes about her own incompetence (s05).", "As s15 puts it, the agent had a lot of negative talk which was kind of hard to work with. I would have been more encouraged if they were more optimistic about their learning.", "However, self-defeating humour was not always viewed negatively.", "Four participants in the selfdefeating condition explicitly referred to the agents self-defeating jokes as positiveI like the jokes Sigma made in between... [the agent] made jokes ... to create a jolly atmosphere (s01), very positive responses, jokes around and eager to learn, a very easy to teach student (s03), he tried to lighten the mood with some jokes (s13), and Sigma was delightful and gave some very human like responses such as self-deprecating jokes that made him feel more like a relative or peer I was teaching rather than a robot (s06).", "Participants also perceived the self-defeating agent as being not arrogant at all (s06), attentive, smart, and friendly (s11), enthusiastic (s12), curious (s13,s15), and making the experience enjoyable and relaxing to read and teach (s14).", "5.1.1 Arethehumorousagentsmorehumorous?", "IndependentKruskalWallis tests were conducted to examine the differences in the responses to the questions on sense of humour, social ability, and whether the agent was funny or not.", "No significant differences between the three conditions were found on social ability (  2 ( 2 ,  = 53 ) = 0.16, p = 0.93) and funniness (  2 ( 2 ,  = 53 ) = 3.97, p = 0.14), but a significant difference (  2 ( 2 ,  = 53 ) = 8.60, p = 0.01) was found in rating of sense of humour.", "Dunn test for multiple comparisons showed both the self-defeating and affiliative conditions differed significantly at  = 2 .", "35, p = 0.03 and  = 2 .", "71 = , p = 0.02, respectively, from the neutral condition.", "In particular, we noticed that participants (a = affiliative; s = self-defeating; n = neutral) in the humorous conditions perceived the agent to have more of a sense of humour (e.g., Sigma had a good sense of humor, which I observed from the jokes they told (a16) and Humour, expressed through self deprecating jokes (s06)), than the neutral condition (e.g., it would be nice if sigma could tell jokes (n09)).", "Lastly,participants in the neutral condition mostly referred to the agent as friendly (n04,n10,n14), eager (n06,n07,n10,n12,14) and curious (n03,n09,n18).", "In terms of teaching, two participants noted the benefit of teaching as a good way for me to learn (n03) and that they get to learn something (n01).", "Three participants reflected positively to the teaching process itself, with n06 stating it was fun to try to teach Sigma as much as possible in a short period of time, n10 explaining I enjoyed the task of teaching with the goal of Sigmas success, and n11 saying it was fun trying to decide the best way/which information to teach, plus it was fun learning about rocks in the process.", "Comparing Humour When asked about the agents personality traits, five participants in the self-defeating condition listed positive adjectives such as, optimistic and positive (s08), light hearted (s06), friendly (s06,s16,s11), and super adorable (s13).", "More participants (nine) in the affiliative condition associated positive attributes, including cheerful (a01,a14), happy (a04), funny (a05,a06,a07,a09), a comedian (a11), brightens your mood (a01), and pleasant (a18).", "As noted earlier, participants had an 80% probability of being told a joke by the agent for each button clicked.", "This probability, however, was perceived as being too frequent by some participants.", "Six participants in the affiliative condition suggested less frequent jokes (a12) when asked what they would change about the agent.", "Telling too many jokes was perceived as distracting (a17), tiresome (a15), wasted time (a08), and the agent being not very ... attentive (a13).", "On the other hand, for the self-defeating condition, only two participants explicitly referred to the frequency of jokes.", "Participant s04 felt that the agent should not say a joke after every lesson as it slows things down a little, and s12 stated the agent made too many lame jokes.", "Four other participants made more indirect references to the agents joke frequency.", "Participant s05 wanted less self-deprecation!, s15 thought the agent should be more confident and kind to their self, and s18 found it off-putting that Sigma made a lot of jokes at its own expense.", "Lastly, s10 thought it would be nice if Sigma had a more outgoing and nicer personality when interacting.", "5.2.2 Does agent humour use affect user motivation?", "If so, is it intrinsic motivation (IM; actions motivated by the pleasure and satisfaction from the process of engaging in an activity), extrinsic motivation (EM; actions motivated by attaining a goal separate from the process of engaging), or amotivation (AM; the absence of motivation which can co-occur with feelings of low competence)?", "To investigate this question we used the AMS questionnaire.", "The AMS provides overall scores for each type of motivation, and each type is further distinguished into more specific motives: IM to know describes actions performed for the pleasure and satisfaction derived from the learning, exploring, or trying to understand something new from an activity, IM toward accomplishment relates to engaging in actions for the pleasure and satisfaction experienced when trying to achieve something new or beyond ones limits, IM to experience stimulation describes the motivation related to the", "the agents jokes were a nice added touch :) while a16 enjoyed the", "5.2.1 Did the humorous agents reduce stress/anxiety, and enhance interest and subjective effort?", "Average scores on the Pressure/Tension, Interest/Enjoyment, and Effort subscales of the IMI questionnaire across conditions had no statistically significant differences between condition means as determined by one-way ANOVA (pressure: F (2,50) = 0.83, p = 0.44; interest: F (2,50) = 0.99, p = 0.38; effort: F (2,50) = 0.33, p = 0.72).", "Figure 3(b) shows the average result of the Pick-a-Mood pictorial self-report scale for self, across conditions.", "Post interaction, selection of the Neutral pictogram to describe the participants own mood state was significantly different between conditions, in particular, participants in the self-defeating condition chose the Neutral mood more than participants in the other conditions.", "experiencing of pleasurable sensations, EM externally regulated indicates the behaviour is motivated by reasons external to the task at hand, i.e., payment or rewards, EM introjected refers to actions motivated by pressure an individual puts on themselves, and EM identified describes behaviour that is motivated by the view that participation is important for personal growth [59].", "One-way ANOVA showed no significant differences between conditions in the high-level categories of IM (  ( 2 , 50 ) = 0 .", "84 , = 0 .", "44 ) and AM (  ( 2 , 50 ) = 0 .", "46 , = 0 .", "64 ) , but some weak evidence of a difference in EM (  ( 2 , 50 ) = 2 .", "52 , = 0 .", "There was a significant difference in the average EM external regulation subscale score between conditions (  ( 2 , 50 ) = 3 .", "92 , = 0 .", "03 ) , with Tukeys HSD showing participants in the affiliative condition rating their motivation in the task as externally regulated more highly than participants in the other two conditions (self-defeating-affiliative at  = 0 . 03; and some evidence of significance between affiliativeneutral at  = 0 . 08).", "Average AM score was higher for participants with a higher self-reported aggressive humour style in the selfdefeating condition (  = 0 .", "18 , ( 36 ) = 2 .", "24 , = 0 .", "Prior work on question-asking has defined numerous schemas for classifying questions based on the effort it would require to find the answers.", "For example, questions can be classified according to whether the answer can be found in a single, multiple or no sentences in the text [47] or the expected length of an answer and the amount of reasoning required to formulate the answer [24].", "The Curiosity Notebook employs these different types of questions.", "Within Teach, Describe requires little to no reasoning and the answer can be found in a single sentence in the text, Explain requires slightly more reasoning and the answer can be found in a single sentence (plus participants were sometimes given the opportunity to clarify, in their own words, the selected sentence), and Compare requires more reasoning and the answer is found in multiple sentences and articles.", "In this way, effort required for the Describe button was less than for the Explain and Compare buttons, which both required more effort.", "Within Check, Correct involved inspection of the agents notebook and an understanding of what was incorrect (at times requiring information from multiple sentences), and Quiz involved knowing whether the agents classification was correct or not (involving only a single sentence).", "Correct therefore required more effort than Quiz to use.", "Lastly, of the Entertain buttons, Fun Fact involved selection of a single sentence in the text (at times requiring an explanation of why the fact is fun or interesting) and the Tell Joke button involved no direct interaction with the text.", "Overall, as the task put to participants was to teach the agent", "for the agent versus selecting a sentence, as well as the length of these explanations when typed, and amount of time spent teaching.", "5.2.3 How does agent humour affect effort during teaching?", "As described previously, the Curiosity Notebook allowed participants to interact with the agent in various ways.", "To measure effort, we recorded the number of total button clicks in the interface, and separated: Teach (Describe, Explain, Compare), Check (Correct, Quiz), and Entertain (Fun Fact, Tell Joke) button clicks, the number of article and category clicks, the frequency of typing out explanations", "Participantsintheaffiliativeconditionwithahigher self-reported affiliative humour style themselves, were more likely to check the agents notebook (  = 0 .", "0004 , ( 24 ) = 2 .", "10 , = 0 .", "05), whereas those in the same condition with a higher self-reported self-enhancing humour style were less likely to check it (  =  0 .", "0004 , ( 24 ) =  2 .", "34 , = 0 .", "The rate of article clicks was significantly lower for participants with a higher self-reported affiliative humour style in the self-defeating condition (  =  0 .", "003 , ( 15 ) =  2 .", "26 , = 0 .", "Although article clicks can be viewed as a measure of effort, since it can be considered too much reading (n01), a lower rate may in fact indicate effort as well: I read the articles carefully to pick the best response (s05).", "There was no significant difference between conditions in the average number of words in explanations written by participants ( F (2,40) = 0.06, p = 0.95), however, there was a significant difference between conditions in whether participants chose to write an explanation in their own words or select a sentence from the articles ( F (2,50) = 3.56, p = 0.04).", "Tukeys HSD indicated a significant difference between the self-defeating condition and the neutral condition at p = 0.04, with participants in the self-defeating condition choosing to type out their own explanations significantly more often than selecting a sentence from the articles.", "Check Participants in the self-defeating condition were significantly less likely to use the Check buttons (Correct & Quiz) as frequently as participants in the neutral condition (  =  0 .", "01 , ( 36 ) =  3 .", "03 , = 0 .", "Furthermore, participants with a higher selfreported aggressive humour style were significantly less likely to use the Check buttons (  = 0 .", "0002 , ( 36 ) =  2 .", "47 , = 0 .", "02), unless they were in the self-defeating condition, and then it was more likely (  = 0 .", "0003 , ( 36 ) = 3 .", "27 , = 0 .", "Compared to those assigned to the neutral condition, participants with a higher self-reported self-enhancing humour style in the affiliative condition were also less likely to use the buttons (  =  0 .", "0002 , ( 36 ) =  2 .", "19 , = 0 .", "Looking at the use of the Check buttons separately: participants assigned to the affiliative condition with a higher self-reported selfenhancing humour style were less likely to use the Quiz button as frequently (  =  0 .", "0002 , ( 24 ) =  2 .", "38 , = 0 .", "Furthermore, participants with a higher self-reported aggressive humour style in the affiliative condition were more likely to use the Correct button more frequently (  = 0 .", "0001 , ( 15 ) = 2 .", "45 , = 0 .", "03), whereas participants in the same condition with a higher self-reported self-defeating humour style were significantly less likely to use it (  =  0 .", "0001 , ( 15 ) =  4 .", "23 , = 0 .", "6.1.1 Learning.", "The humorous agents in our study were not rated more likeable, social, or funny than the non-humorous agent, but they were rated as having more of a sense of humour.", "Humour is successful when both speaker and listener have an obvious intention of amusing each other, whereas failed humour occurs when this intention is unidirectional and the recipient fails to perceive the humour [5].", "This was observed when participants found the agents jokes to be lame (s12) or corny (a10).", "In other words, the benefits of having humour in an educational setting might diminish when the humour fails, and could explain the lack of learning gain observed in the studys humorous conditionshumour may only be effective for learning when perceived as funny.", "Teach There was no significant difference between conditions found in the rate of use of all Teach buttons together (  ( 2 , 50 ) = 1 .", "46 , = 0 .", "24), nor the Describe (  ( 2 , 50 ) = 0 .", "60 , = 0 .", "56) or Explain (  ( 2 , 50 ) = 1 .", "21 , = 0 .", "31) buttons separately.", "However, participants in the affiliative condition were significantly less likely to use the Compare button as frequently as those in the neutral condition (  =  0 .", "007 , ( 36 ) =  3 .", "04 , = 0 .", "004), but participants in this condition with a higher aggressive or affiliative humour style, were more likely to use it (  = 0 .", "0001 , ( 36 ) = 2 .", "10 , = 0 .", "04 and  = 0 .", "0001 , ( 36 ) = 2 .", "17 , = 0 .", "04, respectively).", "Entertain Across conditions, participants with a higher selfreported affiliative humour style were more likely to use the buttons (  = 0 .", "0001 , ( 36 ) = 2 .", "12 , = 0 .", "04) unless they were in the self-defeating condition where the probability was reduced (  =  0 .", "0002 , ( 36 ) =  2 .", "01 , = 0 .", "In contrast, participants with a higher self-reported self-enhancing humour style were less likely to use the Entertain buttons (  =  0 .", "00008 , ( 36 ) =  2 .", "03 , = 0 .", "05) unless they were in the self-defeating condition where the probability increased (  = 0 .", "0001 , ( 36 ) = 2 .", "02 , = 0 .", "Lastly, participants with a higher self-reported aggressive humour style were also less likely to use the button (  =  0 .", "0001 , ( 36 ) =  2 .", "49 , = 0 .", "02), across conditions, unless they were in the affiliative condition", "participants were asked to stop teaching after 40 minutes, it was up to them to finish the interaction after 40 minutes were over.", "Participants in the affiliative condition decided to spend significantly more time teaching their agents than participants in the other two conditions (  = 8 .", "18 , ( 49 ) = 2 .", "58 , = 0 .", "The rates at which the buttons were clicked calculated as number of button clicks divided by the time spent teaching were analyzed using linear models, where the set of independent variables that can best explain the variance of each measure was selected through stepwise model selection method.", "Although quiz scores increased post-interaction in all conditions, one-way ANOVA showed no significant difference in change in quiz scores from pre to post interaction (  ( 2 , 50 ) = 1 .", "12 , = 0 .", "34), across conditions.", "0001 , ( 36 ) = 2 .", "07 , = 0 .", "Looking at the Entertain buttons separately, the Tell Joke button was not used significantly differently between conditions (  ( 2 , 50 ) = 1 .", "52 , = 0 .", "23), nor was the Fun Fact button (  ( 2 , 50 ) = 0 .", "85 , = 0 .", "6.1.2 Experience.", "Prior work found humour to improve participants enjoyment of a task [41], however, in this scenario with a teachable agent, humour did not enhance enjoyment beyond what", "about classifying rocks, we would expect more effort to involve usage of the buttons as follows: Teach > Check > Entertain, and Compare|Explain > Describe > Correct > Fun Fact > Quiz > Tell Joke.Although", "We begin with a discussion of the effects of the humorous agents across all participants, and then take a closer look at how a learners humour style can interact with that of the agent.", "was experienced by participants in the non-humorous condition, and participants in the self-defeating condition were in fact less likely to have enjoyed teaching their agent.", "There are several possible reasons why.", "The first is a self-defeating agent might cause participants to think less of their own competency as the agents teacher.", "This is inline with prior research that shows prior student achievement as a valid predictor of collective teacher efficacy [50]  the belief that a teachers efforts can help even the most difficult or unmotivated students [22].", "In other words, the agents self-defeating jokes could lower participants own confidence and motivation as a teacher.", "Importantly, there is a cyclic relationship between student achievement and teacher efficacy [50]; the agents self-defeating jokes might cause participants to teach less effectively due to their lowered confidence, for example, participants in the self-defeating condition were less likely to Correct or Quiz their agent than in the neutral condition.", "Therefore, in the context of learning-by-teaching, self-defeating jokes could negatively impact the benefits.", "Participants in the self-defeating condition, did however put in more effort in giving the agent their own explanations.", "This indicates that although effort in the task may increase, it is not accompanied by enjoyment of the learning experience.", "Participants in both humorous conditions noted the overuse of humour.", "When asked what, if anything, they would change about the agent, participants in the affiliative condition referred directly to the frequency of jokes (e.g., Less frequent jokes! (a12)), whereas participants in the self-defeating condition referred more to the agents personality (e.g., More confident and kind to their self (s15)).", "In other words, participants perceived the content of self-defeating jokes as more reflective of the agents personality than the frequency of affiliative jokes.", "This is supported by prior research that found affiliative humour to be more closely associated with relationship variables than with emotional well-being, while self-defeating humour is related to anxiety, depression, ...and negatively associated with self-esteem and optimism [49].", "This provides a number of insights.", "First, telling affiliative or self-defeating jokes too frequently may have negatively impacted participants experience while teaching.", "Second, the optimal joke frequency is likely different for each participant and dependent on the type of joke, since only six participants in each condition found the agent to be joking too frequently.", "Third, prior research on associations between humour style and perceived personality applies to teachable conversational agents as well.", "Similar results on an overuse of humour being perceived as distracting have previously been found [45, 55], and prior work with conversational agents has investigated the timing of jokes, showing that an agent with appropriately timed humour makes the conversation more interesting than a non-humour-equipped one [16].", "Future work could look at whether improving timing and amount of affiliative humour style jokes improves the learning experience when conversing with a teachable agent.", "supporting previous work [17].", "Participants in the humorous conditions mentioned the agent gave some very human like responses ... more like a relative or peer I was teaching (s06) and was very personable (a12).", "Meanwhile, participants in the non-humorous condition mostly perceived the agent as a student that needed more human like responses (n07).", "Humour made the interaction more engaging and immersive, making it a desirable trait: it would be nice if sigma could tell jokes (n09).", "In particular, humour made the agent be perceived less as a model student (n03) and instead give Sigma a personality (a03).", "This human-likeness was hypothesized as a possible contributor to increasing motivation and effort.", "Indeed, our results show that participants in the affiliative condition rated their motivation as externally regulated more highly than participants in the self-defeating condition, suggesting they were more motivated by the agent than themselves (externally regulated) because of the connection made.", "Although fostering extrinsic motivation is useful in the short term, as tasks that educators set students are not usually inherently of interest to them [51], the goal of education is commonly to shift behaviour from extrinsically motivated to intrinsically motivated over time [19].", "This development over time, as it relates to humour, is worth investigating in the future.", "6.1.3 Motivation.", "Although the affiliative jokes were sometimes perceived negatively, participants in this condition spent significantly more time teaching their agents indicating that the negative perception did not impact their willingness to spend time on the task.", "The humorous agents were generally described as being more human-like than the non-humorous agent, almost life like (a04),", "As the Similarity Attraction Hypothesis suggests that humans like personalities similar to their own, we expected participants own humour styles to influence the results.", "Notable observations regarding participants with certain humour styles are discussed below.", "Self-Enhancing Humour Style Research has linked people with a self-enhancing humour style to high self-esteem [49] and being more capable of perspective taking empathy [29].", "Regardless of condition, participants with more of a self-enhancing humour style rated the agent as being a good student compared to other participants, a sign of higher levels of empathy among them.", "However, as a self-defeating agent has shown to cause many participants to not enjoy the teaching as much, paired with these participants higher self-esteem, may explain why they were more likely to rate such an agent as a worse student and less likable when compared to other participants and conditions, as well as rating themselves as worse teachers of a self-defeating agent.", "The higher empathy in participants with this humour style, might further give reason to their observed behaviours during teaching.", "Across conditions, these participants were less likely to use the Entertain buttons, unless they were in the self-defeating condition in which they were more likely to use them; possibly because of their empathy towards this agents feelings of not being able to learn well and wanting to ease the agent into the topic.", "It is possible that these participants in the affiliative condition were less likely to use the Check buttons, especially quizzing, and checking the agents notebook, because once they understood how the interface worked, they focused on other tasks.", "In other words, they needed less feedback and affirmation that the agent was learning what they were teaching, which others might do by repeatedly checking the agents notebook or quizzing", "Affiliative Humour Style Similar to self-enhancing humour, affiliative humour is an adaptive form of humour and linked to increased empathy, however affiliative humour has been found to be more relevant to facilitating relationships and relational functioning [29].", "When interacting with a self-defeating agent, participants with more of an affiliative humour style were more likely to have a lower article click rate.", "It is possible that this indicates participants were spending more time reading each article to ensure they taught the agent the most important information in the hopes of improving the agents perceived sad mood.", "This may include processes like identifying important passages (a11) and being able to find thesis sentences that would be good for base knowledge (a12).", "This is coupled with the fact that these participants were more likely to use the Entertain buttons across conditions, unless they were teaching the self-defeating agent, where the probability was reduced, i.e., possibly more effort was put into teaching than entertaining.", "When interacting with the agent that itself had an affiliative humour style, it is possible that the Similarity Attraction Hypothesis encouraged these participants to put in more effort when teaching, observed from the higher probability of checking the agents notes in the notebook and using the Compare button more frequently (requiring more effort than other button types), than other participants in the affiliative condition.", "Aggressive Humour Style As a maladaptive form of humour, the aggressive humour style has been linked to decreased perspective taking empathy and empathetic concern [29].", "People with a higher preference of this humour style are also found to be more likely to feel dysphoria and assume others as being more hostile [49].", "This style is found to be common among students with low school motivation [52].", "In other words, participants with more of an aggressive humour style may be more likely to display behaviour reflecting lower motivation in teaching the agent.", "This is observed in the lower probability of Check type buttons (Quiz; Correct) being used by these participants, which could be explained as a lack of motivation to perform tasks other than teaching the agent.", "Their higher amotivation score after interacting with the self-defeating agent also supports the possibility of these participants having lower levels of empathy for the agent.", "The question then, is how can an agent be designed to increase their motivation?", "A humorous agent might actually be an answer, as the ability of self-defeating jokes to elicit sympathy might make these participants perceive the agent as less hostile and feel more empathetic towards the agent, and an affiliative humour style may reduce tension during the interaction.", "Indeed, participants with more of an aggressive humour style were significantly more likely to use the Check buttons when they interacted with the self-defeating agent, and when interacting with the agent with an affiliative humour style, these participants had a higher probability of using the Compare and Correct buttons.", "In other words, both self-defeating and affiliative humour styles in teachable agents showed signs of being able to increase the level of effort among those with more of an aggressive humour style.", "the fact that self-defeating humour is commonly linked to shyness [28], lower self-esteem [28, 31], and users are more likely to develop maladaptive social support networks [31].", "As such, when interacting with an agent with an affiliative humour style, these participants might feel less capable/worthy of correcting a seemingly confident agent and hence correct it less.", "In contrast, when interacting with an agent that also displays low self-esteem, they might feel more confident in teaching it, resulting in higher ratings of their own teaching abilities.", "This explanation might again provide evidence for the Similarity Attraction Hypothesis for the case of the self-defeating humour style, and may also have implications for enhancing student self-efficacy.", "These insights are of extra importance, since just as the aggressive style, the self-defeating style is typical among students with low school motivation [52].", "Although humour has been found to reduce anxiety in students [37], increase interest [64], and create a learning atmosphere in which they can pay more attention [2], little is known about how it can be used by pedagogical conversational agents.", "Our results indicate that humour, in particular the two humour styles conducive to interpersonal relationships and social well-being, can both enhance, as well as detract from, the experience and outcomes of learners.", "In general, as an addition to an enthusiastic and curious teachable agent, affiliative humour can increase motivation and effort.", "Selfdefeating humour on the other hand, although increasing effort, does not result in as enjoyable an experience and may cause a decrease in learners own self-confidence.", "Self-Defeating Humour Style Participants with more of a selfdefeating humour style themselves were more likely to rate themselves as being better at teaching when interacting with a selfdefeating agent.", "However, when interacting with an agent with an affiliative humour style they were observed to be less likely to use the Correct button.", "These observations may be explained by", "Participants in this study were adults between 18-35 years.", "Although adults in the same age category were used in the humour elicitation stage, this population may differ in terms of humour preference compared to younger children, or older adults, reducing generalizability of the results to these populations.", "The interaction with the agent was short (one session, of approximately 40 minutes); therefore results could differ for longer exposure.", "The study focused on only two types of verbal humour, while many more exist, e.g., non-verbal humour or humour styles known as detrimental to interpersonal relationships, as well as being limited to text comprehension and the topic of rock classification.", "Measuring learning focused on retention rather than a deeper understanding, comprehension, or transfer.", "Prior work with pedagogical agents has shown that learning with an agent develops a deeper understanding (e.g., [39]).", "Future work could investigate this further using different types of quiz questions to understand what type of learning, is happening.", "Lastly, we acknowledge that humour styles have been found to correlate highly with various other personality characteristics, e.g., empathy, self-esteem, optimism, social support, and social self-efficacy, thus we cannot rule out the possibility that we are capturing correlated characteristics (as touched on earlier in the Discussion).", "We find that humour accentuates the human-likeness of an agent by giving it a personalitye.g., affiliative humour helped demonstrate happiness and intelligence, and self-defeating humour facilitated self-disclosure as the agent displays vulnerability as a", "struggling learnerpossibly resulting in the enhanced effort, motivation, and commitment to the task seen in the humorous conditions.", "This supports prior work showing that agents that express more human-like qualities, such as relational behavior [3], abilities to build rapport [43], displays of enthusiasm [35], or sharing vulnerabilities [9, 56], can help develop trust and bond between human and agent, making the interaction more engaging and leading to increased motivation.", "This is especially important in settings where a (teachable) agent is to interact with users over longer periods of time, where having more of a personality can be helpful to increase users commitment to a task [40].", "Some researchers have stated that humour should not be used by agents in on-topic conversation as it can distract users and suggest that it only be used in off-topic dialogue [17, 18], while others have found evidence of the positive influence on learning experiences and outcomes of agents engaging in off-task conversation during learning tasks (e.g., [26]).", "We find that, although on-topic, off-task humour was entertaining and motivating, it was also distracting for some participants and a high-frequency can lead to a loss of enjoyment in a learning-by-teaching scenario.", "However, the distraction, or extraneous cognitive load, was not necessarily detrimental to affective outcomes, as has been proposed by some researchers [10].", "Our study highlights the benefits of humour expression by pedagogical conversational agents, especially in the role of a tutee, but also the necessity for more research to investigate the best timing, context, style, and fit so as to make learners relate more to an agent (i.e., via self-defeating humour) and enhance the experience (i.e., via affiliative humour), what effects aggressive and self-enhancing humour styles have, and how combinations of different humour styles may influence learning experiences and outcomes further.", "Similar to prior work (e.g., [44]), our results illuminate the importance of the users personality characteristics and how they interact with the agentsindicating that care must be taken in the design of teachable agents, with a one-size-fits-all not always being the most successful when it comes to humour, but can lead to enhanced learning experience and outcomes when matched appropriately.", "Self-defeating jokes appear to evoke empathy and increase effort in learners with more aggressive, self-defeating, or affiliative humour styles, improved the confidence in teaching of learners with a selfdefeating humour style themselves, but negatively impacted the experience of learners with more of a self-enhancing humour style.", "An affiliative humour style similarly increased effort in learners with an aggressive or affiliative humour style, but negatively impacted the effort of learners with a self-enhancing or self-defeating humour style.", "These findings can be particularly important in informing design decisions for learners with low school motivation, for example, in which maladaptive humour styles are more typical", "We thank all participants for their contributions, and acknowledge the funding from NSERC Discovery Grant RGPIN-2015-0454 and University of Waterloo Interdisciplinary Trailblazer Fund for making this work possible.", "results showing significantly different effects of affiliative, self-defeating, and no humour on participants perception and effort in teaching an agent, and  a discussion of the effects of interactions between the agents humour style and the participants own humour style.", "Q1 : Does a teachable agents use of affiliative or self-defeating humour affect participants:  perception of the agent, i.e., perceived intelligence, likability, funniness, etc.,  attitudes toward the teaching task, i.e., enjoyment, pressure, motivation, effort etc., and  ability to recall material from the teaching task"]}
