{"paper_id": "uist-7", "sentences": ["Text entry is an important task for communication and productivity in augmented reality and virtual reality (AR/VR).", "While conventional physical keyboards and touch screens can be incorporated into AR/VR input systems, added peripherals detract from mobile use cases and accessibility.", "Automatic speech recognition is more accessible, but may not be socially acceptable for certain environments or for private communication.", "Recent advances in computer vision have shown that hand pose can be accurately estimated using commodity depth, RGB or monochrome cameras.", "Commercial AR/VR devices such as the Oculus Quest and the Microsoft Hololens have started using hand-tracking for text entry.", "However, existing hand-tracking-based text entry solutions for AR/VR are relatively low throughput.", "In this paper, we investigate the use of hand-tracking to enable typing on any at surface at speeds comparable to typing on a physical keyboard.", "This has several advantages to existing approaches.", "Hand-tracking is typically achieved through onheadset sensors, without extra peripherals, making it suitable", "on the rst page.", "Copyrights for third-party components of this work must be honored.", "This work is licensed under a Creative Commons Attribution International 4.0 License.", "Facebook Reality Labs", "Facebook Reality Labs", "Author Keywords", "Robert Wang", "Facebook Reality Labs", "Redmond, WA", "echo@fb.com", "Matt Durasoff", "Typing on a at surface is analogous to typing on a soft keyboard on a smartphone and inherits similar problems such as noisy input and systematic offsets [14] which can be addressed via statistical decoding methods [7, 10, 25] (see below).", "Touch typing, by which we mean eyes-free input, on a at surface has been studied in the context of gesture keyboards.", "The isFree system [30] is an example of a gesture keyboard that learns keyboard location from gesture input over time.", "Yang et al.", "[27] improve rst touch accuracy for a gesture keyboard by centering the keyboard around rst touch.", "Our work is most similar to that of Zhu et al.", "[29], who enforced touch-typing on a smartphone surface by asking users to tap on an invisible keyboard.", "We show that by using hand pose rather than contact points and a richer motion model, we can achieve more accurate decoding.", "Goodman et al.", "[7] rst applied statistical decoding to improve the accuracy of a soft keyboard by modeling key-targets as bi-variate Gaussians and representing a language model as an n-gram distribution.", "Gunawardana et al.", "[10] improve on key-targets with dynamic resizing and respecting minimal key regions or anchors.", "Weir et el.", "[26] use Gaussian Process regression to model key targets.", "Kristensson et al.", "[17] model a trajectory of contacts as well as words in a language model geometrically and decode stylus gestures via a geometric matching method.", "Similar to our proposed method, Velocitap [25]", "Many other text entry systems have been proposed for AR/VR applications, and for brevity, we concentrate on those that use a QWERTY keyboard layout.", "The ARKB system [18] showed a very similar concept of typing on a QWERTY virtual keyboard on a surface using hand-tracking through color-based segmentation and markers.", "Since then, hand-tracking technology has advanced signicantly.", "The ATK system [28] uses skeletal hand-tracking (via a Leap Motion device) to drive text entry, although through midair typing.", "The VISAR system [5] also uses hand-tracking (via a Hololens device) to enable typing, although with just the index ngers.", "VISAR also integrates a more sophisticated decoding strategy [25] to achieve superior mid-air typing on Hololens.", "Vulture [21] uses a high-precision marker-based hand-tracking system to capture a pinch and the tracing of a path (of a word-gesture) through a QWERTY keyboard, which are then decoded into the best word proposals.", "Similarly, RotoSwype [11] uses a ring to capture the motion of a single nger tracing a path through a QWERTY keyboard in the air, achieving speeds of at least 14WPM with a 1% error rate by the end of a ve-day study.", "PalmType leverages passive haptics by using the opposite hand as a tapping / typing surface, although this approach comes at the cost of limiting typing to a single hand.", "Our method is designed for typing on a at surface rather than in the air or against the opposite hand.", "We believe the on-surface domain, while slightly less accessible, better leverages existing typing skills, allowing our method to achieve speeds comparable to typing on a keyboard at a low error rate.", "We also use complete hand pose of all the ngers on both hands rather than the pose of a single nger.", "People type faster on a physical keyboard [3] than a soft keyboard and also faster on a surface [4] than in the air.", "In our study we compromise between accessibility and speed by requiring users to type against a surface but eschewing the use of a physical keyboard or a touchpad.", "Additionally, surface typing has been shown to be more comfortable than mid air typing [4] and confers haptic feedback, which enhances presence in VR [16].", "Our investigation caters particularly to the fastest typists touch typists , which we mean as those who type without the sense of sight to nd the keys.", "Without the feel of physical keys and without using sight to nd the keys, ngers will drift during typing.", "Instead of requiring users to make precise contacts on a xed keyboard layout, we investigate using a motion model to recognize nger trajectories, and we further explore how statistical decoding techniques affect performance.", "for on-the-go use cases.", "Typing on a virtual keyboard is more discreet than speaking.", "Most importantly, there already exists a wide audience of effective typists.", "Surveys of internet users show that even average typists can achieve speeds greater than 50 words per minute (WPM) with the fastest 90 th percentile achieving more than 78 WPM [3].", "We show that these users can transfer their existing skills typing on a keyboard to typing on a at surface.", "We are inspired by the work of Dudley and colleagues [4] that shows the high potential of human typing efciency and error rate given a text decoding oracle with knowledge of the text being typed.", "In this work, we take the rst steps to reducing this oracle to practice by building a neural model of text decoding that combines motion modeling of ngers and a state-of-theart language model.", "Notably, our model is the rst technique to our knowledge that converts skeletal hand motion directly into text.", "Instead of relying on surface contact information (e.g., from capacitive touch), we investigate using the output of a marker-based hand-tracking system [12].", "Hand-tracking provides potentially richer sensing information (including nger identities and trajectories) than the contact modality.", "While marker-based hand-tracking is still an optimistic approximation of the delity achievable from an AR/VR headset, our experiments shed light on the potential of hand-tracking-based text decoding.", "Specically, we make the following contributions:", "To evaluate the feasibility of using hand-tracking to enable touch typing on virtual keyboards, we rst collect a dataset of skeletal hand-tracking data from touch-typists transcribing short phrases while typing on a at surface.", "Next, we design a system for decoding the skeletal hand-tracking data into the text the typists intended to type.", "Finally we measure typing speed and error rates of our system against typing on a physical keyboard and contact-based statistical decoding methods.", "Statistical decoding of typing is analogous to text decoding in automatic speech recognition.", "The combination of connectionist temporal classication (CTC) loss and beam search is a cornerstone of modern end-to-end speech recognition systems [1].", "Graves and Jaitly [9] rst applied CTC loss with a prex beam search decoder to speech recognition, and Hannun and colleagues [13] showed how to directly incorporate a language model.", "We apply this same general framework, substituting recurrent neural networks with a TCN-based motion model, to decode text entry via typing.", "Flat surface typing is a paradigm that exists today in tablet computers.", "While we are targeting a different sensing modality (hand-tracking instead of capacitive touchpads), we can use touchpads as a baseline for our work.", "We rst investigate touch typists ability to transfer their physical keyboard typing skills to typing on virtual keyboards imposed on at surfaces, and we then compare the performance of decoding text from skeletal hand-tracking data to decoding text from 2D surface contact points from a touchpad.", "The network is trained with a batch size of 32, where each individual sample consists of input features { u i } Ti = 1 , where T depends on how long it took the participant to type the phrase.", "The target for each sample is the sequence of keys W  = { w  j } Nj = 1 that were prompted to the participant.", "The network is trained using the CTC loss function[8], which allows for sequence level labels without needing known alignment of labels to individual frames of input data.", "The output of the network V = { v i } Ti = 1 is a corresponding sequence of T frames, each containing a probability distribution v i ( k ) over the set of the K + 1 possible keys (with one extra for the blank label).", "This output can be interpreted as a T  ( K + 1 ) heat map", "We use a temporal neural network as a motion model.", "This model takes as input a sequence of frames of hand-tracking features and for each frame outputs a probability distribution over the set of possible keys, plus one additional label for blank / no-key.", "The model should assign more likelihood to a key when the user is hitting a key, and otherwise assign likelihood to the blank label.", "uses beam search with a language model to decode whole sentences at a time, although Velocitap uses contact as the input modality while our method uses hand-tracking.", "To collect a dataset of skeletal hand-tracking data, we make use of a high quality marker-based hand-tracking system [12] which is not subject to the current tracking limitations of consumer head mounted hand-trackers.", "Consumer hand-tracking systems on current generation HMDs are optimized for virtual manipulation tasks rather than text input.", "While using a marker-based tracking system may introduce a gap in tracking quality compared to what is achievable on an AR/VR headset, we can study the potential of hand-tracking applied to this problem.", "The input features to the network are frame-to-frame deltas of wrist position and rotation along with 3D ngertip positions.", "All positions are represented in the coordinate frame of the keyboard (the touchpad, or a virtual keyboard in the runtime).", "We chose these features because they are somewhat invariant to differences in hand scale across people.", "For temporal modeling, we opt to use a temporal convolutional network (TCN) rather than a recurrent model because a xed window of hand motion data is typically sufcient to make predictions about key presses.", "Longer term context is useful for prediction in the context of language, but since our system design separates motion modeling from language modeling, a TCN works well for the former.", "An advantage of using a TCN is efciency during training, since TCNs can process entire sequences in parallel rather than sequentially as with recurrent neural networks.", "We follow the TCN architecture proposed by Bai et al.", "[2] which consists of causal dilated convolutions and weight normalization arranged in residual blocks.", "We use three layers of residual blocks with 64, 64, and 32 hidden units respectively, a kernel size of 2 and a dilation factor of 3.", "This architecture allows for 46 past frames of hand features (around 0.75 seconds of motion at 60Hz) to be referenced to generate the current probability distribution over the set of keys.", "The problem of generating text from hand motion has strong analogs to automatic speech recognition (ASR), and we use ASR as motivation to design a multi-component system with the following three pieces.", "The motion model captures the mapping from nger trajectories to intended key presses.", "This mapping is inherently ambiguous, for example, when a nger strikes the boundary between two keys, and is exacerbated by drift of the users ngers due to the lack of haptic feedback of physical keys.", "We apply a beam search decoder to resolve these ambiguities using the language model as a prior.", "For decoding hand motion into text, we make no such concessions and investigate the accuracy we can achieve using practical language models and statistical decoding strategies presented in this work.", "In our study we collected data by having participants complete a text transcription task for short phrases.", "To evaluate handtracking as an input modality compared to contact data from touchpads or to physical keyboards, we asked participants to type each phrase on either a physical keyboard or on a Sensel pressure sensitive touchpad with a printed 2D keyboard layout afxed (See Figure 3).", "In both cases, we also captured their hand motion using a marker-based hand-tracking system [12].", "We use a beam search implementation with beam compaction which maximizes the objective W = argmax W p total .", "After decoding, we compute the uncorrected error rate UER ( W , W  ) as the Levenstein edit distance between the decoded and prompted strings divided by the number of characters of the longer of the two strings.", "For all of our results, we use B = 100 beams.", "For our language model, we use a Transformer [24] model similar to the small-two model described in [15] with 4.76M parameters.", "This language model was trained on using a window of 500 characters on text sampled from 2 million articles in the CC-News dataset [20].", "containing the prediction of which key was hit at which time (Figure 2).", "To transcribe the probabilities V into typed text, this output must be decoded into a sequence of keys W .", "Participants typed phrases up to 40 characters long drawn from two corpora; samples used to t or train models were randomly sampled from Daily Dialog [19], while samples for testing and evaluation were randomly sampled from Mackenzie and Soukeroff [23].", "For each participant, data was collected in three distinct blocks in the following order:", "Participants were given prompts with 3-6 word phrases containing only lowercase alphabetical characters and spaces.", "After typing each phrase, participants would use one of two foot pedals to mark that they felt they correctly typed the phrase, or that they typed the phrase but felt they made mistakes.", "Since our goal is to produce the text people intended to type, we ltered samples where the user believed they made a mistake since we dont know what text the user expects to be produced in those cases.", "A naive greedy approach to decoding is to generate a label for each frame t  T by taking ` t = argmax k v t ( k ) .", "These labels { ` t } tT = 1 are compacted into a transcription W by rst combining adjacent frames with the same label into one of that label, and then by removing all blank labels.", "Aside from the prompted phrase, no visual feedback was afforded in any of the blocks.", "Participants typed a median of 362 training phrases (approximately 6650 characters), and a median of 131 testing phrases (approximately 3400 characters).", "Test phrases were randomly sampled from a corpus of 500 phrases giving a possibility of overlap between the physical", "We recruited 20 participants who passed a pre-screening questionnaire designed to select for experienced typists.", "In this questionnaire all participants self identied as expert typists who type for more than 30 minutes per day and who use at least 3 distinct ngers to type the word ghost on a QWERTY keyboard.", "We can do better than greedy decoding by using a prex beam search decoder [13].", "A prex beam search decoder approximately maximizes p ( W ; V ) by incrementally constructing W by tracking a set of B best candidates (beams) at any given step.", "Furthermore, we can incorporate a joint probability from both the likelihood of the beam according to the motion model p ( W ; V ) as well as the likelihood of the compacted text according to a language model p lm ( W ) , i.e.,", "1 +  p total = ( p ( W ; V ) p lm ( W )  ) where  is a hyperparameter to control the balance between the two likelihoods.", "This allows the language model to steer decoding when the motion model is uncertain (See Figure 2).", "As has been shown in the speech recognition community [9], beam search decoding is also well-suited to the CTC loss with which we train the network.", "Because contact-based text decoders are sensitive to accidental or missed touches, we took care to clean the contact-based training data from the touchpad captures.", "We ltered out captures where the number of touchpad contact events did not agree with the number of characters in the prompted phrase.", "In each of the remaining samples we expect that the N th contact event corresponds to the N th character in the prompted phrase.", "To lter samples where both an extra and a missing contact event occurred (leading to an agreement on counts but an error in contact-key sequence alignment), we build up a distribution for each key of how many times each nger hit that key.", "We then lter samples where multiple keys in the sample were struck by a nger which hits that key in less than 1% of cases overall.", "Our rst evaluation is to determine if participants are able to transfer their existing skills typing on a physical keyboard to typing on a at surface (with the help of our proposed decoder).", "Participants of our user study type at different speeds, so we compare the relative speed of typing on a at surface versus a physical keyboard.", "Because our participants were tasked with typing test-set phrases on both a physical keyboard and on a touchpad, we can make this comparison directly.", "We found that our expert typists generally typed efciently both on physical keyboards (median: 75 WPM, mean: 74 WPM) as well as on surfaces (median: 69 WPM, mean: 73 WPM).", "A Wilcoxon signed-rank test also showed no statistically signicant difference (p = 0 . 859) with participants typing speed across the two modalities.", "The testing dataset used for all decoders is the same, except that we only lter samples where the user felt they made a mistake, which means that the number of characters typed might not equal the number of contact events.", "We wish to quantify our ability to produce the text people intended to type, which should include all of the samples where participants felt they typed the phrase correctly.", "We present two evaluations of our proposed text entry method using the data collected from our user study.", "The rst evaluation is a direct comparison against physical keyboards, and the second evaluation consists of two experiments aimed at", "Hand-tracking information was recorded while participants typed during all three blocks.", "Participants wore elastic mesh gloves with 19 retro-reective motion capture markers afxed, and the method from Han and colleagues [12] was used to generate skeletal hand tracking informationspecically, joint angles and wrist transforms necessary to drive a tted hand mesh.", "The touchpad was calibrated by placing three retroreective hemispheres at corners of the touchpad and tting a transform to align those 2D touchpad coordinates with the corresponding 3D marker positions.", "This transform enabled all 2D contact points to be lifted into the 3D coordinate space in which the skeletal hand poses were represented.", "This result is consistent with previous ndings on the performance envelopes of human typing [4] which described the high potential of typing speeds given a limited text decoding oracle.", "Our result reduces this oracle to practice by substituting it with our proposed neural text decoder.", "Participants typed on physical keyboards with a mean UER of 1.72% (median: 1.19%) compared to a mean UER of 2.38% (median: 1.77%) when they typed on at surfaces with our decoder.", "A Wilcoxon signed-rank test showed no statistically signicant difference (p = 0 . 131), however the descriptive statistics might suggest that users can still type more accurately on physical keyboards (Figure 4).", "keyboard and surface test set phrases.", "Using the foot pedals participants discarded a median 15.89% of surface phrases compared to 12.5% of physical keyboard phrases; a Wilcoxon signed rank test found no signicance ( p = 0 . 328).", "While the contact-based baselines can only be trained with known key/contact-point correspondences, our motion model is trained using CTC loss, which allows for sequence level labels and can deduce the frame-level alignment of the labels.", "Thus our motion model was able to be trained on the original training dataset, only ltering samples where users felt they made a mistake.", "We note that this less ltered training dataset more closely mirrors the testing dataset.", "For our motion model we trained person-specic models that captured each users typing style from the training set portion of the data.", "All of our results were computed over the test set portion of the data.", "While this is not an interactive result, it simulates the same condition of decoding additional text from the user after a model had been trained (although without providing visual feedback to the user).", "The resulting touchpad training dataset consists of samples where we have", "1) a sequence of length N of keys that were typed,", "2) a sequence of length N of 2D contact events from the touchpad, and", "3) a sequence of length T of skeletal hand poses while those keys were typed, recorded at 60Hz.", "better understanding which aspects of the motion model make it perform so well.", "Our system differs from prior work in several ways.", "We use a higher capacity neural motion model to decode a richer input signal (i.e., with nger identity and trajectory information) into text.", "Our decoding is also continuous (at 60Hz) rather than constrained to producing characters at discrete contact events.", "We attempt to tease apart the contributions of these differences with two experiments.", "In our second experiment we investigate the contribution of continuous motion decoding versus discrete contact-based decoding.", "We observed that many mistakes made by contactbased decoding were due to its discrete nature: Characters are generated if and only if there is a corresponding contact event, which means that spurious or omitted contacts necessarily result in decoding errors.", "We attempt to ablate away the continuous nature of hand motion decoding by creating a ltered test dataset containing only samples with matched contacts and keys.", "We repeat our evaluation of the two baselines on this corresponded contacts dataset, isolating the value of trajectories from the value of continuous decoding and nger identity information.", "In our rst experiment we study the contribution of nger identity information.", "To do so we create two contact-based baselines for comparison, one that uses only anonymous, discrete contact events, and another that adds nger-identity information.", "We compare these baselines to each other and to our hand motion based decoding to isolate the impact of nger identity information.", "Using the cleaned training dataset, we obtain a sequence of keys pressed { w  i } and a sequence of 2D contact points from the touchpad { x  i } (See Figure 5).", "Since these sequences are in correspondence, we can bucket 2D contact points for each key on the keyboard.", "For each key k we t a bivariate Gaussian g k ( x ) = N ( x ;  k ,  k ) from the collection of 2D contacts.", "During inference, the likelihood of a novel 2D contact point is measured according to each Gaussian, and the resulting distribution over all keys is then normalized p ( k ; x ) = g k ( x ) /  Kk 0 = 1 g k 0 ( x ) .", "This distribution over the set", "For our rst baseline, Gaussian contact decoding , we evaluate performance using the spatial modeling approach described by Zhu et al.", "This model lacks the continuous text decoding capabilities of our motion model, but rather has to decode text only at discrete contact events.", "This model also lacks the", "richer input features of hand-tracking, e.g., which nger is hitting a key or which path the nger took to reach a key.", "The previous experiments show that our continuous hand motion decoding method is more accurate than decoding of discrete contacts with either a simple Gaussian spatial model or a richer model with nger identity information.", "When we examined the results qualitatively, we noted several differences between the contact-based decoding approach and our handtracking-based approach, which we illustrate in Table 2.", "Some of the error discrepancies could be explained by augmenting with nger identity information.", "Others could be attributed to the addition of nger trajectory information.", "Figure 1(b) shows an example where our motion model is able to learn to detect the signature trajectory of reaching for a particular key.", "Finally, others were due to the fundamentally discrete nature of contact decoding.", "In order to disentangle the benet of continuous motion decoding versus discrete contact decoding, we lter our test dataset similarly to our training set to contain only samples where we know the correspondences between contact events and ground truth character labels.In this ltered corresponded contacts dataset, there are no samples with missing or spurious contacts.", "Any remaining errors from the contact-based methods can only be due to the richness of the input signal.", "At rst, we assumed that the discrete nature of contacts was an advantage for contact decoding.", "Explicit contact information is a strong signal for a key-press, whereas our motion model has to learn to detect the signature trajectory of a nger as it presses a key.", "However, when using a touchpad, we assume no ambiguity in whether a contact event occurred, only 2D spatial ambiguity about which key was pressed.", "There is no mechanism to detect an accidental touch or to guess when a touch event should have happened but was missed.", "Because contact-based decoding occurs only at discrete touch events, for an accidental touch, the system must assign a key to the event, and for a missing touch, the system cannot insert an extra key-press.", "On the other hand, our motion model generates a probability distribution of which key was pressed (including no-key) at every frame of the tracking, which provides the decoder exibility to insert or remove key-presses to accommodate the language model prior (Figure 7).", "Repeating the evaluation of the previous two baselines on this ltered corresponded contacts dataset, we found a substantial drop in the mean UER for all methods (Table 1), suggesting that removing spurious or missing key-presses makes for an easier dataset.", "However, the decrease is greater for the contact-", "For our second baseline, Per Finger Gaussian contact decoding , we specically investigate if augmenting the spatial model input with nger identity information improves performance of the contact-based model.", "Recent studies show that touch typists and faster typists tend to have lower entropy in their nger to key mapping [6].", "As shown in Figure 6, we found our expert typist participants tended to have consistent key-nger correspondences.", "Motivated by this nding, we hypothesized that providing a richer input feature that includes which nger pressed a key can help a model disambiguate which key was pressed.", "With greedy decoding, the 2D contact-based methods appeared to have higher variance, though the median UER was comparable across the three strategies.", "When we added the beam search language model decoder, however, we found that both Gaussian and Per Finger Gaussian contact-based methods performed comparably with a mean UERs of 5.66% (median 2.70%) and 4.76% (median 2.64%) respectively, while our motion model approach outperformed both with a mean UER of 2.38% (median 1.77%).", "A Wilcoxon signed-rank test found the motion model performance to be signicantly better than both Gaussian (p = 0 . 0258) and Per Finger Gaussian decoding", "To use nger identity information, we make two changes to our Gaussian contact decoding baseline.", "First, we nd the closest ngertip f for each contact using hand-tracking data and then bucket by both key k and nger f to t 2D Gaussians h k , f ( x ) to these subsets of contact points.", "Second, at inference time, we use the known ngertip f to compute the distribution over the set of keys for a specic nger p ( k ; x , f ) = h k , f ( x ) /  K = 1 h k 0 , f ( x , f ) k 0 .", "Using our touchpad evaluation dataset we compared the two baselines with our motion model approach (Figure 8).", "We decoded all test set samples using the Gaussian, Per Finger Gaussian, and our hand motion model with a greedy decoder with no language modeling.", "We then tested a beam search decoder with a language model on the same three conditions.", "(p = 0 . 011), indicating that factors beyond nger identity had a strong impact on performance.", "of keys can be processed using the same beam search decoder and language model we described for hand motion decoding.", "Session 9B: Interpreting and Adapting Hand Input", "based methods, which makes the differences between hand motion decoding and the two baselines no longer statistically signicant ( p = 0 . 300 for Gaussian and p = 0 . 109 for Per Finger Gaussian) according to a Wilcoxon signed rank test.", "This suggests that continuous hand motion decoding is better able to cope with the mistakes in the unltered dataset.", "Still, the remaining discrepancy in descriptive statistics between hand motion decoding UER and both baselines suggests that nger trajectory information is helpful for further disambiguating typed text.", "Note that while more sophisticated contact-based decoders such as the one described in Velocitap [25] can add or remove characters during decoding, they would not have access to nger trajectory information.", "In this interactive setting we constrained our beam search decoder to force convergence for any predictions older than 6 frames (0.1s) causing all beams to have a common prex.", "We only rendered text in the common prex of all beams, effectively imposing a xed 0.1s delay.", "This prevented any visible retroactive changes and maintained a controlled latency, while allowing corrections of the most recent 1-2 characters for most typists.", "While this serves as a proof of concept for interactive utility, our system still lacks many fundamental features required of any practical text input system, such as backspace or punctuation.", "Typing on any at surface without the need to bring a physical keyboard would provide a valuable addition to AR/VR interaction.", "In this paper we take a major step towards realizing the viability of such a system by demonstrating decoding of text from hand motion captured with a high quality hand-tracking system.", "We have shown on a 20 person dataset that touchtypists can transfer their skills typing on a physical keyboard to typing on a at surface, reaching comparable typing speeds (73WPM) while retaining an uncorrected error rate of less than 2.4%.", "We achieved this result through the introduction of a novel motion model mapping hand motion to text, represented as a temporal neural network, and the application of beam search decoding combined with a modern neural language model.", "We also show that our hand-tracking-based decoder can produce signicantly lower error than two baselines using contact-based text decoding (with and without nger identity information).", "Many challenges remain to making this system practical for general text input.", "We will need to handle a lower quality", "Our motion model network is compact, containing just 180KB of weights, enabling efcient evaluation on a GPU.", "Our language model consists of 19MB of weights.", "We are able to run both models, in addition to decoding, at interactive rates (i.e. 120 Hz) on a PC with an Nvidia RTX 2080Ti graphics card.", "These models were not optimized for compute and can be further accelerated using modern distillation and quantization techniques for neural networks [22].", "Session 9B: Interpreting and Adapting Hand Input", "We created a toy text entry application with an Oculus Rift and the Unity game engine to demonstrate real-time touch typing on a at surface in VR using hand-tracking (Figure 9).", "UIST '20, October 2023, 2020, Virtual Event, USA", "hand-tracking input signal from mobile headsets, or alternatively improve the state-of-the-art of egocentric hand-tracking today.", "Our system currently does not support typing of nondictionary words effectively.", "For this work, we trained per-user neural motion models over an hours worth of typing samples and will need a more user-friendly version of user calibration.", "When we attempted to train a single between-users model on the combined training sets of all users, the performance did not match the user specic models (UER rose from 2.4% to 3.9%, which a Wilcoxon signed rank test found to be signicant, p = 0 . 001).", "We will need to explore a more efcient user calibration process in future work.", "Our current experiments provide no visual feedback during typing, and more exploration of what visual feedback to offer, e.g., along the lines of Velocitap [25] is needed.", "Finally, we are only decoding the lower case letters of the alphabet on our keyboard.", "We will need to handle other keys, including backspace, numbers and symbols to support general interactive text editing.", "Session 9B: Interpreting and Adapting Hand Input", "Session 9B: Interpreting and Adapting Hand Input", "Session 9B: Interpreting and Adapting Hand Input", "We propose a motion model, represented as a temporal convolutional network (TCN), that can translate hand motion directly into (a probability distribution over the) typed text.", "We show that we can combine our motion model with a language model, also represented as a neural network, using an efcient beam search decoding technique.", "We show that tracking hands typing on a at surface combined with our statistical decoding method has the potential of achieving speeds comparable to typing on a physical keyboard while maintaining low-error rates.", "We also explore why decoding continuous hand motion data could be advantageous to decoding a discrete set of contacts on a touch surface by isolating the value nger trajectory information, nger identity information and continuous decoding.", "1. A motion model, analogous to an acoustic model, which takes a sequence of hand poses and for each frame outputs a likelihood over an alphabet of tokens, i.e., keys plus a blank token corresponding to no key.", "2. A language model which can give the likelihood of an additional token given a prex of tokens.", "3. A decoder which can optimize an objective function combining the likelihoods from both the motion and the language models.", "1. 5 minutes of test set phrases on a physical keyboard", "2. 60 minutes (in 5 minute blocks) of training set phrases on a touchpad", "3. 5 minutes of test set phrases on a touchpad"]}
