{"paper_id": "uist-3", "sentences": ["Another difference from conventional markers is that LightAnchors can transmit dynamic payloads, without the need for WiFi, Bluetooth or indeed, any connectivity.", "Devices need only an inexpensive microcontroller (e.g., [22], which costs less than $0.50 USD) with the ability to blink a LED.", "This could allow dumb devices to become smarter through AR with minimal extra cost (much less than e.g., adding a screen to a device).", "For example, we created a glue gun that transmits its live temperature (Figure 1).", "For devices that already contain a microprocessor, LightAnchors opens a new information outlet in AR, for example, the LED found in many security cameras could be used to share the devices privacy policy (Figure 1).", "As smartphones are the most pervasive AR platform at present, we created a proof-of-concept LightAnchors implementation for iOS.", "This native application requires no special hardware or operating system modifications, and simply takes advantage of high-speed cameras that have shipped on recent smartphone models (up to 240 frames per second on the iPhone 7 and later models).", "In addition to describing our algorithm, we also report the findings of a transmission performance study, which tested accuracy at different distances, with two light sizes, and while held still and in motion.", "We conclude by describing ten example applications we built to illustrate the potential of LightAnchors.", "In this paper, we present LightAnchors, a new method to display spatially-anchored data in augmented reality applications.", "Unlike most prior tracking methods, which instrument objects with markers (often large and/or obtrusive), we take advantage of point lights already found in many objects and environments.", "For example, most electrical appliances now feature small (LED) status lights, and light bulbs are common in indoor and outdoor settings.", "In addition to leveraging these point lights for in-view anchoring (i.e., attaching", "Augmented reality (AR) allows for the overlay of digital information and interactive content onto scenes and objects.", "In order to provide tight registration of data onto objects in a scene, it is most common for markers to be employed.", "Innumerable visual tagging strategies have been investigated in both academia and industry (e.g., retroreflective stickers, barcodes, ARToolKit markers [15], ARTags [7], AprilTag [31], QR Codes [14], and ArUco markers [29]).", "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page.", "Copyrights for components of this work owned by others than ACM must be honored.", "Abstracting with credit is permitted.", "To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee.", "Request permissions from Permissions@acm.org.", "information and interfaces to specific objects), we also coopt these lights for data transmission, blinking them rapidly to encode binary data.", "Human-centered computing  Human computer interaction (HCI)  Interaction paradigms  Mixed / augmented reality", "Chris Harrison", "CCS Concepts", "Author Keywords", "UIST 19 , October 20-23, 2019, New Orleans, LA, USA", "Mayank Goel", "https://doi.org/10.1145/3332165.3347884", "2019 Association of Computing Machinery.", "At a high level, for every incoming frame of video, our algorithm creates an image pyramid, such that lights  big or small, close or far  are guaranteed to be contained within a single pixel at least one level.", "Our algorithm then searches for candidate light anchors using a max-pooling template that finds bright pixels surrounded by darker pixels.", "We then track candidate anchors over frames, decoding a blinked binary pattern using an adaptive threshold.", "To drop false positive detections, only candidates with the correct preamble are accepted, after which their data payloads can be decoded.", "This process allows us to robustly track and decode multiple LightAnchors simultaneously.", "We encode all data as a binary sequence, prefixed with a known pattern.", "Since we repeatedly transmit the same message, the prefix appears at both the beginning and end of every transmission, which makes payload segmentation straightforward.", "We modulate lights with this pattern between high and low intensities at 120 FPS using a microcontroller (Teensy 3.6 or Arduino Mega) and its digital-to-analog converter (DAC).", "This blinking speed is right at humans flicker fusion threshold, and the flashing is generally imperceptible, but depends on the particular payload.", "With specialized equipment, it is possible to transmit data at high speeds with visible light (VLC).", "For instance, the IEEE 802.15.7 standard [26] allows LEDs to transmit data at up to 96 Mbit/s using specialized photosensors to form line-ofsight wireless networks.", "More relevant to LightAnchors are VLC-style techniques that use commodity cameras, for e.g., room-level localization [25].", "These VLC systems most often use diffuse or ambient modulated light and the rolling shutter operation of cameras to receive data faster than the full-frame rate of the camera [5, 13].", "However, this approach does not work as well for point light sources (which only cover a small portion of the image at typical distances), nor when many lights are active in a scene.", "There are a wide variety of successful fiducial marking schemes.", "For example, ARTags [15] use black-and-white 2D patterns that allow conventional cameras to read a data payload and also estimate 3D position/orientation of the tag.", "Other popular schemes include QR Codes [14], April Tags [31] and ArUco markers [29].", "These printed tags are highly visible, and thus often obtrusive to the visual design of objects.", "In consumer devices, tags are often placed out of sight (bottom or rear of devices), which precludes immediate use in AR applications.", "To make tags less obtrusive, researchers have explored embedding subtle patterns into existing surfaces, such as floors and walls [30].", "Many light-based schemes have been previously considered.", "For example, IRCube [11] studded a device with infrared LEDs and demonstrated position and orientation tracking.", "Bokodes [23] used tiny lenslet-covered illuminated tags that can be resolved when imaged by an out-of-focus camera.", "Markers or patterns can also be projected onto the environment, such as dot patterns [32] and m-sequences [35].", "All of these approaches require special hardware and do not demonstrate dynamic data payloads.", "Rarer are systems that support dynamic payloads.", "For example, SideBySide [33] digitally projected infrared ARTags onto the environment, which could e.g., identify users in multiplayer projected AR games.", "In CapCam [36], smartphones were placed onto large interactive screens; small patches were used to encoded data as colored sequences that were read by phones rear-facing cameras.", "Grundhfer et al.", "[8] used a 120Hz digital screen with a synchronized camera to capture fiducial tags that appeared on specific frames.", "Prakash [28] inverted this approach, projecting a structured light pattern onto photosensors, which track themselves within a projected volume.", "capability to recognize objects using a smartphone camera, after which interactivity can be offered (see also the commercial Vuforia augmented reality software toolkit [24]).", "However, these systems require some form of preregistration of the to-be-recognized object or scene, and the object itself cannot transfer information beyond its identify.", "Augmented reality systems can also track objects using innate features.", "Today, there are many object-recognition computer vision libraries that can track objects without special tags or markings (e.g., [9]).", "Snap-To-It [6] uses such", "LightAnchors is closer in spirit to approaches that use active point lights as markers.", "ID CAM [21] proposed using LEDs as beacons, blinking at 4 kHz and sensed with a speciallydesigned high-speed camera.", "Similar approaches have been used to track drones [2] and capture human motion [12].", "To support tracking of many tags in a scene, [12] synchronized LEDs with RF communication.", "Lastly, [4]describes a smartphone-based system that tracks LEDs using the camera and demonstrates transmission speeds of ~1 bit/sec for enhanced interactions with toys.", "Unlike prior approaches that synchronized light modulation with e.g., RF triggers [12], our lights and smartphones are totally unsynchronized.", "This means it is possible for the camera shutter to align with transitions in our blinked pattern, which at best reduces SNR, and at worse, means the pattern is unresolvable.", "To recover from this type of failure, we phase shift our transmitted signal by 36 after each transmission.", "We used basic binary transmission as a proof of concept, but LightAnchors could also be extended to use multiple illumination levels and colors.", "LightAnchors overlaps with several disparate literatures, including marker-based tracking approaches, marker-less computer vision techniques, and visible light communication.", "We now briefly review these research areas.", "RELATED WORK Session 2A: Augmented and Mixed Reality", "Marker-Less Strategies", "Light-Based Markers", "Fiducial Markers", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "After each frame is tracked, we attempt to decode all candidate anchors.", "As noted above, our tracker keeps a history of candidate anchors over time, which provides a sequence of intensity values.", "Rather than use only the center pixel value, we average over a small region, which we found to be less sensitive to camera noise and sub-pixel aliasing during motion.", "To convert the analog light intensity signal into a binary sequence, we use a dynamic threshold.", "We purposely employ preambles that contain both 1s and 0s (i.e., high and low brightness), which allows us to find the midpoint of the min and max intensity values at both the beginning and end of a transmission.", "We linearly interpolate between these two midpoints (Figure 2) to produce a binary string.", "We profiled our implementation using Xcode on both a iPhone 7 and iPhone X. We tested different base resolutions (i.e., largest pyramid size), and for each, ran three trials of 500 frames each.", "Data was processed at 120 FPS, except for 320x180, which was processed at 240 FPS.", "The combined results are shown in Figure 3.", "Although reducing the image resolution greatly improves processing time, we found that scaling the image becomes a major bottleck (often making up 50% of the processing).", "Even though we used the highly optimized iOS CoreGraphics API, we suspect that this bottleneck could be greatly mitigated with better GPU acceleration, which could allow LightAnchor detection to run at 240 FPS or more.", "To evaluate the robustness of our approach, we tested point lights of different size, across varying rooms, lighting conditions, and sensing distances.", "We also tested accuracy while the device was still and held by a user while walking.", "We now describe this procedure and results in detail.", "Our detection process passes all candidate anchors to our tracker on every frame, which must be computationally inexpensive in order to maintain a high frame rate.", "First, we merge proximate candidate anchors  ones too close to be separate LightAnchors (this often happens when a LightAnchor is detected at multiple pyramid levels).", "We then attempt to pair all current candidates with candidates from the previous frame using a greedy Euclidean distance matcher with a threshold to discard unlikely pairings.", "If a match is found, the current point is linked to the previous candidate anchor, forming a historical linked list.", "Our tracker also uses a timeto-live of five frames to compensate for momentary losses in tracking (e.g., image noise, momentary occlusion, loss of focus).", "Although this algorithm is basic, it is computationally inexpensive and works well in practice due to our high frame rate.", "Our LightAnchor detection algorithm is designed to have high recall.", "Given a raw camera image, we first convert to grayscale and build an image pyramid (five layers, scaling by half).", "We model LightAnchors as bright spots surrounded by darker regions.", "Specifically, for each pixel, we compute the difference between the center pixel value and the maximum value of all pixels in a 7  7 diamond perimeter.", "We then threshold this result at every pixel and at every pyramid level, which produces an array of candidate anchors for each incoming frame of video.", "Finally, we flatten results from all pyramid layers so that candidate anchors are in the coordinate space of the highest resolution pyramid.", "An interesting corner case that must be handled are reflections from LightAnchors (e.g., glints off specular objects, which also appear as point lights).", "Like actual LightAnchors, these blink valid sequences and are decoded correctly by our pipeline.", "However, they almost always have a lower range of intensities (as they are secondary sources of light) and we use this fact to filter them.", "More specifically, if two candidate anchors are found to have valid, but identical sequences in the same frame, we only accept the one with higher signal variance.", "In our proof-of-concept iOS app, we use the AVCaptureSession API to grab video frames and OpenCV for image processing.", "We enqueue all video frames, which are consumed asynchronously by our detection-tracking-decoding thread (described in subsequent sections).", "Our software runs on the iPhone 7 and X, which can capture video frames at 240 FPS.", "In general, this is too much pixel data for our current implementation to process in real time at high video resolutions, and so we generally use 720p video.", "Only at 320x180 can we process a 240 FPS image stream.", "When frames are scaled, we use iOSs optimized CoreGraphics API.", "compensations for low-frequency changes in illumination (e.g., moving cloud cover, user motion, camera auto-exposure adjustment).", "We then test for the presence of our known pre/postamble.", "If this is missing, the candidate is not decoded (i.e., we might be too early or late, or the tracked point is a static light and not a modulated light anchor).", "However, if the pre/postamble is correct, the data payload is saved to the anchor.", "Frame Capture Session 2A: Augmented and Mixed Reality", "We captured study data using an iPhone 7 (720p at 120 FPS) in three environments: workshop, classroom and office.", "In each of these settings, we varied the lighting condition: artificial light only (mean 321 lux), artificial light + diffuse sunlight (mean 428 lux) and lights off (mean 98 lux).", "We captured data using a tripod (i.e., smartphone held still) and also while walking slowly (~1 m/s, to induce some motion blur).", "We recorded approximately one second of video data at 2, 4, 6, 8, 10 and 12 meters.", "For our still condition, we used a surveyors rope to mark distances, and for our walking condition, we used a 50cm printed ArUco tag for continuous distance tracking (accepting frames within 0.5m).", "Within each setting, we used two exemplar point lights: a standard 3mm LED and a larger 100x100mm LED matrix.", "These were placed 1.5m from the ground on a tripod and separated by 120cm.", "These two lights simultaneously emitted different (but known) 16-bit LightAnchors, driven by a single Arduino Mega.", "For all conditions, the LightAnchors pipeline ran with a base pyramid size of 1280x720, with 6-bit pre/postambles and 10-bit payloads.", "positives.", "The likelihood of any random pixel in the environment matching our pre/postamble is fairly low.", "Upon closer analysis of the video data, it appears most of these were actually small reflections of our actual LightAnchors, and thus transmitting correct patterns (an effect discussed in our Decoding section above).", "If we apply our variance filter, accepting only the best signal, it reduces false positives to 0.4% and true positives to 99.6%.", "Across all conditions and distances, we found a mean bit error rate (BER) of 5.2%, or roughly 1 error in every 20 transmitted bits.", "Note that this figure includes the 0.4% of false positives that made it through our various filtering stages.", "Overall, this level of corruption is tolerable and can be mitigated with standard error correction techniques, such as Hamming codes [10].", "With respect to light size, the small LED had 6.5% BER, while the larger LED had 3.8% (Figure 4, left).", "Unsurprisingly, BER was higher while walking (mean 7.7%) than when the camera was still (2.7%), as seen in Figure 4 middle.", "Likewise, errors increased as ambient brightness increased (Figure 4, right).", "We also computed BER across the different base resolutions used in our performance analysis (Figure 3), and it is clear that high resolution (at least 720p) is needed to detect, track and decode LightAnchors accurately.", "There are several effects that can cause incorrect rejection of LightAnchors, including poor tracking, motion blur, suboptimal camera-light synchronization, camera sensor noise, and variations in ambient lighting.", "As discussed above, it is rare", "Our detection rate did not change substantially across study conditions, and so we combine detection results for brevity.", "On average, our system found 50.8 candidate anchors (9.0 SD) in each frame.", "Of course, only two of these were actual LightAnchors, and our system detected these in all cases (i.e., a true positive rate of 100%).", "After the pre/postamble filtering process, the true positive rate was still 100%, but our system found 3.1% false", "Across all conditions, we found a mean recognition time of 464 ms. As our test LightAnchors were 22 bits long (6 bit preamble, 10 bit payload, 6 bit postamble), they take a minimum of 183ms to transmit at 120 FPS.", "Because there is no synchronization, detection of a LightAnchor is almost certainly going to start somewhere in the middle of a transmission, meaning the system will have to wait on average 92 ms for the start of a sequence.", "The remaining 373 ms means that, on average, LightAnchors had to transmit twice before being recognized.", "We note that this latency varies across conditions, for example, mean recognition latency is 312 ms when the camera was held still (i.e., the first full transmission is often successful) vs. 615 ms when the user was walking (~3 transmissions before recognition).", "The data payload of LightAnchors can be used in three distinct ways: fixed payloads, dynamic payloads, and connection payloads.", "To illustrate these different options, as well as to highlight the potential utility of LightAnchors, we created eleven demo applications.", "We note that these examples would require no a priori setup of devices and smartphones, and would allow anyone with the LightAnchors App on their phone to begin instantly interacting with objects in AR.", "The simplest use of LightAnchors is a fixed payload (similar to fiducial markers).", "Although this could contain plain text, the limited bitrate of LightAnchors makes this impractical.", "Instead, we envision transmission of an ID, which permits lookup through a cloud service, after which larger payloads (e.g., restaurant name, opening hours, menu, coupons, etc.) could be fetched over a faster connection (e.g., cellular, WiFi).", "By utilizing geolocation in the lookup, it may be possible to use fairly small IDs (e.g., 16 bits).", "As a demonstration of a fixed payload, we instrumented a street parking meter (Figure 5, left) with a light that transmits its enforcement zone ID (from which the rate schedule could", "for our system to completely miss a visible LightAnchor, but it is common for a LightAnchors to have to transmit several times before being recognized.", "To quantity this, we used our collected data to compute the average time required to detect, track, and decode a LightAnchor.", "To do this, we started our detection pipeline at random offsets in our video data and recorded how long it took until LightAnchors were successfully decoded.", "Finally, LightAnchor payloads could be used to provide connection information.", "For example, a smart light switch could provide an IP address, allowing smartphones to open a socket and take control (Figure 7, left).", "To mitigate malicious behavior, a token with a short time-to-live could also be transmitted to ensure that users have at least line-of-sight.", "An internet connection could also allow devices to transmit a custom control interface, for example, a small HTML/CSS app.", "For instance, upon connecting to a smart thermostat, a simple temperature control widget could be downloaded and displayed in AR (Figure 7, center).", "As a final demo, we created a mock payment terminal (Figure 7, right) that could allow a", "We have presented our work on LightAnchors, a new approach for overlaying information and interfaces onto everyday objects in mobile AR.", "We take advantage of point lights (e.g., LEDs) that already exist in a wide range of products (or could be added for a few dollars).", "We described our implementation and results from an evaluation, which shows that", "The biggest drawback of our method is limited bitrate, which is chiefly set by smartphone processors and camera FPS.", "This limits our practical payload size and makes our system prone to security issues found in schemes such as QR codes [16] .", "Fortunately, high-speed cameras are becoming increasingly commonplace in the market, and some Samsung devices can now capture video at 960 FPS.", "As camera FPS increases, LightAnchors can blink at higher rates, making the data imperceptible irrespective of the data payload and allow for much larger payloads.", "Smartphone processors also continue to improve, especially GPU performance, which should allow us to work with higher video resolutions, which would allow for LightAnchor detection at longer ranges.", "There are also challenges in controlling the exposure and focus of the camera to enable robust tracking.", "We found the automatic camera settings were not ideal for LightAnchors (i.e., clipping in dark scenes), and so we had to lock settings such as exposure.", "However, as our user interface is a passthrough AR experience, settings that are ideal for LightAnchors are not always ideal for a human user.", "More interesting are dynamic payloads, which contain a fixed UID that denotes the object, along with a dynamic value.", "For example, a glue gun (object identifier) and its live temperature (dynamic value), seen in Figure 1.", "A typical glue gun contains no digital components, and thus in practice, would require the addition of a microcontroller and thermistor, costing as little as $1 USD [22].", "We also created two other demo devices that generally lack compute: a fire alarm that reports its operating status and an electrical strip that reports its power draw (Figure 6, left and center).", "Finally, at present, our LightAnchor widgets are flat with respect to the smartphone screen, as a single LightAnchor cannot provide 3D orientation.", "However, a known geometry of at least three non-planar LightAnchors (e.g., status lights on a microwave or WiFi router) could allow for recovery of 6DOF position in the future.", "A similar effect might also be achieved using techniques such as structure from motion [20] and SLAM [17].", "Either way, this would produce a more immersive AR effect.", "Of course, many devices already contain microprocessors that can control status lights and could be LightAnchor-enabled with a firmware update.", "For example, a networked security camera could be updated to use its recording light to share its privacy policy (Figure 1), and a router could shares its SSID and a randomly generated guest password via its status lights (Figure 6, right).", "be retrieved).", "Similarly, we modified an outdoor entrance light to output a fixed UID (Figure 5, center); the summoned LightAnchor displays the building name (Department of Motor Vehicles), its current status (open), and closing time (5pm).", "Lastly, we modified a conference room phone demo that conveniently displays its call-in number (Figure 5, right).", "smartphone to connect (securely) over the internet and enable payment.", "Connection Payloads", "our approach can be rapid and accurate.", "We plan to release our LightAnchors app on the Apple App Store, as it can run on recent iOS devices.", "This research was generously supported with funds from the CONIX Research Center, one of six centers in JUMP, a Semiconductor Research Corporation (SRC) program sponsored by DARPA.", "We are also grateful to Anthony Rowe and his lab for early brainstorming on this effort.", "ACKNOWLEDGMENTS", "Session 2A: Augmented and Mixed Reality", "Session 2A: Augmented and Mixed Reality", "UIST '19, October 2023, 2019, New Orleans, LA, USA"]}
