{"paper_id": "uist-5", "sentences": ["Despite the difficulty they experience, PLV use their residual vision extensively when navigating stairs [73].", "Zhao et al.", "[86] found that they looked at contrast stripes ( i.e ., contrasting marking stripes on stair treads) to perceive the exact location of stair edges; some also observed the trend of the railing to understand the overall structure of a staircase.", "However, sometimes stairs do not have contrast stripes, and even when they do, their stripes are often not accessibly designed; for example, stripes may have low contrast with the stairs or be too thin to detect [86].", "Today, the only known tool to assist with stair navigation is the white cane, which many PLV prefer not to use [86].", "Thus, there is a gap in tools that support PLV in the basic task of stair navigation.", "As many as 1.2 billion people worldwide have low vision , a visual impairment that cannot be corrected with eyeglasses or contact lenses [11, 72].", "Unlike people who are blind, people with low vision (PLV) have functional vision that they use extensively in daily activities [73, 74].", "Low vision can be attributed to a variety of diseases ( e.g ., glaucoma, diabetic retinopathy) and affects many visual functions including visual acuity, contrast sensitivity, and peripheral vision [21].", "Our research explores AR visualization designs to facilitate stair navigation by leveraging PLVs residual vision.", "Designing visualizations for PLV is challenging [84, 85], especially for stair navigation, a dangerous mobility task.", "On one hand, the visualizations should be easily perceivable by PLV.", "A visualization that a sighted person can easily see ( e.g ., a small arrow) may not be noticeable by PLV: it may be too small for them to see or outside their visual field [87].", "On the other", "Stair navigation is one of the most dangerous mobility challenges for PLV [5].", "With reduced depth perception and peripheral vision [45, 56], PLV have difficulty detecting stairs or perceiving the exact location of stair edges [86].", "As a result, PLV experience higher rates of falls and injuries than their typically-sighted counterparts [5, 13].", "Advances in augmented reality (AR) present a unique opportunity to address this problem.", "By automatically recognizing the environment with computer vision, AR technology has the potential to generate corresponding visual and auditory feedback to help people better perceive and navigate the environment more safely and quickly.", "Human-centered computing~Mixed / augmented reality; Accessibility technologies.", "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page.", "Copyrights for components of this work owned by others than ACM must be honored.", "Abstracting with credit is permitted.", "To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee.", "Request permissions from Permissions@acm.org.", "2019 Association for Computing Machinery.", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "https://doi.org/10.1145/3332165.3347906", "ACM ISBN 978-1-4503-6816-2/19/10$15.00", "Author Keywords", "In the humancomputer interaction field, researchers also explored the challenges that PLV face during navigation, including navigating stairs.", "Szpiro et al.", "[73] observed 11 PLVs behaviors as they navigated to a nearby pharmacy.", "They found that PLV struggled but used their vision extensively, and lighting conditions affected their ability to notice obstacles and uneven pavement on the ground.", "Zhao et al.", "[86] conducted a more in-depth study observing 14 PLV walking on different sets of stairs indoors and outdoors.", "They found that most participants relied on their vision ( e.g ., looking at contrast stripes) to navigate stairs.", "Besides the white cane, which only four participants used, no technology was used to assist with this task.", "Zhao et al.", "s study emphasized the need for tools that facilitate stair navigation for PLV.", "In addition to navigation systems, researchers have also proposed stair detection algorithms [20, 30, 5760, 68, 79].", "For example, Murakami et al.", "[58] proposed a method that uses an RGB-D camera to detect stairs.", "Cloix et al.", "[20] designed an algorithm that detected descending stairs with a passive stereo camera, achieving a 91% recognition rate in real-time.", "Perez-Yus et al.", "[60] proposed a real-time recognition method that detected, located, and parametrized stairs with a", "Stair navigation is one of the most dangerous mobility challenges for PLV [5].", "Legge et al.", "[47] found that failing to detect descending stairs was more dangerous and had a higher correlation with falls than failing to see obstacles or ascending stairs.", "West et al.", "[80] measured 782 older adults visual abilities and collected self-reported mobility limitations.", "They found that people with low visual acuity and low contrast sensitivity reported difficulty walking up and down stairs without help.", "Bibby et al .", "[8] also surveyed 30 PLV about their mobility performance, finding that PLV reported greater difficulty navigating curbs and descending stairs.", "Mobility problems for people who are blind and PLV can be divided into two categories: wayfinding ( i.e ., the global problem of planning and following routes from place to place) and safe navigation ( i.e ., the local problem of taking the next step safely without bumping into things or tripping) [75].", "Most prior research in this general area has focused on wayfinding, both indoors [3, 27, 35, 38, 46, 62] and outdoors [4, 12, 15, 29, 50].", "Yet walking up and down stairs falls into the latter category, which has received less attention.", "hand, the visualizations should not be distracting.", "An extremely large, bright, or animated visualization can distract PLV and hinder their ability to see.", "This could be dangerous in the context of stair navigation.", "We sought to design effective visualizations for PLV, which balance visibility and distraction, while providing alternative choices to support a wide range of visual abilities.", "We designed visualizations on two AR platforms that can generate immersive virtual content in the physical environment: projection-based AR and smartglasses.", "Our designs considered the different characteristics of the two platforms: (1) For projection, which can augment a large physical space, we designed visual highlights with different patterns that are directly projected onto the stairs to enhance their visibility (Figure 1a).", "(2) For smartglasses that have a limited vertical field of view (FOV), we designed visualizations in the users central FOV to indicate the users exact position on the stairs (Figure 1b).", "Since perceiving stairs is essential for safe navigation, many obstacle avoidance systems also detected stairs [7, 17, 28, 34].", "For example, Bhowmick et al.", "[7] designed IntelliNavi, a wearable navigation system that combined a Kinect and an earphone.", "With SURF descriptors and an SVM classifier, the system recognized walls, stairs, and other obstacles and generated audio messages to safely guide a blind user through and around these features.", "Capi and Toda [17] embedded depth sensors and a PC into a wheeled walker.", "With the depth sensors recognizing the environment, the system informed blind users of the existence and position of obstacles, stairs, and curbs using verbal directions or beeps.", "Moreover, Hub et al.", "[36] presented an (unimplemented) concept for an indoor navigation system that provided more specific information about stairs, such as the number of stairs and the position of the railing.", "In summary, we contribute the first exploration of AR visualizations to facilitate stair navigation for PLV.", "Our evaluations demonstrated the effectiveness of our visualizations and provide insights for the design of AR visualizations for PLV that support other tasks as well.", "To facilitate safe navigation, researchers designed obstacle avoidance systems for people who are blind ( e.g ., [1, 24, 48, 77]).", "By detecting obstacles with cameras or range finders, these systems generated auditory [2, 39, 40, 53, 70, 78] or tactile feedback [14, 52, 54, 71, 76] to notify blind users of obstacles and their distance.", "Mobility is critical but challenging for PLV.", "Many studies have shown that reduced visual functions hinder mobility [6, 10, 19, 44, 80] and increase the risk of mobility-related accidents [5, 13, 22, 23, 31, 32].", "For example, Leat and LovieKitchin [45] found that visual field loss reduced walking speed, while reduced visual acuity and contrast sensitivity impacted distance and depth perception.", "We evaluated our visualizations on each platform with 12 PLV.", "We found that the visualizations on both platforms increased participants self-reported psychological security.", "Our visualizations also changed participants behaviors.", "Many participants didnt stare down at the stairs when walking with our visualizations; some stopped holding the railing.", "Moreover, the visualizations on the projection-based AR platform showed a trend to significantly reduce participants walking time.", "Stair Navigation Experiences of PLV", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "Session 3B: Accessibility", "We sought to facilitate stair navigation by augmenting the stairs with AR visualizations.", "In general, there are three types of AR displays: video see-through, optical see-through, and projection [88].", "For each display type, devices exist (either commercially or as research prototypes) with different form factors and device characteristics.", "For example, a mobile device can be used as a video see-through AR platform.", "It is hand-held with a limited FOV.", "Considering the different visual abilities of PLV and our new use case for AR, we did not know a-priori what AR platform would be most appropriate for the stair navigation task.", "Although there are no popular commercial devices in the market, researchers have prototyped different hand-held projection-based AR platforms [16, 18, 63, 82].", "With a growing number of smartphones that have embedded depth sensors (e.g., iPhone XR, Samsung Galaxy S10) and projectors (e.g., Samsung Galaxy Beam [67]), smartphones may support projection-based AR with depth-sensing capabilities in the near future.", "Thus, we designed visualizations for such a projection-based AR smartphone to augment the stairs for PLV.", "Some research has contributed obstacle avoidance systems for PLV [26, 33, 41, 64].", "Everingham et al.", "[26] designed a neural-network classification algorithm for a head-worn device that segmented scenes rendered in front of users eyes and recolored objects to make obstacles more visible.", "Similarly, Kinateder et al.", "[41] developed a HoloLens application that recolored the scene with high contrast colors for PLV based on the spatial information from the HoloLens.", "Besides recoloring the scenes, Hicks et al.", "[28] and Rheede et al.", "[64] built a real-time head-worn LED display with a depth camera to aid navigation by detecting the distance to nearby objects and changing the brightness of the objects to indicate their distances.", "To our knowledge, our research is the first attempt to facilitate stair navigation for PLV.", "In terms of low-tech tools, some PLV use optical devices to enhance their visual abilities.", "Bioptics, monoculars, telescopes, and binoculars are used for recognizing signs and obstacles at a distance [81].", "Some PLV occasionally use prisms that are ground into glasses to expand their FOV.", "However, these specialized tools often stigmatize users in social settings [69]; thus, people avoid using them or abandon them altogether [25].", "Some PLV also use a white cane, especially at night and in unfamiliar places, but many prefer not using it because it exposes their disability [86].", "From an interaction perspective, we aimed to simulate use of a flashlight, which is commonly used by PLV in dark places [79]: when a user points the projection-based AR phone at the stairs, it recognizes several stairs in front of her and projects visualizations on those stairs in real time (Figure 1a).", "Inspired by the contrast stripes that many PLV used to distinguish stair edges [79], we project highlights on the stair edges to increase their visibility.", "Based on the formative study, we narrowed down our target platforms to immersive AR platforms, specifically (1) handheld projection-based AR, and (2) optical see-through smartglasses.", "These platforms would not require the user to switch their gaze or hinder their ability to perceive motion [88].", "We designed and evaluated visualizations for both platforms, given that each platform has its own strength: projectionbased AR can augment large physical surfaces but projects content publicly, which may be better suited to private places with few people ( e.g ., home, workspace); meanwhile, smartglasses present information only to the user, which may be better for crowded public places ( e.g ., subway stations).", "According to Zhao et al .", "[86], PLV had difficulty detecting stairs and recognizing the stair edges, especially at a distance.", "As a result, they walked slowly, stared down to better see the current and next stair, and shuffled their feet to feel the stair edges.", "We therefore designed our visualizations to help them perceive the stairs from a greater distance, so they can better plan and prepare their steps.", "We first explored the design space of hand-held projectionbased AR, which combines a camera that recognizes the environment and a projector that projects visual contents into that environment [61].", "This platform has potential to facilitate mobility because it can project over a relatively large area [88] and provide visual augmentations in peoples peripheral vision, which is shown to be important for stair navigation [56].", "had difficulty perceiving the visualizations on the hand-held phone screen.", "They switched their gaze between the phone and the real stairs, hindering their safety during motion.", "All participants said they would prefer an immersive experience where visualizations are seamlessly incorporated into the physical environment.", "To determine what platforms would be appropriate, we began by conducting a formative study with 11 PLV (7 female, 4 male; age: 2870, mean = 40) to evaluate prototype visualizations for a smartphone.", "A smartphone is a widely used AR device, so it would be a practical choice with potential for high immediate impact.", "We presented the real-time captured image of the stairs on the phone screen and enhanced the stair edges with yellow highlights.", "However, participants", "There has been little research on navigation systems for low vision.", "No work has specifically focused on stairs.", "To alert users of the presence of stairs as they approach, we first generate auditory feedback to provide an overview of", "wearable RGB-D camera, and could even work when the stairs were partially occluded.", "This prior research addressed only auditory feedback for people who are blind, overlooking PLVs preference to use their remaining vision.", "In contrast, our work addresses this gap by designing AR visualizations to assist PLV in navigating stairs.", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "Session 3B: Accessibility", "Apparatus.", "The study was conducted at an emergency exit staircase with eight stairs.", "To minimize the confounding effect of computer vision accuracy, we prototyped our design with a Wizard of Oz protocol [65].", "This involved mounting a stationary projector on a tripod at the top of the set of stairs.", "The projector was connected to a laptop that generated the visualizations.", "We created all visualizations with PowerPoint.", "A researcher sat in front of the laptop to control the visualizations manually, based on the participants position and orientation (facing upstairs or downstairs).", "To simulate the limited projection area of a handheld projector, we projected visualizations only on the three stairs in front of the participant (Figure 1a).", "the stairs, including the stair direction and number of stairs.", "Zhao et al .", "[86] found that PLV sought this kind of information, which at times was difficult to perceive.", "We provide three different auditory feedback choices: (1) Sonification that indicates stair direction: one ding sound for going up and two ding sounds for going down, adapted from the sonic alerts for some elevators; (2) a human voice that verbally reported stair direction and number of stairs: Approaching upstairs, 14 stairs going up; and (3) a combined sonification and human voice: ding, approaching upstairs, 14 stairs going up.", "Participants.", "We recruited 12 PLV (6 female, 6 male; mean age=53.9) with different low-vision conditions, as shown in Table 1 (P1  P12).", "Eleven participants (all except P3) were registered as legally blind, meaning that either (1) their bestcorrected visual acuity in their better eye was 20/200 or worse, or (2) their visual field was  20  .", "We conducted a phone screen to ensure participants were eligible.", "We evaluated the visualizations for projection-based AR, aiming to answer three questions: (1) How do PLV perceive the different visualization designs?", "(2) How useful are the visualizations for stair navigation?", "(3) How secure do people feel when using our visualizations?", "Since locating the first and last stairs was most important but challenging for PLV [86], we distinguish the first and last stairs from the rest by projecting thick highlights on them (Figure 2a), while projecting thin highlights on the middle stairs (Figure 3a).", "We call the highlights on the first and last stairs End Highlights , and we call those on the middle stairs Middle Highlights .", "We needed a visible color for these highlights that would not be confused with natural light, so we used yellow.", "Since a staircase typically has stairs of uniform size, the middle stairs usually do not require much of the users attention.", "Beyond these highlights, we sought ways to further emphasize the first and last stairs so that a user will notice them and perceive their exact location from a distance.", "We designed five animations to achieve this:", "We designed two middle highlights to support the user in a minimally obtrusive way.", "(1) Flash: Since a flash can attract peoples attention [83, 84], we added this feature to the end highlights.", "The highlights appear and disappear with a frequency of 1Hz.", "(2) Flashing Edge: When the end highlight flashes, the user may lose track of the edge position when the highlight disappears.", "So in this design, we kept a stable line at the stair edge while flashing the rest of the highlighted strip (Figure 2b).", "The flash occurs at a frequency of 1Hz.", "(3) Moving Edge: Movement also attracts attention [51].", "With a stable line at the stair edge, we added another line moving towards the edge to generate movement (Figure 2c).", "(4) Moving Horizontal Zebra: Since movement can be distracting [84], we design a more subtle movement effect with a yellow and black zebra pattern moving back and forth at a frequency of 1Hz (Figure 2d).", "(5) Moving Vertical Zebra: Moving the highlight over the edge of the stair may distort the perceived location of the edge, so we also designed a zebra pattern that is perpendicular to the edge (Figure 2e).", "To support a range of visual abilities, the design alternatives can be selected and combined by a user to optimize her experience for a particular environment.", "In each phase, we presented all design options to the participant and asked about their experiences, including whether or not they liked the design, whether the design distracted them from seeing the environment, and how they wanted to improve it.", "For each design option, participants were encouraged to walk up and down the stairs.", "To avoid order effects, we randomized the order of the design alternatives.", "During the visualization experience, we gave the participant our prototype smartphone and explained how to use it.", "The participant experienced our design in three phases: (1) Auditory feedback when approaching the stairs, with three alternatives: sound, human voice, and the combination of them; (2) End highlights on the first and last stairs with six design alternatives (Figure 2); and (3) Middle highlights on the middle stairs with three design alternatives (Figure 3).", "We ended the study with an exit interview, asking about the participants general experience with the prototype.", "They also gave Likert-scale scores for the usefulness and comfort level of the prototype, as well as their psychological security when using the prototype, ranging from 1 (strongly negative) to 7 (strongly positive).", "We analyzed the effect of our visualizations on participants walking time when navigating stairs.", "Our experiment had one within-subject factor, Condition (Visualizations, No Visualizations), and one measure, Time .", "We indicated the start points with yellow stickers on the landings, three feet away from the top and bottom stairs.", "For each task, participants stood at the starting point and started the walking task when the researcher said, Start.", "The task ended when both their feet first touched the landing.", "Participants were asked to walk as quickly and safely as possible.", "We recorded the time for each task.", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "After the participant experienced all design alternatives in all three phases, we asked them to select one alternative from", "Procedure.", "The study consisted of a single session that lasted 1.5 hours.", "We started the session with an interview, asking each participant about their demographics, visual condition, and technology use when navigating stairs.", "A licensed optometrist conducted a confrontation visual field test and a visual acuity test using a Snellen chart (Table 1).", "After the interview, we walked the participant to the staircase and continued the study with a visualization experience session and a stair navigation session.", "To reduce order effects, we used a simultaneous within-subjects design, switching the task condition after each walking up and down task.", "We counterbalanced the starting task (up/down) and condition (with/without the prototype).", "During the stair navigation portion of the study, participants conducted two stair navigation tasks: walking upstairs and walking downstairs.", "They conducted each task in two conditions: (1) walking in their original way (participants could use a cane if desired, but nobody chose to use it); (2) walking using our prototype with their preferred combinations.", "They repeated each task in each condition five times.", "each phase to create a preferred combination.", "Participants used this combination for the stair navigation portion.", "Session 3B: Accessibility", "We asked the participant to hold a regular phone with the back camera facing the stairs, assuming the projected visualizations were from the smartphone.", "We also implemented the auditory feedback on the smartphone.", "One researcher controlled the audio feedback with another smartphone via TCP.", "Although we provided different visualizations (flash or movement) to further enhance the end highlights, most participants (seven out of 12) liked the original design.", "They felt the thickness and brightness of the highlights sufficiently attracted their attention and flashes and movements distracted them.", "As P7 explained: I guess because I dont see details,", "Two participants (P2, P3) liked the Moving Vertical Zebra the most.", "They felt that the movement attracted their attention and the vertical zebra pattern also labeled the stair edges.", "However, none of the participants liked the Moving Horizontal Zebra since the parallel movement to the stair edge distorted its appearance.", "fined a Trial (15) as one walking task.", "To validate counterbalancing, we added another between-subject factor, Order (two levels: WithWithout, WithoutWith), into our model.", "An ANOVA found no significant effect of Order on walking time (downstairs: F (1,10) =0.108, p =0.749; upstairs: F (1,10) =0.007, p =0.937) for  = 0.05.", "In terms of color, most participants preferred the bright yellow (seven out of 12), wanting to be alert on each step.", "The yellow gives me more alert and the blue gives me a little bit more of a relaxed mode. But when I go up and down the steps, I wanna be alert (P5).", "Three participants (P6, P4, P11) felt the flash effect grabbed their attention more and alerted them.", "P6 and P4 preferred the Flashing Edge since it helped them better track the stair edges than the Flash.", "However, P11 preferred the Flash since the thin stable highlight of the Flashing Edge gave him an illusion of another small step (P11).", "Although no participants chose the Moving Edge in the study, P6 felt it could be helpful since it indicated direction.", "She explained that at least it shows you where to go.", "However, most participants found it overwhelming; it made them feel like the ground is going to move (P9).", "participants felt our design was helpful and [would make] life easier (P4), especially in relatively dark environments, such as subway stations.", "They liked the idea of projecting highlights on the stair edges to simulate the physical contrast stripes.", "P9 said, Having [the highlights] this bright is really good. Because usually [the contrast stripes] are painted, and theyre about to fade out, and theyre not as vibrant and bright as this is. This is great here because you can see it.", "Participants gave high scores to the usefulness and comfort level of the visualizations, as shown in Figure 4.", "when I see things moving, I kind of get the sense of not seeing it correctly.", "I prefer just still Youve got the thick [end highlights] to distinguish from the thin [middle highlights].", "This is nice.", "So you dont have to guess whats coming [with the middle highlights]. Sometimes you can have a broken step, you can have no step, or you can have a step that was not installed properly. Sometimes staircases were defective and the distance between some of them is not even With the [highlights], you can see the definition of the steps. (P5)", "Even on a typical set of stairs, participants wanted the middle highlights to confirm that they are still on the stairs, which made them feel safe.", "Its better with [the] lines. So I know that this wont be my final step (P10).", "We analyzed the participants qualitative feedback by coding the interview transcripts based on grounded theory [66].", "Next, we report participants responses on all design alternatives in the three design phases.", "(3) Middle highlights .", "Eleven out of 12 participants found the middle highlights useful.", "Projecting highlights onto the next several steps gave participants a preview of the stairs and helped them better prepare their steps, especially when there were abnormal stairs.", "As P5 said,", "(1) Auditory feedback when approaching stairs .", "Four participants chose the human voice since they felt it was friendlier and more informative, reporting the number of stairs.", "Meanwhile, three participants (P2, P8, P7) chose the nonverbal sound because they had relatively good vision and felt the human voice was unnecessary.", "The other participants preferred the combination, feeling that the sound and human voice complemented each other: the ding sound was an alert in noisy environment and the human voice reported more concrete information.", "(2) End highlights.", "All participants felt that the end highlights were an important aspect of the design.", "This is the part where I probably trip the most, on that last step. The light [end highlights] is really important because it defines the end of the step, so youre not gonna miss a step (P5).", "Effectiveness of the Visualizations (and Sonification).", "However, current optical see-through smartglasses have a very limited FOV [88] ( e.g ., ca. 30 wide  17 high for HoloLens v1), largely limiting the area for presenting AR visualizations.", "While the recently announced HoloLens v2 is estimated to have a 29 vertical FOV, it is still much smaller than that of a typically-sighted human (120 vertical FOV).", "With the limited vertical FOV, the highlight design on projection-based AR would not work well for the smartglasses.", "To see the highlight on the current stair (Figure 5a), a user would have to look nearly straight down to her feet (Figure 5b), hindering her ability to see her surroundings.", "This can be potentially dangerous and is physically strenuous.", "As such, our visualizations aim to facilitate a comfortable head pose by indicating the users exact location on the stairs without augmenting the stairs directly.", "Social Acceptance.", "Most participants were not concerned about projecting highlights on stairs.", "They felt this technology was cool and could even be beneficial for people who are sighted, for example, in dark environments.", "P11 regarded the prototype as an identity tool (similar with the identity cane), which could indicate her disability to others, so that other people wont bump into her on stairs.", "Only P6 and P9 were concerned that this technology might scare others and draw too much attention to themselves.", "They preferred devices, such as smartglasses, that would show the visualizations only to them.", "Psychological Security.", "Our visualizations improved participants psychological security when walking on stairs.", "Participants all gave high scores to their psychological security when using our prototype ( mean =6.6, SD =0.67), as shown in Figure 4.", "They all felt more confident and safer when navigating stairs with the projected visualizations.", "P6 and P8 also said that the visualizations reduced their visual effort, so that they could look at the surroundings ( e.g ., other people and obstacles on the stairs), which also helped them feel safe.", "Behavior Change .", "Based on our observations of the walking tasks, some participants ( e.g ., P9, P4) looked down less when using our design since they could use their lower peripheral vision to notice the highlights.", "As P9 mentioned, I know mentally Im looking in the bottom field of vision, even though Im looking straight aheadThe [highlight] stands out very bright and my peripheral catches it, it catches blue, it catches the yellowWithout the system, I have to stare a lot more at the stairs and, I have to look a little bit extra to make sure that that is really the last step.", "The second platform we explored was optical see-through smartglasses.", "They present information only to the user and do not need to project onto a physical surface [88].", "Today, this platform is more readily available than projection-based AR.", "Beyond smartglasses prototypes developed by researchers [9, 42, 43], many early versions of products, such as Microsoft HoloLens [55] and Magic Leap One [49], mark a trend towards mainstream smartglasses devices.", "Some participants ( e.g ., P6, P3, P11) hesitated at the first and last stairs and felt the stairs with their feet when walking without our visualizations (especially in the first two trials of the walking tasks).", "When using our visualizations, they stopped feeling the stairs with their feet.", "Some participants ( e.g ., P7, P11) walked without holding the railing when using our visualizations.", "P10 also changed how he balanced his body when using our prototype: without our design, he walked down leaning his left shoulder forward instead of facing forward.", "He explained:", "Walking Time.", "Our visualizations reduced the time participants spent during stair navigation.", "For descending stairs, participants navigation time was reduced by 6.42% when using their preferred visualizations ( mean =6.17s, SD =1.93s) than when not using them ( mean =6.59s, SD =2.03s).", "With a paired t -test, we found a considerable trend towards significance when evaluating the effect of Condition on the time walking downstairs ( t 11 =-2.131, p =0.0565) with an effect size of 0.615 (Cohens d ).", "P11 remarked on the increase in her speed: This is the fastest Ive used stairs ever! You dont understand, this is like Im back to being me!", "For ascending stairs, participants navigation time was reduced by 5.78% when using their preferred visualizations ( mean =5.84s, SD =1.59s) than when not using them ( mean =6.20s, SD =1.81s).", "With a paired t -test, we also found a trend towards significant effect of Condition on the time walking upstairs ( t 11 =1.9894, p =0.0721).", "I noticed when [I walked] without the [highlights], Im walking more down on my side when descending the stairs. In case if I fall, then I fall at least more on my side as opposed to falling forward. With the [highlights] on, I was walking more straight down. I feel a lot more confident (P10) .", "Meanwhile, four participants felt that the middle highlights should be a different color from the end highlights.", "Three participants liked the blue color since its not as attracting as yellow but still sticks out (P9).", "No one liked the dull yellow since it was too subtle.", "One participant wanted red.", "P6 was the only one who did not want the middle highlights.", "She felt it unnecessary since the she could walk on stairs knowing the position of the first stair and the number of stairs (she counted stairs).", "The middle highlights distracted her from seeing her surroundings.", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "Session 3B: Accessibility", "We conducted a user study to evaluate the visualizations we designed for commercial smartglasses.", "We aim to answer:", "According to Zhao et al .", "s study, knowing when the stairs start and end can help PLV plan their steps, while the middle stairs are less important because most stairs are uniform [86].", "Thus, to better inform the user of their position on the stairs, we distinguish a users position on a set of stairs based on how close she is to a change in her step pattern.", "This change can involve stepping down for the first time after walking on a flat surface or stepping on a flat surface after stepping down repeatedly.", "We provide feedback to indicate that a change is approaching, and then that the change is about to occur.", "Similar to projection-based AR, when the user stands on the landing, our system verbally notifies the user of the existence of the stairs with stair direction and the number of stairs.", "Specifically, the following are the seven stages we used in our design, described for descending stairs as an example (Figure 6): (1) Upper landing: the flat surface that is more than 3' away from the edge of the top stair; (2) Upper preparation area: 1.5'3' away from the top stair edge where the person should prepare to step down; (3) Upper alert area: within 1.5' from the top stair edge where the persons next step would be stepping down; (4) Middle stairs: between the edge of the top stair and the edge of the second-to-last stair, where the person is stepping down repeatedly; (5) Lower preparation area: the last stair, where the person is one step away from the flat surface and should prepare for the imminent flat surface; (6) Lower alert area: within 1.5' from the last stair edge on the landing where the persons next step is on the flat surface (not stepping down); (7) Lower landing: 1.5' away from the last stair edge where the person is walking on flat surface again.", "Our visualizations inform PLV of the different stair stages via different design.", "We design two visualizations and one sonification.", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "(1) Glow visualization (Figure 7ad): We generate a glow effect at the bottom of the display to simulate the experience of seeing the edge highlights on the stairs with peripheral vision.", "Unlike the highlights that are attached to the stair edges, the glow is always at the bottom of the vertical FOV, so that", "Procedure.", "The study consisted of a single session that lasted about 1.52 hours.", "An initial interview asked about demographics, visual condition, and use of tools when navigating stairs.", "Next, a licensed optometrist on the team conducted a confrontation visual field test and a visual acuity test using a Snellen chart (Table 1).", "We then gave the HoloLens to the participant and explained how to use it.", "After the participant put on the HoloLens, the optometrist tested her visual field and visual acuity again to measure the effect of the HoloLens on the participants visual ability.", "We continued the study with a design exploration session and a stair navigation session.", "brightly lit and open environment.", "Participants performed two stair navigation tasks: walking upstairs and walking downstairs.", "They conducted each task in three conditions: (1) walking on the stairs as they typically would (they could use a cane if desired, but none chose to use it), (2) walking on the stairs with HoloLens and no visualizations, and (3) walking on the stairs with HoloLens and their chosen designs.", "Each task in each condition was repeated five times.", "We conducted the design exploration session at an emergency staircase with 12 stairs (different stairs than those in the projection study).", "Participants wore the HoloLens and experienced four different designs: Glow, Path, Beep, and Edge Highlights as a baseline.", "Participants were allowed to walk up and down the stairs to experience the design in-situ.", "They thought aloud, talking about whether or not they liked the design, whether the design distracted them, and how they wanted to improve it.", "We counterbalanced by randomizing the presentation order of the four designs.", "After the participant experienced all the design alternatives, we asked for their preferred combination.", "To minimize the confounding effect of general computer vision accuracy, we marked the position of the stairs with two Vuforia image targets [37] (on the side walls at the top and bottom landing of the stairs) that can be recognized by HoloLens.", "This provided an anchor in the environment, which enabled our application to determine the position of the user on the stairs by tracking the motion of the HoloLens, improving the accuracy of our visualizations and sonification.", "Experience with the Smartglasses .", "We first report the effect of the HoloLens on participants visual abilities.", "Some participants appreciated the tinted optics because they blocked environmental glare.", "Three participants visual acuity improved when wearing the HoloLens (P14: from 20/140 to 20/100, P7: from 20/400 to 20/200, P15: from 20/200 to 20/140).", "However, P12 experienced a decrease in visual acuity (from 20/200 to 20/400).", "It is possible that the tint of the HoloLens made the environment too dark for him to see.", "We analyzed the effect of our visualizations on participants walking time when navigating stairs.", "Our experiment had one within-subject factor, Condition (No HoloLens; HoloLens w/o visualizations; Visualizations), and one measure, Time .", "We defined a Trial (15) as one walking task.", "We determined Time from the video we recorded during the study.", "When analyzing data, we removed the first trial, treating it as a practice trial for participants to get used to the HoloLens.", "The study ended with a final interview asking about the participants general experience with the prototype.", "We asked them to score the usefulness and comfort level of the prototype on a Likert scale, as well as their psychological security when using the prototype, ranging from 1 (strongly negative) to 7 (strongly positive).", "Apparatus.", "We built our prototype on Microsoft HoloLens v1.", "We chose HoloLens because of its FOV (~34 diagonal), binocular displays, and ability to be worn with eyeglasses.", "Many lightweight smartglasses have only one display in front of the right eye ( e.g ., Google Glass, North Focals), and are unusable for PLV with vision only in the left eye.", "Other options either have a smaller FOV ( e.g ., Epson Moverio BT300, 23 diagonal) or cannot be used with eyeglasses ( e.g ., Magic Leap One).", "Participants.", "We recruited 12 PLV (5 female, 7 male; mean age=51.6) with different low vision conditions (Table 1, P6 P17).", "All participants were legally blind.", "Seven participants had taken part in the evaluation of our projection-based AR visualizations, but they did not see the stairs used in this study.", "We followed the same recruitment procedures as in the previous study.", "We indicated the start and end points on the stairs with stickers that were three feet away from the top and bottom steps on the landings.", "For each task, the participant stood at the starting point and started when the researcher said, Start.", "The task ended when both her feet first arrived at the landing.", "Participants were asked to walk as quickly and safely as possible during the task.", "We recorded the time for each task.", "To validate counterbalancing, we added another betweensubject factor, Order (six levels based on the three conditions), into our model.", "An ANOVA found no significant effect of Order on walking time (downstairs: F (5,6) =0.35, p =0.338; upstairs: F (5,6) =0.445, p =0.804) and no significant effect of the interaction between Order and Condition on walking time (downstairs: F (10,12) =1.418, p =0.280, upstairs: F (10, 12) =0.535, p =0.835).", "The stair navigation session was conducted at another staircase with 14 stairsa wider set of access stairs in a more", "To reduce the effect of order on the results, we used a simultaneous within-subjects design by switching the task condition after each round of walking up and down.", "We also counterbalanced the starting task (up/down) and the conditions.", "We analyzed participants qualitative responses with the same method we used in the previous study.", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "Session 3B: Accessibility", "On the other hand, P17 felt that Beep may not be distinguishable from environmental sounds: The world around you is so full of noise. I mean, if I use this in the city you have cars honking and everything like that, Im not sure if I would react in time.", "P8 and P14 voiced the same concern about environmental noise but explained that along with the visualizations the sound would be recognizable.", "Nevertheless, some participants ( e.g ., P6, P10, P13) felt this design was helpful because it provided a preview for future steps, especially when they looked downstairs from the top landing.", "Interestingly, P10 mentioned that he could combine his own vision (that is not covered by the HoloLens) with the Edge Highlights.", "He didnt feel the need to look down all the time because he has good peripheral vision to see the stairs, and he could use the Edge Highlights on the HoloLens to prepare for future steps and verify the last step.", "Moreover, some participants ( e.g ., P10, P12, P17) mentioned that the blue glow on the middle stairs was difficult to notice, especially in the bright environment for the walking tasks.", "Not seeing the glow on the middle stairs distracted the participants and made them feel uncertain about the stairs.", "As P10 mentioned, I want more information while Im going down the stairs, The yellow color was helpful to let me know", "This one is my kind of style. Its subtle, simple, and I can keep my head wherever I want at the same time. And [the color of the Glow] changes exactly when I need to step. It warns me when Im about to take my last step Its very discreet but not distracting. So Ill still be able to see people, and things around me without falling over steps. If my real glasses could do this, it would be good.", "terms of visual field, no participants experienced a change while wearing the HoloLens.", "All participants mentioned the heaviness of the hardware, which potentially impacted their experience negatively.", "that Im at the last step...but I didnt really see that [blue glow in the middle], I need to be reassured that Im still going down the stairs.", "P17 slowed down as she struggled to see the blue glow when completing the walking tasks.", "Interestingly, we found that participants had different preferences for Paths position in their visual field.", "Many ( e.g ., P12, P16) adjusted Path to a position where their vision was best.", "Meanwhile, others adjusted it to a position that they felt was the most intuitive to comprehend.", "For example, P9 and P15 adjusted Path so that it was in the center of their vision and that they could use it in a similar fashion to a GPS guide.", "P14 moved Path lower so he can more easily associate the virtual Path to the real staircase.", "As he said, [Path] would be my favorite if we were able to get it to [get close] to the stairs instead hanging up in the middle of everything.", "However, two participants (P6, P14) had difficulty using Glow because of difficulty distinguishing colors.", "P14 doesnt have color vision, while P6s visual condition included auras of various colors that interfere with the colors of Glow.", "Most participants found Glow helpful and easy to understand.", "They felt the different colors can effectively inform them of their stage on the stairs, and the thicker and brighter glow colors at the preparation and alert area successfully attracted their attention.", "Moreover, participants enjoyed the freedom to move their head in any direction while still being able to see Glow.", "This enabled them to better explore their surroundings and still be visually alerted about the stairs without looking down.", "P9 described his experience:", "(1) Edge Highlights (Baseline).", "Most participants found it difficult to use the Edge Highlights because of the limited vertical FOV.", "Participants had to angle their head down a lot to see the highlight on the current stair.", "They found it uncomfortable and unsafe to maintain that posture on the stairs, especially when walking down.", "P9 reported that, To continue seeing everything, my head has to be completely [down], my chin is touching my chest.", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "Session 3B: Accessibility", "report participants feedback on each design alternative.", "Effectiveness of the visualizations (and sonification) .", "Half of the participants indicated that Path could be helpful.", "They mentioned that Path gave them a clear overview of the stair trends, specifically where the stairs start and end.", "P13 described his impression, This is perfect because if Im coming to the stairs, looking at the stairs and I wont have to look down, I immediately know where [the stair] begins and where it ends, as soon as my head turns to the [Path].", "P8 also felt Path could guide him along the stairs: Its like a reinforced railing but its also like a guide [showing] where Im stepping. Its like a good reference. I kinda like to have the guide.", "Moreover, three participants ( e.g ., P6, P9, P13) interpreted Path as a reminder to look for the physical railing.", "Behavior Change .", "Our design changed peoples behaviors when walking on stairs.", "Two participants (P8, P15) walked without holding the railing when using their preferred visualizations.", "Moreover, we tracked participants head orientation with HoloLens during the walking tasks, and found that some participants ( e.g ., P6, P9) head orientation changed when using our visualizations.", "For example, Figure 10 shows the head forward angle of P9 on each stair stage when walking downstairs with and without the visualizations.", "tions on PLVs walking time.", "We found that theres no significant effect of Condition (HoloLens with visualizations vs. HoloLens without visualizations) on participants walking time for both ascending ( F (1,10) =0.466, p =0.511) and descending stairs ( F (1,10) =0.114, p =0.742).", "Four participants (P6, P8, P12, P17) slowed down a little on ascending stairs with the visualizations, while five participants (P6, P13, P12, P16, P17) slowed down on descending stairs with their preferred visualizations.", "Except for P17, who slowed down a lot when walking downstairs with our visualizations, all other participants times increased by less than 1 second.", "We investigated and found that P17 had a hard time seeing the blue glow on middle stairs in the bright environment.", "She slowed down and struggled to see the blue glow during walking tasks.", "Participants gave scores to their psychological security during stair navigation in three conditions (Figure 9): (1) walking as they typically would ( mean =4.8, SD =1.60); (2) with HoloLens but no visualizations ( mean =3.9, SD =1.44); (3) with preferred visualizations or sonification ( mean =6.1, SD =1.38).", "Paired Wilcoxon Signed-Rank tests showed that, while wearing HoloLens significantly reduced participants psychological security ( V =8, p =0.031), our visualizations significantly increased participant psychological security compared with not wearing HoloLens ( V =21, p =0.050).", "We found that most participants (10 out of 12) combined a visualization with a sonification (Beep).", "While they all mentioned that visualizations were more effective than audio feedback and used the visualization as a primary guide, participants also appreciated the beep and used it as a secondary complement to the visualizations.", "As P12 said, Actually I liked [Glow] more with the audio [Beep]. They augment each other. I found it to be more useful together than separate.", "Only two participants did not combine the visualization with the sonification: P7 used audio alone, and P17 used Glow alone.", "The most commonly chosen visualization was Glow, which was preferred by eight participants.", "One participant (P14) chose Path, while two participants (P6 and P10) chose Edge Highlights.", "P13 combined all four designs because he used each design for different purposes: Path as a reminder to look for a railing, Edge Highlights to get an overview of the stairs, and Glow when walking on stairs and scanning the environment for people or obstacles.", "Psychological Security.", "While there is no significant improvement in walking speed when using the visualizations, participants reported feeling safer and more confident when using our design.", "P11 described her experience when using our prototype, I love the fact that the [visualizations] are there. Once you understand what they mean, you can actually move more confidently I would be very safe instead of falling down and kicking things.", "Walking Time.", "In the walking tasks, the HoloLens itself had a big impact on participants walking time when navigating descending stairs.", "With ANOVA, we found that participants walking time significantly increased when they walked downstairs wearing the HoloLens whether using our visualizations or not ( F (2,12) =8.783, p =0.0045).", "However, when walking upstairs, there was no significant effect of Condition on participants walking time ( F (2,10) =2.924, p =0.092).", "Since navigating descending stairs is more challenging, wearing a new device can more easily affect peoples walking speed.", "With the condition of wearing HoloLens without visualizations as the baseline, we analyzed the effect of our visualiza-", "In general, participants felt that our prototype was helpful, especially in unfamiliar places.", "They gave high scores ( mean =5.8, SD =1.65) for the usefulness of their preferred visualizations and sonification.", "They also felt the visualizations were comfortable to see ( mean =5.6, SD =1.73), as shown in Figure 9.", "Preferences for visualizations (and sonification).", "Participants combined different visualizations and sonification based on their preferences, as shown in Figure 8.", "The system implementation should also take into account different real-world situations.", "Our evaluation was conducted indoors, with no other people around.", "However, the real world could be much more complicated, raising all kinds of challenges.", "For example, AR visualizations could be less visible outdoors, crowded stairs could diminish the accuracy of the stair recognition because the stair edges are blocked, and the projected highlights may also disturb other people.", "In future work, we will consider these real-world challenges when developing AR stair navigation systems.", "For example, besides recognizing stairs with computer vision, we will consider instrumenting the environment ( e.g ., using RFID) to foster accurate and fast stair recognition in a complex environment.", "We will also add face detection to avoid projecting in bystanders faces.", "Participants had some common choices on the visualizations on each platform.", "For projection-based AR, the stable thick yellow highlights on first and last stairs were the most preferred (7/12).", "For highlights on middle stairs, most participants (7/12) preferred the most visible yellow highlights instead of blue or dull yellow ones.", "For HoloLens, most participants (6/12) chose the combination of Glow and Beep.", "Unlike prior research, which showed that PLV had very different preferences for visual augmentations [84, 85], our study revealed that some common preferences among PLV cross different visual abilities for stair navigation.", "This can potentially set a foundation for future visualization design for stair navigation and more general navigation systems.", "As with any study, ours had some limitations.", "First, the HoloLenss weight strongly diminished PLVs experiences, which may have influenced our results.", "Future studies should refine and evaluate the design on more lightweight smartglasses.", "Second, because of the extreme head pitch required to view the closest stairs caused by the small vertical FOV of", "Our research is the first to explore AR visualizations for people with low vision in the context of stair navigation.", "Our studies demonstrate the effectiveness of our designs with both projection-based AR and smartglasses.", "We found that our visualizations on both platforms largely increased peoples psychological security, making them feel confident and safe when walking on stairs.", "Moreover, the visualizations on projection-based AR showed a trend towards significantly reducing PLVs walking time on stairs.", "We compared users experiences with the visualizations on both platforms given that seven participated in both studies.", "Most PLV ( e.g ., P10, P12) felt that the visualizations on projection-based AR were easier to use than those on the smartglasses.", "The highlights on projection AR were intuitive to perceive because they directly enhance the stair edges that participants were looking for.", "Meanwhile, the design on smartglasses, especially Glow and Beep, proposed a new way to perceive stairs: it divided the stairs into different stages, providing only immediate information about the current stair without a preview of whats to come.", "This new stair perception method increased participants cognitive load, because they had to associate the design with the physical stairs, making them more cautious.", "This could be one major reason why PLVs walking time did not improve when using smartglasses.", "P12 compared his experiences with the two", "While our study focused on the design and evaluation of the AR visualizations, we discuss the technical feasibility and challenges for our AR stair navigation systems.", "The implementation of such a system could be challenging.", "For such a dangerous task as stair navigation, the navigation system should be highly accurate and fast since a small error could lead to severe consequences ( e.g ., a slight shift of the edge highlight could make the user fall).", "The system also needs to tolerate the users body ( e.g ., hand, head) movement when walking on stairs, which requires a tradeoff between speed and stabilization.", "While many stair detection methods have been presented in prior research [20, 58], algorithms that locate the exact position of each stair with high speed and accuracy should be investigated and tested to support the stair visualization systems we designed for PLV.", "platforms, The first experience [projection-based AR] gave me a better sense of a direction as to where this was goingBut the [glow] was like floating over the steps, and they didnt stay fixed in place. That was one big difference. I like the light fixed on the step.", "that, he looked much further down to the stairs when not using our visualizations, especially at the beginning and the end of the stairs ( e.g ., preparation area, alert area).", "In this paper, we designed AR visualizations to facilitate stair navigation for people with low vision.", "We designed visualizations (and sonification) for both projection-based AR and smartglasses based on the different characteristics of these platforms.", "We evaluated the design on each platform with 12 participants, finding that both visualizations increased participants psychological security, making them feel safer and more confident when walking on stairs.", "Moreover, our design for projection-based AR showed a trend towards significantly reducing participants walking time on stairs.", "the HoloLens, we designed visualizations in the users central vision instead of adding highlights to the stairs in our smartglasses prototype.", "More data could be collected to quantify the head pitch angle to determine an effective vertical FOV that allows PLV to use the stair highlights with a comfortable head pose.", "Third, we asked participants to score their feeling of psychological security, but these results could be influenced by a novelty effect.", "Future research should consider more objective measurements ( e.g ., biometrics) to evaluate psychological security.", "This work was supported in part by the National Science Foundation under grant no.", "IIS-1657315.", "Feiner was funded in part by the National Science Foundation under grant no.", "IIS-1514429.", "Session 3B: Accessibility", "ACKNOWLEDGMENTS", "Session 3B: Accessibility", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "Session 3B: Accessibility", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "the user can hold their head at a comfortable angle and does not need to look down to see the glow.", "We adjust the glow color and size to inform the user of their current stage on the stairs:", "Landing stages: thin red glow to indicate the flat surface.", "Preparation stages: thick cyan glow, telling users to prepare for the first surface level change or the end of surface level changes.", "Alert stages: thick yellow glow, indicating that the next step is the first surface level change or the end of surface level changes.", "Middle stairs: thin blue steps to indicate the middle stairs.", "Start landing stage: no sound.", "Preparation stages: low-frequency beep, indicating users should prepare for the first surface level change or the end of surface level changes.", "Alert stages: high-frequency beep, indicating that the next step is the first surface level change or the end of surface level changes.", "Middle stairs: no sound.", "End landing stage: audio description that verbally reports Stair ends.", "(2) Path visualization (Figure 7eg): Inspired by the railings, which PLV used as a visual cue to see where the stairs start and end [86], we designed this visualization to show the trend of the stairs.", "The direction of the Path follows the stairs: it goes straight forward along the landing, turns down (or up) along the slope of the descending (or ascending) stairs, and goes straight forward again when arriving at the landing.", "The Path is generated at the users eye level with a fixed distance from one side of the head (we adjusted its specific position based on the users visual field and preference), making sure that they can see it without looking too far down.", "The user can thus observe the start and end of the stairs by looking at the turning points of the Path.", "To better distinguish the landing and the stairs, we colored the straight part of the visualization (over the landing) yellow and the slope blue.", "We added virtual pillars to connect the Path to each stair to help users associate the visualization with the physical stairs.", "(3) Beep sonification: This sonification informs users of their current position on the stairs.", "Similar to glow, we adjusted the sound based on the different stages of the stairs:", "(1) How do PLV perceive the visualizations on smartglasses?", "(2) How effective are the visualizations for stair navigation?", "(3) How secure do PLV feel when using our visualizations?", "However, half of the participants felt Path was distracting and hard to understand.", "P6 even felt it was misleading to have a virtual railing (Path) in a different place than the real railing because it changed her perception of the width of the staircase: It suggests that there is a railing and then I feel I have a very narrow staircase (P6).", "(4) Beep .", "All participants except for P17 felt Beep was helpful.", "P6 thought it could reduce cognitive load and enable her to see the surroundings.", "As she said, Its really interesting. The more often I use it, the more I like the [Beep] I dont have to watch out for visual [information] of the stairs. With the audio, I just look at the [surrounding] or look at people in front of me and I dont have to worry about [the stairs]. Thats actually easier.", "P14 also felt Beep could be a good compensation when the visualizations are not visible in bright environment."]}
