{"paper_id": "uist-6", "sentences": ["By exploiting the deformability of the skin, Skin-On interfaces provide novel input capabilities and haptic feedback that the users are familiar with.", "By mimicking real human skin, SkinOn interfaces can also better communicate the interactivity of these systems and facilitate the discoverability of gestures, which in turn enhances interaction.", "For instance, the back of a mobile device could be covered with articial skin that can sense novel user gestures (e.g. grab, twist, scratch, etc.) and provide tactile and kinesthetic feedback in order to enhance user expressiveness and user experience for mediated communication or interface control.", "Skin is a fundamental biological interface to sense the world and communicate with others [33].", "Its properties (e.g. size, stretchability, etc.) motivated HCI researchers to develop OnSkin technologies to allow users to interact directly with their own skin [30, 59, 101].", "In this paper, we share the same vision than On-skin interaction, which builds on the advantages of the skin to increase interaction bandwidth.", "However, we argue that the benets of human skin should not only be used for Onskin interfaces but also for what we call Skin-On interfaces.", "Skin-On interfaces consist of augmenting interactive systems with articial skin, e.g. by replacing their rigid cover.", "Our approach augments I/O capabilities of interactive systems with new gestures and rich kinesthetic feedback.", "There is a long history of research into the design of articial skin in the eld of Robotics, either to help with environment exploration, or to endow robots with human-like sensing capabilities [5, 13, 48, 94].", "Articial skin is however usually designed with aesthetic and safety requirements in mind, rather than for harvesting interactive properties of the skin that are specically useful for human-computer interaction.", "Our work contributes towards this direction.", "Author Keywords", "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for prot or commercial advantage and that copies bear this notice and the full citation on the rst page.", "Copyrights for components of this work owned by others than the author(s) must be honored.", "Abstracting with credit is permitted.", "To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specic permission and/or a fee.", "Request permissions from permissions@acm.org.", "2019 Copyright held by the owner/author(s).", "Publication rights licensed to ACM.", "ISBN 978-1-4503-6816-2/19/10..", "UIST 19 , October 2023, 2019, New Orleans, LA, USA", "CCS Concepts", "Many researchers have explored the design of exible input although these studies did not use human skin as inspiration.", "For instance, some studies proposed to sense bending deformations in exible interactive devices [79, 53, 70, 89].", "In those cases, the materials used are still rigid and do not allow for complex gestures such as stretching or pressure.", "Using fabric material can alleviate this drawback and allow for detecting stretching [23].", "Parzer et al.", "[64] demonstrate that it is possible to detect different touch pressures by using resisting fabric materials [75], but their surface texture does not look or feel like skin, which impairs visual and tactile perception.", "We present an exploration of the design space of Skin-On interfaces.", "In particular, we follow a bio-driven approach where we take inspiration from the human skin to design this new type of interfaces.", "Bio-inspired research is common in elds such as Robotics or Material Engineering, where it aims to abstract principles and structures from nature (e.g. mechanical abilities) to create new materials [63, 14].", "Our approach shares similar goals, seeking to reproduce the sensing capabilities of biological skin, but it also goes beyond the typical bio-inspired approach by focusing on interactive aspects, which we believe are crucial for human-computer interfaces:", "where users interact with their own skin.", "The challenge of OnSkin technologies is to maintain the physiological functions (e.g. thermal regulation) and interactive properties (e.g. strechability) of the end-user skin.", "One approach consists of using thin epidermal overlays (< 50 ) [29, 42] embedding resistive [99] or capacitive sensors.", "These overlays sense touch [41], multi-touch [59] or pressure [4] but can only be placed on top of the skin, and have not been designed for a repeated amount of stretch and strain.", "Another approach to implement On-skin interfaces without the need for additional overlays is to use optical tracking to detect gestures directly on the user skin [15, 30, 101, 87, 97, 28, 50, 61].", "This allows users to benet fully from the haptic properties of the skin even if the tracking is less accurate than with a thin sensing overlay.", "Our work relates to on-skin interfaces in HCI, articial skin in robotics and exible input sensors.", "In summary, designing articial skin has thus been largely studied in the eld of Robotic, but with a focus in reproducing the sensing capability of the skin [14] or its visual aspects [62] for safety, sensing or cosmetic aspects.", "However, previous studies on articial skin did not consider the hypodermis layer (fat).", "Because of its thickness, this layer enables new gestures (e.g. squeeze) and provides kinaesthetic feedback.", "We are not aware of any research looking at exploiting realistic articial skin as a new input method for interactive devices.", "We assemble the insights from these three steps and present the implementation of several Skin-On interfaces and applications to demonstrate the added value of our approach (see Figure 1 for examples).", "We believe our work extends the boundary of traditional interactive devices by opening up the user experience to anthropomorphic interfaces and to new familiar organic interaction between humans and machines.", "This work also explores the intersection between man and machine (human augmentation) from a new perspective: Instead of augmenting the human with parts of machines, we demonstrate how machines can be augmented with parts of human.", "Additionally, bio-driven approaches are not mainstream in HCI research, and this study presents a new research method to create devices with novel form factors that could be suitable for areas of research such as Shape Changing Interfaces [2] [43] or Organic User Interfaces [34].", "In this paper we considered one aspect (skin) but we hope our work will inspire researchers to investigate how interfaces can be designed to integrate elements from nature.", "In Robotics, an  articial sensitive skin  [55] imitates the sensing capabilities of human skin.", "Several exhaustive surveys of state-of-the-art in articial sensitive skin have been presented [82, 48, 5, 94, 13] that clustered applications for articial skin into two main categories.", "The rst type of application is to use articial skin to augment robot end-effectors to explore objects or interact with them [96, 90].", "In such cases, the goal is to replicate the sensing capability of the human ngertip [35, 108, 104].", "The articial skin sensors generally have a high spatial resolution (1 mm  4 mm ) but cover only small surfaces ( 2 cm ).", "The second type of application is to use articial skin to cover the surface of a robot to improve motion guidance and environment sensing [5] as a means to increase human likeness, as well as to encourage contact with end-users [3] or to replicate the camouaging capabilities of natural cephalopods [66, 76].", "On-Skin or Skin-worn interfaces harness the human skin properties to create new forms of on-body interactions [50, 30, 28]", "In summary, like On-Skin interfaces, Skin-On interfaces also aim to use the affordances of human skin.", "However we do not focus on interacting directly on human skin but rather aim at mimicking its properties to augment interactive devices.", "To go further in the direction of deformable material, some works use silicone or PDMS layers.", "This is the case of Stretchis [103], which provides a fabrication process of a highly stretchable interface with stretch sensing.", "Dielectric elastomers, which are elastic parallel-plate capacitors, can act as deformable sensors for measuring human body motion [60].", "Other techniques to sense input on a stretchable surface also include Electro-Impedence-Tomography [81] or Time Domain Reectometry [105], which are other techniques for detecting stretch and touch.", "To better understand which are the desirable properties of the human skin to reproduce within articial skin, we looked through the Biology literature [20, 36, 38] and gathered information about the visual, haptic and sensing properties of the skin (described below).", "We excluded properties related to biological features out of scope of this work such as the semi-impermeable barrier (useful for both uid excretion and absorption), the anatomical barrier (preventing pathogens or preventing external damage), heat regulation, and storage (e.g. for vitamin D synthesis).", "We also only focused on input rather than output (e.g. self-lubrication, actuation of hair follicles or temperature) that we discuss in the future work section.", "These studies rely on using a relatively thin layer for sensing deformations and some other researchers have proposed to add thickness to sensors to enrich the vocabulary of gestures.", "For example Follmer et al.", "[22, 31] use exible substrate such as Silicone or PDMS to provide a malleable input surface that can be used to detect stretching, bending and twisting using capacitive sensors.", "Some other work use foam to provide additional thickness to the sensor [83, 58, 10].", "Such sensors detect pressure but the foam is hardly stretchable and prevent more complex gestures such as stretching or twisting.", "The skin is about 1.7 m 2 in area and approximately 4 kg in weight, thus accounting for about 5.5% of body mass.", "It is divided into three primary layers [20]:", "Skin-On interfaces augment interactive systems (e.g. smartphones) with an articial skin.", "To design the articial skin, we propose a bio-driven approach (illustrated in Figure 2) aiming to replicate the main properties of the human skin.", "It is thus crucial to rst understand the biology of the human skin to identify its unique properties.", "We then use this knowledge to dene the most suitable material for creating articial skin.", "In summary, there have been some research aiming at creating deformable sensors, but none has looked at the skin for inspiration; moreover the gestures these sensors can detect are limited to particular ones (e.g. bending but no stretching, stretching with no pressure, or pressure deformation but no stretching etc.).", "It is also worth mentioning that some researchers have proposed to augment everyday life objects (particularly non-interactive ones) [109, 110, 27] but these objects are rigid.", "Our goal is to replicate the three layers of the human skin: The epidermis layer provides both visual and tactile perception (e.g. texture); The dermis layer is the sensory layer embedding nerves to detect mechanical contact; The hypodermis layer provides kinesthetic feedback due to its soft mechanical properties (viscosity, thickness, etc.).", "SKIN-ON INTERFACES: A BIO-DRIVEN APPROACH", "The results are illustrated on Figure 4-top.", "Non-parametric Friedman tests were conducted followed by post hoc comparison tests for all the questions asked.", "An effect was found on the following questions: interactive (Chi-square = 13.6, p<0.05) and looks like human (Chi-square = 36, p<0.05).", "The results suggest that the two human skin colors (beige and brown) better communicate interactivity than the others (p<0.05), in particular the usual white/black device pigmentation.", "They also conrm that beige and brown pigmentation signicantly (p<0.05) increases the skin human-likeness in comparison with the other samples.", "The result of the anthropomorphism questionnaire (Figure 4-bottom) indicates that beige and brown", "Our exploration into simulating human skin properties starts with the replication of its sensory properties.", "Because these properties have a large range of values, we choose to look at the question under a different angle: how to reproduce the skin so it is valuable for interaction as well.", "We particularly look at the pigmentation , texture and strain/thickness in three studies, that helped guiding the design of our articial skin.", "The fabrication of each sample follows the same process: A preparation of pigmented silicone is poured in a textured mold (80x40mm) with an even thickness.", "Once set, the silicone is cured a 90  for 5 minutes with a heat gun.", "After, we pour an even layer of Ecoex Gel, and let it cool at room temperature for 2 hours before removing the sample from its mold.", "While Silicone is the best available approximation of human skin, it is unclear, in an interaction context, whether similarity to human skin is the most important factor.", "For example it is possible that replicating the exact color of human skin may not be ideal because the human likeness is tight to the Uncanny Valley effect [56] and can elicit feelings of eeriness and revulsion in observers.", "Black or White colors (representative of usual device colors) might be more relevant for communicating interactivity.", "It is also unclear which texture , and which thickness is the most appropriate for interaction (as users may prefer interacting with thick viscous layers).", "All these questions sparked our interest in understanding how to adapt articial skin to our interactive context.", "We address these points in the following section through three user studies.", "Figure 3 illustrates the ve types of pigmentation compared: beige and brown colors representative of realistic human skin colors; white and black colors representative of usual device colors; green color to suggest something organic, but not necessarily human (e.g. alien or reptilian).", "Moving on to reproducing the properties of the skin described above, we looked at common material used in other elds of research.", "Silicone has been proven to be a well suited material to reproduce the three layers of the skin (Figure 2).", "This material is for example used to create skin simulators for medical training [40, 86, 12] because of its mechanical properties.", "It is also used in the movie industry to create props and special esh-like prosthetic effects for its texture and pigmentation.", "Silicone thus appears as a promising material to reproduce skin properties within Skin-on interfaces.", "We recruited 15 participants (10 males, mean age 21) from our university to test each sample.", "The order of presentation of the samples was counter-balanced between participants using a Latin-Square design and a session lasted around 10 minutes.", "For each sample, participants indicated their levels of agreement regarding the three following afrmations, using a 5-point Likert scale: This interface looks like an interactive device ; This surface looks like human skin ; It looks comfortable touching this surface .", "We also asked participants to rate their impressions about the samples according to the following scales: fake/natural , machinelike/humanlike , articial/lifelike , which are often used to assess anthropomorphism [9].", "We use different silicone products from Smooth-On Inc to reproduce the skin properties listed above.", "In particular, we use DragonSkin Pro-FX [84] platinum cured silicone to create the epidermis and dermis layers.", "We combine it with Silc pig pigments for the pigmentation and mould strategies (using Mold Start) for generating specic textures.", "We use Ecoex Gel [85] for the hypodermis layer where we can manipulate its thickness and strain, a highly soft and exible silicone presenting mechanical properties close to human fat [98, 25].", "Our rst experiment aims at understanding the impact of pigmentation on the perception of skin human-likeness and comfort, but also at detecting possible negative anthropomorphic effects.", "Study 1: Replicating pigmentation", "We study the impact of the strain/thickness on easiness and comfort of interaction, as well as human-likeness.", "Non-parametric Friedman tests were conducted followed by post hoc comparison tests for the questions asked.", "An effect was found for each: comfortable (Chi-square = 21.8, p<0.05); feels like human (Chi-square = 12.3, p<0.05); and looks like human (Chi-square = 18.6, p<0.05).", "The results (Figure 6) suggest that the exaggerated sample is less comfortable than the three others (p<0.05).", "They also conrm that the two realistic samples are perceived more alike skin than the two others both tactically (p<0.05) and visually (p<0.05).", "The main nding is that an appropriate skin-like texture seems important both for the comfort of interaction and human-likeness perception.", "In the next experiment, we use the texture with small pores.", "Figure 5 illustrates the four samples of texture we compared.", "We considered two realistic human skin samples (Fig.", "c) which varied both in term of the size of the pores and the depth of the wrinkles and looked like:", "(b) skin of the back with small pores and no wrinkles, and", "(c) skin of the hand with small pores and wrinkles.", "We also considered two less realistic samples: (a) very smooth skin without any pores and wrinkles, and (d) skin with exaggerated pores size and wrinkles.", "We study different surface textures to mimic wrinkles of different body locations.", "We compare their effect on comfort as well as the perception of skin human-likeness.", "Non-parametric Friedman tests were conducted followed by post hoc comparison tests for all the questions asked and found a main effect on the look alike question (chi-square = 7.4, p<0.05).", "Figure 8 illustrates the results.", "The sample with the thicker hypodermis layer was perceived as the less human like, as this value is usually present in body location not accessible for social touch, such as the belly (p<0.05).", "The design was similar to study 1.", "We recruited 16 participants (10 male, mean age 21) from our university.", "The experiment was divided into two phases: in the haptic phase, the task consisted of touching lightly the different samples without seeing them to avoid any bias of the beige pigmentation.", "After each sample, participants indicated their level of agreement about the two following afrmations using a 5-point Likert scale: Touching this surface feels comfortable ; This surface feels like human skin .", "In the visual phase the task was similar except that participants could only rely on the visual modality.", "The participants then indicated their level of agreement about this afrmation: This surface looks like human skin.", "We expected that the black and white colors would be perceived as more interactive because of their similarity with devices, but natural skin pigmentation was associated to a higher degree of interactivity.", "For the following, we keep the beige pigmentation and study different textures to investigate whether it can change the opinion of users regarding comfort.", "We used a similar design than previous studies.", "We recruited 16 participants (10 males, mean age 22) from our university.", "The task consisted of freely touching and manipulating each sample such as it was the skin of someone else.", "After each, participants indicated their level of agreement regarding the following afrmations with a 5-point Likert Scale: It was comfortable doing gestures on this sample ; It was easy doing gestures on this sample ; This surface feels like human skin .", "Figure 7 illustrates the four different skin thicknesses we compared.", "The thickness of the top layers (epidermis+dermis) is 1.2mm as it is the average value of the dermis over the body [49, 91].", "For the hypodermis thickness, we considered four values corresponding to different body areas: 2mm (face [74]), 5mm , 10mm (forearm [37]), 17mm (mean body [39]).", "Study 2: Replicating texture", "skin pigmentation provides a higher level of anthropomorphism than the other colors.", "Finally, the results did not suggest that the two human skin colors are perceived signicantly looking less comfortable than the other colors.", "Results of study 2", "We also had the opportunity to observe that users spontaneously performed these gestures during the studies.", "Participants demonstrated gestures such as pointing or rotating with two ngers, gestures similar to regular interfaces.", "However, the most frequent gestures were pulling the skin (pinching), stroking and slapping, which are skin-specic gestures.", "also shows that samples with a thicker layer are perceived slightly more comfortable and easier to interact or manipulate although this was not signicantly different.", "Participants naturally compared the 5mm and 10mm with their own skin (respectively hand and forearm) suggesting that these surfaces are the most successful at replicating these skin thickness.", "The last part of our exploration focuses on the reproduction of the human skin sensing acuity.", "We present different sensing techniques and discuss which ones are more adapted to mimic human skin.", "We then present our fabrication method and nish by presenting our hardware/software open toolkit that enables controlling the sensing layer, and demonstrate how we can detect the previously dened gestures.", "Our sensory exploration let us to form a series of guidelines for mimicking human skin for an interactive setup: for the pigmentation using a skin-like color; for the texture using a realistic skin pore and wrinkle structure; for the thickness , using a fat layer of 5mm to 10mm and a dermis of 1.2mm.", "We found that the human skin affords two main types of gestures: gestures of mediated communication between individuals from the social literature [33, 32] and traditional 2D multi-touch gestures, for interface control though extracted from On-Skin literature [100].", "Our design space (Figure 9) summarizes the gestures relevant for Skin-On interfaces.", "This list is not exhaustive and only represent gestures that are most often considered in the literature .", "Our results suggest that users tend to transpose the interactions they are doing with real skin to articial skin, and that articial skin leverages the expressive gestures and tactile expressions of pro-social emotions.", "Gestures with similar characteristics to conventional multi-touch devices and traditional input paradigms suggest that users transpose conventional multitouch gestures onto other interactive surfaces, like articial skin.", "So, we decided to build on the gestures illustrated in Figure 9 to dene the sensing capabilities of Skin-On interfaces.", "Discrete or matrix .", "A discrete layout means that the sensor is made of individual cells spaced out on the surface of the sensor.", "In contrast, a matrix layout uses a grid of perpendicular lines intercepting at multiple points on the surface.", "We choose to use a matrix layout because it is easier to fabricate and requires less components and apparatus.", "ndings corroborate with the gestures proposed in existing literature surveys [100, 33, 32].", "The participants did not propose additional new gestures.", "Skin has a wide range of mechanoreceptors used conjointly to detect touch and deformations.", "Building skin-equivalent sensors, raises two technical challenges: (1) choosing the sensing technique and the overall electrode pattern, and then (2) choosing electrodes material compatible with articial skins properties to not hinder its deformability.", "To inform our choices we have a series of requirements:", "We choose to implement our sensor using a matrix layout sensing mutual capacitance.", "To understand the reasons behind this choice we need to explain the different techniques that can be used.", "There are various ways to lay out sensors to detect gestures.", "The most widespread and accessible techniques are either resistive or capacitive, and can use a discrete or a matrix layout.", "Our next step in the design of the articial skin was to identify the types of gestures which are desirable for Skin-On interfaces.", "In doing this we aimed to rene our specication for the design of the sensing aspect of the skin.", "Resistive or capacitive .", "Resistive touch technology usually relies on resistance that varies when a mechanical pressure is", "Resistance on a 2D sensor can be read from orthogonal electrodes with a piezoresitive material between them.", "This approach is often used for smart textiles [17] but requires large electrodes (>1cm), which does not t with our requirement of spacial acuity.", "Capacitive touch sensing relies on capacitance change, which occurs when the body gets close to the electrode and changes the local electric eld.", "Capacitive sensors can be made thin and allow one to infer pressure information.", "They can also detect multi-touch gestures, using for instance mutual capacitance sensing [59, 110].", "This technique only requires two orthogonal arrays of electrodes separated by a dielectric layer and few instrumentation.", "We choose this approach for all these reasons.", "Conductive threads .", "Another approach is to use conductive threads that are sealed in a thin layer of silicone.", "We used conductive insulated Datastretch thread [93], which allows a strain up to 30%, is 0.2mm thick, and has a conductivity of 4.2  /m.", "It is less stretchable than conductive textile or cPDMS, but 30% is sufcient compared to the skin maximum strain, which is approximately of 40% [7, 24].", "The threads can be positioned with a specic pattern, and electrical insulation allows superposing multiple electrodes while keeping the layer sufciently thin.", "The electrode pattern can only have a limited number of electric lines, but this technique remains the fastest to fabricate and requires few material which makes it appropriate considering our requirements.", "As the threads are thin, the thickness of the sensing layer can be similar to the humans dermis and even smaller.", "Next, we explain how we used this material to fabricate our articial skin.", "To implement the electrode pattern described above, we need a conductive material that ts our requirements.", "We excluded solutions that rely on complex machinery or a complex fabrication process to t with our accessible requirement.", "In particular, we excluded solutions such as depositing of hard conductive particles or liquid conductive metal in a microuidic channel [57, 54].", "We also tested the solutions described below before choosing to use conductive thread.", "material by pouring a thin layer of silicone on top of the conductive textile.", "Once cured, we laser cut it to the desired pattern and sealed it into another silicone layer.", "The weaving structure of the material makes it durable, very conductive (<1  / cm 2 ), and an increased strain reduces its electrical resistance.", "However, its thickness was 0.8mm (about the same as the fabric thickness), which is over the size of the dermis thickness when using multiple layers (two layers are needed, plus the dielectric, which would make the sensor more than 1.2mm thick).", "We thus discarded this solution.", "Conductive silicone .", "A common approach is to use cPDMS, a silicone material lled with carbon powder or nanotubes [52].", "We tested two conductive silicones.", "First, we prepared a cPDMS mixing carbon black, EcoFlex 00-30 silicone and D5 solvent.", "A 1:1:1 ratio ensured a proper consistency for coating over stencil, and an even distribution of the carbon black allowed conductivity and stretch.", "Once dry, the conductivity was about 500k  / cm .", "The second silicone tested is a commercially available conductive silicone, Elastosil LR3162 by Wacker [26].", "It has a theoretical conductivity of 2  / cm when mixing manually, but we could not get a conductivity under 10k  / cm .", "This material allows a stretch up to 60% before breaking.", "Its electrical resistance is high and increases when stretched.", "The high electrical resistance of the electrodes make it unsuitable for mutual capacitance sensing.", "Another drawback of this approach is that connecting the electrodes to cPDMS is challenging to ensure a durable prototype [103].", "Conductive fabric.", "We also explored conductive fabric, which is used in the DIY wearable community [17].", "We used a Silver plated stretchable conductive fabric (stretch-width:65%, stretch-length:100%) to create a composite fabric + silicone", "Choosing the electrodes material", "Conductive ink .", "PEDOT:PSS [51], which is a conductive ink, is more and more mainstream in fabrication research.", "However, the electrical resistance increases drastically after every stretch [103], which makes it impossible to build an efcient deformable sensor.", "Thus, we discarded this solution.", "We now present the steps needed to fabricate our articial skin (Figure 10).", "We focus here on how embedding the sensing layer impacts the fabrication process.", "We developed an Open Source and Open Hardware multitouch controller 1 with a total cost of $4.", "This contribution enables DIY fabrication of multi-touch interfaces on nonconventional surfaces such as human skin [59], walls [110] or, as in our case, exible silicone.", "The breakout is composed of a FT5316DME controller, which allows for connecting 12 sensing electrodes and 21 transmitting electrodes.", "Any conductive electrode with an unusual shape or using unusual material can be used for sensing and transmitting.", "The touch controller can transmit the raw electrodes data or 5 multi-touch coordinates via i2C, to any micro-controller.", "We used both an Arduino Pro Micro board for sending the data via serial communication to a laptop, and a Wemos D1 mini for transmitting the information wirelessly to the mobile device.", "We now explain how we detect touch contact, then more complex gestures.", "The process pipeline relies on OpenCV to convert the mutual capacitance readings to touch coordinates.", "It removes the background noise and tracks the users points of contact with the surface.", "Using the data read (in serial or wireless) from the sensing and transmitting electrodes, we build a 2D image of 12x21 pixels.", "Each individual cross-point corresponds to the capacitance reading at a location on the sensor grid.", "To minimize the background noise, we perform an initial calibration.", "After the board is detected, we create a calibration matrix, by averaging the individual value of each coordinate 10 times.", "The interface must not be touched during this period (Figure 12-b).", "Incoming capacitive data is transformed by the calibration matrix (Figure 12-b), and the values are normalized and stored in an image le.", "We apply a threshold to remove points under 0.1%, that we consider as background noise.", "The nal step is to detect users gestures.", "We present the implementation of our hardware and software toolkit and demonstrate its gesture recognition algorithm, which can detect gestures proposed in the previous section of this paper.", "Advanced gesture detection.", "Advanced gestures differ from multi-touch gestures by their specic dynamic and/or the number and size of the contact area (radius larger than 1cm).", "For instance, a stroke is characterized by a simultaneous swipe contact of at least three ngers along all the surface and a tickling is characterized by repeated fast nger swipes in the same direction.", "When the user performs a pinch with two ngers, circular blobs merge into a single ellipse with a large eccentricity.", "Its rotation informs on the rotation and", "To support accurate spacial interpolation, we upscale the image 5x using the Lanczos-4 algorithm (Figure 12-c).", "The raw image of the transformed cross-points values is then converted into a binary image with a threshold of 55%.", "We apply contour detection to separate distinct elements on the image as blobs .", "We calculate the relative surface of each blob area and the nearest tting ellipsoid to get its center and orientation (Figure 12-d).", "The electrodes are read 16 times per second and the data processing takes 4ms in average.", "An API is provided to share touch points and gesture events using Unity3d.", "Multi-touch point detection.", "The center and radius of an ellipsoid dene respectively the location and strength (or pressure) of the touch point (Fig. 12-top).", "In a pilot study, we dened the maximum radius (5mm) that a single nger press can have on this surface (Fig. 12-c).", "To determine and track the position of multiple points over time, we use the contour points (stored in a k-d tree), and nd the closest blob position in O(log n ).", "Touch accuracy.", "Overall, our data processing algorithm provides a spacial acuity of 2mm with an electrode spacing of 4mm.", "This accuracy is comparable to the acuity of the human skin on the forearm.", "The two-point discrimination threshold of our prototype is 10mm, which is better, in average, than with the human skin [102].", "the sensing layer.", "The hypodermis viscous silicone layer of Ecoex Gel is poured inside the mold to reach the desired fat thickness, i.e. 10mm in this example (Figure 10-3).", "5. Shaping the Skin-On.", "To improve the visual appearance of the interface, the excess of silicone can be trimmed before being folded around the side of the hypodermis layer and glued with silicone glue (Figure 10-5).", "For a permanent xation on a device, either silicone glue or acetone can be used, to smoothly blend the silicone with the underneath surface.", "Paint or makeup can be added to shade the articial skin with eshlike tonal variation, thus increasing anthropomorphism.", "4. Connecting the electronics.", "The electrodes are then connected, i.e. they are soldered to the hardware sensing platform (Figure 10-4).", "Gesture detection pilot study.", "We ran a preliminary study with 8 participants on a subset of 8 gestures.", "The selected gestures are representative of the capabilities of our device: they leverage skin depth, allow multi-touch interaction, and are not a combination of basic gestures.", "The participants performed 3 practice trials, then 5 test trials, for a total of 8*8*5= 320 tested gestures.", "The overall recognition rate was 85% (Light Press: 100%, Hard Press: 100%, Sustained Hand Contact: 88%, Stretch: 83%, Pinch: 80%, Stroke: 80%, Tickling: 78%, Slap: 73%).", "Although preliminary, these results are promising and demonstrate the feasibility of our approach.", "We rst describe the implementation of three Skin-on interface prototypes with different form factors shown in Figure 1.", "We then present the applications we developed for these prototypes.", "These applications are divided into two categories: interface control and emotional communication.", "We also fabricated a Skin-On wristband to alleviate the limited input and output capabilities of smartwatches [65] (Figure 1-c).", "The wristband (10cm x 2.5cm, thickness of 5mm) illustrates how wearable devices can benet from Skin-On interfaces.", "The wristband is connected to a computer that processes the data and sends back the events to the smartwatch via WiFi.", "strength of twist.", "Other gestures are detected because of their large surface area.", "For instance, the detection of the palm of the hand has a very large surface area ( > 50 mm 2 ).", "A slap is characterized by the presence of a large blob for a very short amount of time.", "On the opposite, a grab gesture (Fig. 12-bottom) is characterized by a large blob on a side of the surface (palm) and four ellipses with large eccentricity at the center of the surface (ngers) (Fig. 12-d).", "Skin-On interfaces leverage physical interaction by providing haptic feedback in line with gesture input.", "For instance, when users are pinching or stretching a virtual image (Figure 13a), they physically pinch and stretch the skin.", "Similarly, a twist gesture can be used to manipulate a tangible knob: the amplitude of the twist rotation controls the volume of a music player (Figure 1-b).", "Physical interaction metaphors can be be useful in games, thereby providing a sense of realism.", "For instance, taking advantage of the elasticity of the skin, users can perform a shear gesture to execute a slingshot in the Angrybird game.", "Skin-On interfaces allow users to perform advanced gestures with a higher degree of control.", "Typically, pressure-based interaction can be difcult to control since rigid surfaces cannot communicate apparent stiffness to users.", "In contrast, Skin-On interfaces have a much smaller stiffness, providing a higher level of control.", "We implemented a pressure-based menu.", "When selecting an icon, a light touch opens a document, a medium touch shares it, and a strong one deletes it.", "Rather than pressing on a at plane, the hypodermis layer provide another level of haptic feedback.", "Similarly, users can perform micro-gestures [77] with a higher level of accuracy or control a 3D joystick by performing in-place rotations of the nger (Figure 13-b).", "We built a Skin-On smartphone case (Figure ?? -bottom) providing advanced input and output capabilities on the back and side of a mobile device [47, 11, 80].", "The interface communicates via WiFi with the Android device and the hardware (sensing breakout, battery and communication component) is self-contained within the case (Figure 11).", "This prototype has a dimension of 8cm x 15cm and could easily be extended to tablets.", "Skin-on interfaces allow a wide range of interactions.", "For instance, the Skin-On Smartphone supports back-of-device interaction [47], which let users interact with the device without occluding the screen.", "It can also sense how users are grabbing the device to enable additional applications or context detection [18, 19] as the skin covers both the back and the side of the smartphone.", "For instance, Figure 13-c shows an adaptive", "the skin to pinch or twist it, a gesture that users would not naturally perform on rigid touchpads.", "Moreover, once users discover the skin metaphor (either by themselves or after communicating with others), they may be more inclined to explore additional gestures and discover new controls.", "Skin-On devices form factors", "Figure 13.", "Applications for interface control.", "a) Leveraging physical interaction (pinch and stretch),", "b) Virtual joystick with micro-interactions,", "c) Grab detection to display an adaptive pie menu,", "d) a pressure menu", "We also built a Skin-On interface for built-in and external touchpads.", "We created two interfaces with two different sizes and thicknesses (9cm x 12cm and 10cm x 14.5cm, thickness 7mm) that can be connected to a device via USB (Figure ?? -top).", "Skin-On interfaces provide natural physical affordances.", "The characteristics of the material can motivate users to spontaneously explore the interface and discover novel controls.", "For instance in study 3 we saw several users spontaneously pulling", "Skin-On smartphones", "Skin-On Wristband", "Virtual agent embodiment .", "Embodied Conversational Agents (ECAs) are virtual human-like gures designed to communicate with individuals.", "They express their socio-emotional states through verbal and non-verbal behaviour, such as facial expressions [111, 72, 71].", "Articial skin can act as a mediated embodiment of the virtual character.", "The users can then perform social touch gestures on the skin, that is, on the virtual character, as they would normally do in human-to-human interaction.", "For instance, users can perform a stroke to convey their sympathy, small repeated taps to convey happiness, etc.", "[32], or pinch to convey annoyance (Figure 14-b).", "Another example is to convey that one is listening to what the ECA is saying.", "For example, a simple touch by the user can indicate she is paying attention to the ECA speech.", "The ECA then detects the touch gesture, interprets it and reacts accordingly.", "Technical evaluations .", "Further tests are needed to evaluate the robustness of our system.", "While preliminary studies indicate that we can recognize 8 touch gestures and multi-touch ones, taking individual variability into account and using better recognition algorithms (typically relying on machine learning) would improve the recognition rate and allow distinguishing variations of these gestures (e.g. soft grab vs. hard grab).", "We also plan to study the factors (e.g.the number of repetitions, gesture strength, etc.) that alter the sensing capabilities and the mechanical properties of the articial skin.", "In particular, the orientation of stretch gestures seems to impact the maximum strength that can be applied.", "Indeed, the grid layout of the electrodes facilitates the stretch in diagonal directions, where the stretch is greater than 50% while it is limited to 30% on the horizontal and vertical axes.", "Thus, the orientation of the articial skin should be preferably chosen in such a way that frequent stretch gestures are performed on the diagonal of the grid.", "This work also brings technical challenges that are worth deepening and that are not covered in this paper, including the impact of curvature on spatial sensing acuity and signal to noise ratio.", "Additional Skin-On interfaces form factors .", "We see several directions to investigate other form factors.", "First, it would be interesting to consider larger surfaces, such as interactive tables or, as one participant spontaneously mentioned, a SkinOn wall.", "Larger surfaces introduce technical challenges as there is a trade-off between the acuity and the responsiveness of the interface.", "However, different areas could have different acuity, as it is the case with the human body.", "For instance, nger tips (2.3mm) are more sensitive than the calf (45mm) [102].", "Similarly, the sides of an interactive table could have a higher resolution than its center, as more interactions occur in the vicinity of the user position.", "Skin-on interfaces can also serve for improving small mobile devices such as smartwatches or connected objects.", "For instance the Skin-On wristband (Figure 1-b) can allow performing all the one-dimensional interactions (along the wristband) proposed in [65], plus some additional interactions such as 2D scrolling or continuous rotations on the wristband, e.g. to change the volume of the music, navigate in applications or send simple gestural messages to others.", "While our paper focuses on common interactive systems (PC, smartphones, smartwatches), Skin-On interfaces could also be useful in a wide range of setups, including robots and connected objects, or for extending the capabilities of everyday life objects.", "We envision interaction scenarios where SkinOn and On-Skin interfaces co-exist in a complementary way: the continuity of interaction across existing devices (mobile, desktop and skin-worn) would be maintained through similar skin-based interaction paradigms.", "Mobile tactile expression.", "One of the main uses of smartphones is mediated communication, using text, voice, video, or a combination of them [78, 95].", "We implemented a messaging application where users can express rich tactile emoticons on the articial skin.", "The intensity of the touch controls the size of the emojis.", "A strong grip conveys anger while tickling the skin displays a laughing emoji (Figure 14-a) and tapping creates a surprised emoji.", "The distant user can then receive these emoticons visually, or haptically, for example using an interface like those proposed in [92].", "We now discuss future directions regarding the implementation, the concept and the approach.", "Skin-On interfaces with output abilities .", "We aim to study Skin-On interfaces as an output modality.", "Engagement in a social interaction can be dened as \"the value that a participant in an interaction attributes to the goal of being together with the other participant(s) and of continuing the interaction\" [67].", "It is a crucial vector to keep the interaction going on, so that participants continue exchanging information and establishing trustworthy relationship.", "Showing, perceiving, adapting to each other emotion are important cues of engagement.", "While, so far, we have focused on conveying different types of information with Skin-On interfaces, our future aim is to perceive affect through articial skin to reinforce engagement between interaction partners.", "For instance, the color of the skin could change (using thermochromatic ink) to inform about a new message or to communicate the emotional state", "Figure 14.", "Examples of applications for emotional communication.", "a) Tactile expression for mediated communication,", "b) Communication with a virtual agent.", "Touch gestures on Skin-On can convey expressive messages for computer mediated communication with humans or virtual characters.", "Pie menu whose location depends on the handedness of the phone grasp.", "of the user.", "Similarly, the texture of the skin could change (sweat or goosebumps) to convey disgust or frustration.", "Shapechanging mechanisms such as air cavity [22] [1] could be used to stiffen some parts of the skin (e.g. veins, muscles) to modify the relief of the skin epidermis, thus the gesture performed on the skin.", "More generally, our goal is to further explore various types of anthropomorphism towards human-like devices.", "Uncanny Valley .", "Uncanny valley has been principally a no-go zone in HCI [8], and our work challenges this.", "Emotional reactions and social acceptance of new form factors may change quickly, and they also depend on various aspects.", "For instance, the perception of our participants changed from Study 1 (visual condition only) to Study 2 (visual and tactile perception) although the same interfaces were used.", "We interpret this result as subtle interaction effects between visual and haptic perception regarding skin perception, which also depends on a combination of factors (including the duration of the interaction, the degree of realism of the device, etc.).", "We think this would merit a qualitative study of its own.", "More generally, our work explores the intersection between man and machine (human augmentation) from a new and radical perspective: instead of augmenting the human with parts of machines, we demonstrate how machines can be augmented with parts of human.", "This work was supported by the Engineering and Physical Sciences Research Council (grant number EPSRC EP/P004342/1, EP/M021882/1, EP/R02961X/1) and the Agence Nationale de la Recherche (ANR-17-CE33-0006 SocialTouch, ANR-16CE330023 GESTURE).", "Authors wish also thank C. Bourget and C. Honnet for their help and constructive feedback.", "Anthropomorphism and attachment to machines .", "Humans have a biological predisposition to form attachment with social partners, and even inanimate objects, especially mobile devices [45].", "Several studies on interactive stuffed animals and robots have shown that they increase human engagement [106, 107].", "Using articial skin on a device may create similar effects, and could change the engagement or affection that we have towards inanimate objects such as interactive devices.", "We thus believe that our anthropomorphic approach can inspire other researchers and lead to a novel generation of devices with an input system closer to nature.", "Bio-driven approach .", "We presented a bio-driven approach which is singular in HCI.", "One challenge we faced was to conciliate an holistic approach and an iterative design.", "In theory , the different parameters of the skin should be investigated altogether.", "e.g. we observed that it was difcult to study the color of the skin independently from its texture.", "However, in practice , there are too many dimensions to investigate, which requires making design choices at each iteration.", "Further investigations are needed to provide clearer guidelines to follow a bio-driven approach in HCI, and we believe that exploring synergies with other elds such as Material engineering or Robotics will be a powerful means to further the development of advanced interactive devices [68].", "ACKNOWLEDGEMENT", "UIST '19, October 2023, 2019, New Orleans, LA, USA", "Human-centered computing  Interaction devices;  Hardware  Emerging interfaces;", "1. From a sensory point of view, we study how to reproduce the visual, tactile and kinesthetic aspects of the human skin.", "We motivate our use of silicone to mimic the skin deformability with reference to relevant literature.", "Then, through three user studies, we investigate how visual factors (color) and haptic factors (texture and thickness) impact user experience, and the perception of realism.", "2. From a gestural point of view, we explore how gestures naturally performed on skin can be transposed to Skin-On interfaces.", "We use this knowledge to propose a series of gestures that are desirable for Skin-on interfaces (e.g. multitouch touch, pressure and complex gestures such as strokes, stretching or grabbing).", "3. From a sensing point of view, we analyze different fabrication methods to create a silicone layer that can track the previously dened gestures with a spatial acuity comparable to human skin.", "We also contribute a DIY fabrication method and offer an open-hardware tool enabling easy reproduction by other researchers and practitioners.", "of a month.", "It provides both visual and tactile feedback (typically pigmentation and texture).", "The dermis is the middle layer.", "It hosts most of the sensory receptors responding to tactile and kinesthetic feedbacks that compose touch [44].", "It also hosts receptors for pain and temperature, as well as veins, hair bulbs and sweat glands.", "The hypodermis is the thicker part of the skin located between the skin and the muscles and is principally used for storing fat.", "It provides depth and resistance when human interacts with the skin, thus providing kinesthetic feedback.", "Pigmentation (visual) varies between individuals and body locations and informs on the perception of age, attractiveness, mood, ethnicity or health [21].", "Texture (visual and cutaneous haptic) .", "The skin texture depends on the size of the pores and the wrinkles which also vary between individuals (age, gender) and body locations.", "Since pores are relatively small, wrinkles, in combination with skin pigmentation, is the main factor that determines the visual realism of the skin [6].", "Wrinkles are also responsible for the haptic cutaneous (or tactile) perception of the smoothness of the skin (along with the self-lubrication and the hair, which increases friction) [69].", "Strain/Thickness (kinestetic haptic) .", "Strain is a measure of deformation and is dependent to material thickness which, in skin, varies between individuals (age, gender) and body locations ( epidermis from 0.3mm to 1mm [37] dermis 0.9mm to 2.5mm [46, 73]; hypodermis from 1.9mm to 12mm [37]).", "Given these variations, it is not surprising to nd a large variation in the elastic modulus 1 reported in the literature (between 0.02 MPa to 57 MPa [16]).", "Acuity (sensing) .", "Cutaneous receptors, which are part of the somatosensory system, include cutaneous mechanoreceptors (pressure and vibration), nociceptors (pain) and thermoreceptors (temperature).", "There are then several specialized mechanoreceptors focusing on the perception of roughness (Merkel corpuscle), stretch (Rufni corpuscle), utter and slip (Meissner corpuscle) or high frequency vibration (Pacinian corpuscle).", "The brain then integrates these various forms of information to perceive shape.", "The epidermis is the outermost layer.", "It hosts multiple layers of renewed cells, with a turnover time in the order", "on these receptors, the skin spatial acuity varies from 2.3 mm inside the palm, 7mm on the forearm up to 15mm on the thigh [102, 96, 88].", "Strain/thickness : we want to reproduce the deformability of the skin as described earlier.", "We are particularly focused on sensing layer of thickness below 1.2mm to match human dermis thickness.", "Accuracy : we want to build accurate sensors that can reproduce the human skin sensing acuity and detect the gestures dened previously.", "Accessibility : we want to use accessible technologies, i.e. the process should be easy to reproduce by HCI practitioners with affordable material and without high-end equipment.", "Choosing an electrode pattern", "3. Adding the hypodermis.", "We prepare a rectangular mold of the size of the desired articial skin and place it on top of", "2. Positioning the electrodes .", "Once cured, the top layer is positioned on a pane, with the texture facing down.", "The Datastretch conductive threads [93] are then placed in a perpendicular grid on top of the articial epidermis to form the electrodes.", "To ensure an even spacing between the electrodes, we laser cut guide holes on the edge of the acrylic plate and then sew the thread, following the holes (Figure 10-2).", "The spacing between holes varies depending on the desired size of the interface and the spacial acuity.", "Once the electrode grid is positioned, we pour another thin layer of silicone to seal it in place.", "We ensure that the total interface is under 1.2mm.", "1. Creating the top textured layer .", "The epidermis layer is built by pouring DragonSkin silicone with beige pigments on a skin-like texture mold (Figure 10-1).", "A thin-lm applicator is used to achieve the desired thickness (about 0.6mm)."]}
