{"paper_id": "uist-0", "sentences": ["abstraction to recognize clutter.", "Our fnal design uses object-based saliency and edge detection to highlight contrast along subject and image borders, outlining potential distractors in these regions.", "We describe the implementation and evaluation of a capture-time tool that interactively displays these overlays and fnd that the tool is helpful for making users more confdent in their ability to take decluttered photos that clearly convey their intended story.", "CCS CONCEPTS", "Adobe Research San Francisco, CA, US", "2021 Copyright held by the owner/author(s).", "Publication rights licensed to ACM.", "ACM ISBN 978-1-4503-8635-7/21/10..", "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for proft or commercial advantage and that copies bear this notice and the full citation on the frst page.", "Copyrights for components of this work owned by others than the author(s) must be honored.", "Abstracting with credit is permitted.", "To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specifc permission and/or a fee.", "Request permissions from permissions@acm.org.", "UIST 21, October 1014, 2021, Virtual Event, USA https://doi.org/10.1145/3472749.3474755", "Kevin Y. Zhai kevin.y.", "zhai@gmail.com Air, Inc Brooklyn, NY, US", "Jose Echevarria echevarr@adobe.com James A. Landay landay@stanford.edu Stanford University", "ACM Reference Format:", "Ohad Fried", "We are interested in designing camera interfaces that can encourage users to incorporate these exploratory stages of the design process into their photographic process.", "In particular, we wondered how we might be able to bring some of these benefts of sketching to photography to promote this behavior of intentional exploration, and if that might help users notice unexpected mistakes, such as unwanted clutter in their photos.", "Photography instructors often give feedback through annotations on the photo [20].", "We aimed to design feedback through such annotations directly in the camera.", "We describe our process towards designing an abstracted annotation of a photo and study how that infuences how users address capturing decluttered photos.", "Storytelling is an important aspect of photography.", "Photographers employ a wide range of visual techniques to communicate their intended story or narrative to a viewer [8, 9, 21, 27].", "The defnition of story in this sense of the word is often very open.", "Its more about capturing a moment or invoking an emotion, perhaps a sense of tension or inspirationin general, it is just about capturing what caught the photographers eye, e.g., a subject performing an action in their current environment.", "In fact, it is desirable for the photo to leave a gap in the narrative such that certain aspects are left up to the viewers imagination.", "Two important factors to telling a clear story are picking a strong subject, and keeping visual distractions to a minimum.", "Our fnal annotation design involves color-coded edge highlighting (very similar to the focus peaking feature that can be found on a number of commercial cameras [2, 32]) focused on regions around the subject(s) and image borders where clutter can be most distracting.", "Edges along the subject borders are colored in yellow, edges along the image borders are colored in cyan, other edges are hidden by default.", "In our in-camera app implementation, users also have the option to toggle on all edges (see Figure 7).", "We show edges within the subject(s) also in yellow and background edges not within the subject(s) and image borders in white (see Figure 1).", "Amateurs frequently make the mistake of taking too few photos in the moment, relying on editing to improve their photos.", "However, changes that can be made at the editing stages are limited, and often many mistakes cannot be fxed without returning to the photo location.", "Having unwanted background clutter is one such mistake that can be harder to fx without more signifcant changes, and can be particularly frustrating as they distract from the main focus of the image.", "While still at the scene, the photographer has many more options to reframe the image to clarify the subject and remove distractors, helping to improve these images and better direct viewers eyes.", "Designers have long known the benefts of quickly testing many ideas.", "Bill Buxton describes the benefts of ideating through sketching due to its fexibility enabl[ing] ideas to be explored quickly and cheaply [10].", "Designers use sketching to externalize ideas that are still vague in their minds.", "In doing so, they can spot potential unexpected issues and refne or be spurred to explore new ideas based on these observations [23, 34].", "Similarly while taking photos, it is cheap to iterate and generate more prototypes or photos in the moment.", "The photographer can test out ideas just by moving the camera around in space, or by taking photos and immediately reviewing them, and similarly notice any issues like unexpected clutter.", "Upon leaving the location, these photos become high fdelity prototypesthe photographer is more committed to these photos as potential changes are limited and more expensive.", "On the other hand, experienced photographers tend to capture many photos of a given scene: they know how to consider diferent options (e.g., composition, lighting, or pose), and recognize the challenges of not having the option to physically move the camera or elements in the image at edit-time.", "We see similarities in this photographic process and the design processphotographers are essentially iterating on their design (or image) in the camera as they consider these diferent aspects of photography and storytelling.", "One signifcant diference between sketching ideas and trying them out in the camera is this level of fdelity.", "At any point in time, a photo has complete detail.", "Depth of feld can enable some blurring of the background, but each pixel of the image is pigmented, every object in the frame is captured.", "A sketch on the other hand is a selective representation, an abstracted view of the idea or concept being explored.", "Removing these low-level details allow the designer to more quickly explore a broad range of high-level concepts.", "Specifically in photography, it can be easy for a photographer to be too", "focused on the primary subject of a photo and miss objects immediately surrounding it in the background.", "Abstracting the image can help them view the image as a whole rather than focus on perfecting the subjects pose or expression.", "In order to realize the proposed interaction, we additionally present a proposal of an algorithm for visually annotating potential clutter by highlighting relevant edges around salient objects and around the image border.", "In this work, our main focus is on the design process and the prototype appour goal is not to propose an exact abstraction interface, but to understand how this style of in-camera interaction might infuence users photographic process, specifcally with regards to decluttering.", "Image Abstraction and Simplifcation.", "Graphics researchers have taken a nonphotorealistic rendering lens on designing algorithms to create stylized image abstractions [15, 22, 36].", "Many have taken the approach of trying to realize them as approximate image illustrations with strokes and colored regions, employing a", "We contextualize our work of designing an abstraction-based camera overlay within the most relevant work in image manipulation and camera guidance.", "Specifcally in this paper, we contribute:", "Most similar to our work is the focus peaking feature in commercial cameras and the work of E et al.", "[17] for highlighting composition.", "Focus peaking is relevant to our work due to its methods of visualizationit similarly highlights subsets of edges in the images, but instead for the purpose of highlighting regions that are in focus [2, 32].", "However, similar to a lot of other existing feedback in commercial cameras, the focus of this feature is more to assist users to more quickly arrive at the appropriate camera settings.", "By providing these forms of feedback (e.g., the light meter which helps measure overall exposure, or zebra stripes which help determine if regions of the image are overexposed), the user can more quickly evaluate their decisions.", "We are inspired by the iterative loop of testing and evaluating that these forms of feedback encourage.", "However, rather than focusing on accuracy and refnement of camera settings, we are interested in understanding how similar overlays", "number of edge detection algorithms for extracting lines for the strokes [7, 11], and smoothing flters or superpixel algorithms for quantizing the color [1, 18, 35].", "DeCarlo and Santella consider visual perception through tracking eye movement to determine a structural hierarchy of the image for understanding the importance of diferent lines in the simplifcation process [15].", "can be used for promoting exploration of creative concepts and understanding how to apply higher level photography principles.", "Capture-time Guidance.", "A range of contextual in-camera guidance exists both in research and in commercial cameras.", "Some existing work assists users in guiding users towards better lighting for their portraits [16, 24].", "Others help the user navigate and position their cameras to achieve better compositions [6, 12, 26], or displaying preferred view proposals [25, 28].", "Other work more generally guides the user by interactively displaying a measure of aesthetic quality [25, 29, 33].", "While these aesthetics evaluation algorithms may consider clutter, they provide limited information to the user for interpreting these quality measures.", "We havent seen work that focuses on helping users declutter their compositions in the camera.", "The goal of this line of work tends to be to serve one of two purposes, generating an artistic result, or reducing data for visual communication [22].", "Both are useful for our goal of designing visual overlays that are friendly for users to process interactively.", "Additionally, while these methods focus on generating output from existing media, Winnemller et al.", "s method performs at interactive speeds and produces temporal results, making it appropriate for interactive use on a live camera feed [36].", "Image Declutering.", "Image processing methods also enable removing clutter in post using a variety of techniques.", "A photographer can choose to drag a slider to incrementally remove automatically detected distractors [19], or select a region with clutter to be automatically flled based on the surrounding content [5].", "A photographer can also choose to segment out the foreground of a portrait to place on a dramatic black or custom backdrop [31], a feature also available directly in-camera on some commercial phones (i.e., Stage Light in iPhones Portrait mode).", "Nonetheless, these arent intended to train the user to be more aware of background clutter while they are taking photos.", "Additionally, they all sufer from potentially jarring artifacts since they rely on pixel manipulation rather than adjusting the real physical objects in the image.", "In this section, we describe the steps we took to design our abstraction interface for decluttering images.", "We hypothesized that abstracting an image could help evenly spread the photographers attention across the image, efectively drawing the photographers attention away from the details of the main subject to other areas of the image.", "To test out the concept of abstraction guidance, we started with a low-fdelity Wizard-of-Oz (WoZ) prototype [14] where experimenters manually drew abstraction overlays.", "These abstraction overlays took shape as rough outlines of the objects in the scene, mostly approximated by basic 2D geometric primitives (see Figure 2 for a few examples).", "E et al. begins to tackle this for overall photo composition by interactively highlighting the perceived composition.", "We look to extend this idea by designing visual overlays that help the user identify clutter.", "We fnd decluttering particularly of interest because it starts to draw on the storytelling aspects of photography.", "Rather than being tied to a single concept, the process of decluttering an image can involve solutions that touch on several photographic concepts (e.g. composition, lighting, color).", "We informally tested our low-fdelity prototype with 19 participants (9 male, 10 female), 18 to 41 years old (  = 24).", "Participation was voluntary and no compensation was given.", "Two experimenters were involved in the prototype testing, and when possible, both were present.", "We ran the study using the iPhones default Camera and Photos apps.", "Participants were asked to stage a scene of a person (for convenience, this was often one of the experimenters) interacting with an object of their choice, in order to have a more direct concept of story in the photos.", "We then handed them the phone to frame and take a photo of the scene.", "After capturing a frst photo, one of the two experimenters drew the abstraction in dry erase marker(s) on a transparency and taped it to the phone (see Figure 3).", "The experimenter would return the phone and ask the participant to review the photo with the overlay.", "The participant would then be given an opportunity to take a new photo of the scene or stick with their current one.", "We would then apply a new transparency and draw the corresponding abstraction overlay for the new photo for the participant to review.", "While we didnt ask if they wanted to take another photo after this review step, occasionally (6) participants would ask if they could take a third photo and we would repeat the process above, presenting them with a third overlay.", "3.1.1 Prototype Insights.", "From our WoZ prototype studies, we saw promising signs that the participants in fact noticed high level", "Given the observations from our low-fdelity prototype, we were motivated to continue with this concept and move onto the step of answering the second question: What is an abstraction of a photo?", "What should such a visualization look like, and how might we implement them?", "In particular, we saw that the abstraction overlay seemed most helpful for the purposes of noticing unwanted clutter in an image, so we decided that we would target designing an abstraction overlay that provides decluttering guidance.", "changes to make to their photograph.", "In particular, it indeed showed promise as assistance for decluttering.", "In all but one case, participants noticed clutter in the background upon seeing their photo with the abstracted overlay.", "In the one case where the participant did not make adjustments to address clutter, a whiteboard mostly flled up the background of the image, and was involved in the action in the image and therefore did not clutter the image, but instead helped tell the intended story.", "Moving the camera instead of the objects in the scene was often more practical because the objects could not be moved.", "Participants came up with a range of tactics for adjusting the camera to address clutter.", "In one situation the participant positioned the subjects head to block the unwanted clutter.", "Several (5) even discovered that zooming in by moving closer to the subject allows them to more easily remove/block clutter and focus on the subject, a technique often taught in photography resources.", "In doing so, participants additionally changed the overall compositions of the images.", "In a few cases, they chose to change orientation from portrait to landscape (6) to achieve a decluttered composition that they preferred.", "One participant noted that the frst overlay made her realize that she hadnt achieved the composition she intended to because she was focused on other aspects of staging the scene.", "This initial photo featured the subject standing at the center of a portrait photo, soda in hand.", "In her second photo, she focused on capturing the intended composition, shifting the camera to the left to frame a less centered composition.", "Upon reviewing this second image and overlay, she", "Participants tended to either adjust the camera position/angle (17) such that the clutter was no longer in frame, or move the clutter (3) out of the scene (or a mix of both).", "Figure 2 shows two such examples.", "In both cases, in removing clutter, the participant is also more intentional about framing the elements that are key to the story aspects of the image.", "Note that while these participants behaviors matched what we hoped for, there were limitations to our study design such that they cannot be directly mapped to how a user might respond to seeing this style of overlay interactively in the camera.", "The user takes a photo before seeing the overlay, and the process of reviewing (with or without) the overlay can infuence the photographic process.", "To test the interactive experience, we needed to fnd a way to automatically generate these overlays.", "again reconsidered this intended composition and rotated the camera to landscape to further emphasize the of-centeredness of the composition.", "Photography books describe that contrast is key to directing attention [20].", "Our eyes are drawn to regions of high contrast.", "To achieve the most contrast, the photographer should place light objects on a dark background, or dark objects on a light background.", "It is good practice to have this contrast around the subject as it will help make the subject distinct from the background.", "The contrast will clarify the story and declutter the overall image.", "In this paper, we will refer to this as subject-background separation (SBS) In art, this is more commonly referred to as the fgure-ground relationship, a Gestalt Psychology principle [20].", "We use subjectbackground separation in our work to make it easier to relate the concept to more familiar terms.", "On the other hand, contrast in other regions especially the border of the image, will distract, causing the eye to be attracted away from the focal subject.", "In particular, contrast near the border of the image can draw the viewers attention outwards rather than within the imagewe call this image border ficker (IBF) [20].", "Again, this is better known as edge ficker, but we chose to specify image border to diferentiate it from the term edge, as edge is", "3.2.1 Declutering Principles.", "To answer our questions on how to design an abstraction overlay for decluttering, we looked to existing literature to better understand how photographers think about directing the viewers attention for efective storytelling [9, 20, 30].", "into two components as well: a method of color fattening to smooth out detailed regions, and a method of line drawing.", "Given these principles, we wondered what annotation methods photographers currently used for highlighting clutter.", "Photographers recommend a number of methods to be able to more easily see the contrast in an image (see Figure 4).", "These range from squinting at the image to better focus on the contrast with low-level details blurred, to viewing the image in grayscale to better focus on contrast in the absence of color, to explicitly outlining boundaries along which there is clear contrast between the subject and background [9, 20, 30].", "We additionally were inspired by a line of research in nonphotorealistic rendering to generate stylized image abstractions [15, 22, 36].", "Specifcally, since we knew our goal would be to display the overlay interactively in the camera, we focused on Winnemller et al.", "s real-time and temporally coherent implementation of image abstraction [36].", "These papers break down the abstraction process", "often used in computer science with regards to edge detection and identifying segments of sharp discontinuities [7, 11].", "3.2.2 Abstraction Visualization Options.", "Inspired by this idea of using outlines to highlight contrast and the lack of contrast, we hoped to recreate this outlining as an overlay directly in the camera (see Figure 5), while also extending it to contrast along the image borders.", "We looked at diferent approaches to executing this concept as one potential direction to pursue for our abstraction overlay.", "This concept leads us to two components: a method of line drawing to determine the potential outline, and a method for considering location context relative to the subject/image frame to determine which lines in the image are relevant to the decluttering principles (e.g., if they are along the subject-background boundary, along the image border, or neither).", "Combining concepts from these two abstraction ideas, we have three components in total to consider: line drawing, location context, and color fattening.", "We additionally give ourselves line color (for the purposes of color-coding lines based on their location context), and image darkening (to provide more contrast against the line drawings) as parameters to consider in designing abstraction overlays.", "Figure 5 shows two examples of images that do not satisfy the decluttering principles, along with approximations of Glovers suggested outlining to emphasize contrast around the subject [20].", "We note that while this overlay is helpful for identifying potential issues along the subject-background boundary, it does not help to draw any attention towards potential clutter to address along image borders.", "Adjusting these parameters, we designed and implemented a range of potential overlay proposals.", "Since we did not yet need these to work directly on a camera, these proposals were prototyped in Python.", "Aiming to capture visual and conceptual diversity in the overlays, we narrowed down the set of overlay options to the 6 in Figure 6 to study further:", "The survey consisted of 12 pieces of visual media (8 photos, 4 videos) shown with the set of diferent abstractions overlaid.", "For a single photo, participants would see a row of images, frst the original photo and then the 6 overlays applied.", "For a video, participants would see a concatenated video including the original video side-by-side with the set of overlays applied.", "The video would automatically loop, but participants also had controls to pause and play.", "Along with the videos would be 3 rows of still frames from the video to allow participants to compare the overlays across a few frames.", "Figure 6 shows a set of these overlays for a video as they were presented in the survey.", "We chose to also include a few videos to show the process of making adjustments while framing a photo, to mimic how the overlay might appear if being used in the camera.", "Note: overlay", "(a) features the full image abstraction from Winnemller et al. and", "(b) is just the color fattening (or region smoothing) component.", "3.2.3 Design Survey.", "We ran an informal design survey through Qualtrics with 29 participants (demographics information not collected) to try to understand if these overlay visualizations were interpretable by novice photographers, and if there were strong preferences between the overlay options.", "Participation was voluntary and no compensation was given.", "Given the elements supported by the qualitative feedback, (f) appeared to be the best candidate for our overlayit included the color-coded line drawings to help defne the subject and possible distractors along the borders, while being less noisy than showing all outlines.", "However, since (d) was the most popular based on overall counts, we decided to go with a hybrid approach for our fnal abstraction overlay, enabling participants to switch back and forth between showing all lines, including those within the subject and background for additional context, and hiding these extra lines for minimal distraction.", "Further discussing the latter observation that (a)(c) were more helpful for SBS, several (8) participants specifcally noted that the color fattening was helpful for noticing SBS.", "They mentioned the smoothing of colors being helpful because it essentially simplifes the image and makes it easier to analyze the major color contrasts (P27) and noting that it helped in being able to dissociate the images from what I expect to see into what the colors actually are (P24).", "However, a few (3) noted that this fattening caused blurring that made the subject unclear.", "Both color fattening and image darkening made the image less clear, so we wanted our fnal overlay to only have one of these components.", "Since many participants specifcally noted that the darkening was crucial for benefting from the line drawing, we chose the image darkening component over color fattening for our abstraction overlay implementation.", "Many (10) participants also mentioned that the darkening of the image was particularly helpful for seeing the lines due to the contrast, but with the caveat that it made the original image harder to see.", "Participants (4) mentioned that color-coding was helpful, particularly accentuated in videos (P29).", "However, they also noted that outlining everything can be noisy (9), and especially did not want too many lines within the subject (6).", "Overall, almost all (23) participants expressed interest in some form of line drawing.", "Participants noted that the edges helped to defne objects (18) and that they were helpful for noticing edges around the image border (5), supporting the observation shown by the overall counts on (d)(f) being more useful for addressing IBF.", "Therefore we decided line drawing should be part of our fnal overlay design.", "Additionally, some are already somewhat familiar with selective outlining of edges from focus peaking features in commercial cameras, which selectively highlight edges in the image that are in focus [2, 32].", "Both of these conclusions were also supported by the qualitative feedback from participants general impressions.", "Participants were quite thorough in their explanations of their interpretations of the components of these proposed overlays.", "One participant very clearly summarized the potential reasoning for this: if the most important thing for subject background separation is the contrast, then the overlays should try to mute lines as much as possible.", "Results of both steps of our design prototyping process made us hopeful of the potential of an abstraction-based overlay.", "However, we had yet to try these overlays in an interactive manner.", "To do so, we needed an implementation that would run interactively on a phone.", "In this section, I describe our fnal interface along with the implementation and algorithm to enable it.", "Note that this fnal implementation is separate from those used for the prototype overlays for the design survey in Section 3.2.3.", "Participants were presented with some training describing the two decluttering principles (see Section 3.2.1).", "They are also informed of our overall goalto determine which overlay is best for evaluating images based on the two decluttering guidelines.", "For each of the 12 photos/videos, participants were asked:", "Finally at the end of the survey, we asked participants to summarize their choices: Please provide a brief explanation for your choices why did you fnd these overlays most helpful? Are there specifc characteristics of the overlays that you like (e.g., line drawing, color fattening, image darkening, or color)?", "We hoped to gain some understanding of whether or not they had a general feeling of which overlays were helpful (maybe for diferent scenarios and considerations), and why.", "Materials for the study can be found in supplemental materials.", "subject is still well separated, then you know you have the contrast.", "For edge ficker, it almost seems like the opposite.", "If theres no contrast, then your eye doesnt notice objects on the border.", "So if an overlay draws outlines of those objects or lights them up, then theyre easier to notice (P10).", "3.2.4 Design Survey Insights.", "Table 1 presents the results from our design survey.", "The results do not show a clear-cut best overlay design.", "However, overall", "(d)(f) were more popular at 21.3%, 20.4%, and 19.2% of total overlay selections made, respectively.", "These each had the darkened image with selective color-coded line drawing based on their location context in the image.", "Counts show that the participants found", "(d)(f) especially helpful for identifying IBF, whereas (a)(c) were overall more helpful for identifying SBS.", "We choose the most abstracted form of the overlay (solid black, minimal edges) as the default as we imagine users starting in a more", "As a reminder, the lines are color-coded such that lines within and immediately around the subject are yellow, lines along the image border are cyan, and remaining lines in the background are white.", "Lines are color-coded to help users more easily interpret the edges.", "A solid and defned yellow outline of the subject would mean that there is likely good SBS.", "Gaps along this edge might signal a lack of contrastthis could mean that the subject is blending into the background, or there are objects directly around the subject that are interfering with the clarity of the subject border.", "The presence of many cyan edges suggests there might be noise and clutter near the image border that could also take attention away from the subject.", "The additional white lines help to complement either yellow or cyan lines.", "These are especially helpful if the main subject is incorrectly identifed by the saliency algorithm.", "Figure 8 walks through our algorithm for generating our abstraction overlay.", "Given an image, our tool detects edges throughout the image for the line drawing [3].", "However, we want to be able to determine the relevant context in order to focus on edges related to SBS and IBF.", "In particular, we need to identify a border around the subject.", "We realized we could estimate the image subjects using object-based saliency maps [4].", "We used both algorithms of the shelf.", "For determining appropriate parameters for the edge detection [3], we iteratively tested parameters to achieve a balance between having enough defnition in the edges and having too much noise.", "From the default state, the user can adjust the slider at the top to adjust the opacity of the black layer, bringing in more or less of the image color.", "They can use the toggle to bring in the remaining edges in the subject and background.", "They can also turn of the visualization by holding a fnger down anywhere on the screen or using the toggle at the bottom right.", "To implement this, our fnal camera tool has 3 layers: the camera view, a black layer of varying degrees of opacity, and a color-coded outlines layer.", "As shown in Figure 7, by default the black layer is opaque (opacity is 1.0) and only the edges most relevant to our two decluttering principles (Section 3.2.1), subject-background separation and image border ficker, are visible.", "Given this saliency map, we segment the image into regions describing the subject, subject border, image border, and remaining background.", "Since the saliency maps were object-based, they try to identify entire objects rather than general regions of visual attention.", "Thus, these maps directly served as a mask of the regions corresponding to salient subjects in the image.", "We then used simple morphological operations to obtain a subject border mask specifcally, we subtracted a slightly eroded version of this mask from a dilated version to capture the boundary between the subject(s) and the background immediately surrounding.", "The image border was a fxed pixel width border along the outer borders of the image, and the remaining background was anything between the subject border and this image border.", "These segmentations are used to classify and color code the edges: yellow designates edges within and around the subject, cyan for edges around the image border, and white for the remaining background edges.", "We merge these to form two edge-based overlays: one showing all edges color-coded, and the other only showing the relevant edges around the subject and image borders.", "We wanted to study how users would react to our abstraction guidance tool.", "We conducted a small formative pilot study to inform our summative user study design.", "In particular, in running our pilot, we also wanted to understand if a no guidance interface was a reasonable baseline to compare our tool against.", "Participants for", "Our overlay tool is build on top of a basic iOS camera app.", "To allow participants to focus solely on creating decluttered compositions during the user study, this app has just a camera shutter button and no other camera functionality.", "On top of this, we implemented our camera overlays and added the necessary UI elements to adjust settings on our overlay.", "To generate the overlays, the edge detections (for line drawings) and saliency maps (for determining location context) of the current camera image are continuously computed in the background using existing Apple libraries [3, 4].", "This app requires iOS 13.0 or higher.", "Video demonstration of the tool can be found in the accompanying video fgure.", "Based on our learnings from the design survey (Section 3.2.3), we chose to go with a design inspired by a combination of overlay options (d) and (f).", "Thus, our fnal abstraction overlay is a contextaware line drawing.", "exploratory stage.", "As the user refnes the image, they can reduce the opacity or bring in more edges to draw attention to lower level details.", "After each condition, participants were asked to complete surveys with a number of Likert questions (on a 7-point scale) about their experience using the tool along with the Creativity Support Index (CSI) questions (0 to 100) [13].", "Following both conditions, they were asked to favorite a single photo per task (for a total of 6), and asked to rate these based on each of the two decluttering principles as well as whether or not they liked the photo in general.", "We ended the study with open-ended interviews asking about what they liked/disliked about the tool and how the interaction infuenced their thought process as they took photos.", "Again these aspects of the study matched that of the E et al. composition", "We ran these user studies over Zoom, asking the participant to adjust the webcam when possible to keep their photographing within view.", "Additionally to prep for the study, we confrmed beforehand that the participant had a phone running iOS 13 or higher (or found a way to drop of a device in a socially distant manner outdoors).", "We distributed the app using TestFlight.", "After getting the participants consent, we started by walking through having them install TestFlight and subsequently our guidance tool.", "As additional preparation, we also stepped through using the iPhone screen recording functionality with the microphone to ensure sound", "Due to the COVID-19 pandemic, we had to run our studies remotely.", "Overall, we approximately followed the fnal study design of E et al. for their capture-time composition guidance tool [17] and modify the design for work in remote settings.", "In their studies, they defne two sets of 3 tasks of increasing scale.", "We liked how the diference in scale resulted in a range of complexity while composing.", "To modify this task design to work for remote studies, we decided to keep the structure of having 3 tasks per condition at diferent scales (small, medium, and large), but instead of specifying the subjects, we asked that participants choose their own subjects to photograph.", "Thus, participants completed 6 photo tasks: 3 at each of 2 locations of their choosing, using the baseline condition at one location and the abstraction guidance at the second.", "Figure 9 shows a few example images to demonstrate the scale of images chosen by the participants.", "Since the locations were all diferent, here we just counterbalanced condition to avoid biases from learning efects.", "was also captured as we asked participants to think aloud as they captured photos for each task.", "Participants were provided with a document describing the two decluttering principles (see Section 3.2.1 as training for how to think about decluttering their photo compositions).", "They were told that following these guidelines would be helpful in telling a clear story in their photos, but also that these guidelines are just to provide some possible perspectives to consider and that participants are by no means required to follow them (e.g., if communicating their story involved intentionally having the subject blend into the background they should do so).", "After reading the document, we asked that the participants briefy describe the principles in their own words to confrm understanding.", "For each photo task, we asked participants to focus on the overall clarity of the story.", "We encouraged them to explore the process of framing the image, but to limit each task to around 1-2 minutes.", "We quickly walked all participants through the basic (no guidance) camera app.", "If they were using the tool condition frst, they were additionally provided with a brief tutorial describing the overlay.", "both the pilot and larger summative study were compensated $15 for around an hour of their time.", "When evaluating their favorited photos per task, participants did believe that the photos captured using our tool had better subjectbackground separation (Mdn = 6, IQR = 4-5), than those captured using the no guidance baseline (Mdn = 4, IQR = 2-5) [ V = 0, p = . 003].", "Participants found that the tool helped them achieve these more clear photos (no guidance: Mdn = 4, IQR = 2-4; tool: Mdn = 5, IQR = 5-5) [ V = 0, p = . 001].", "They also liked their photos more when using the guidance tool (no guidance: Mdn = 5, IQR = 3-5; tool: Mdn = 6, IQR = 5-7) [ V = 0, p = . 003].", "Therefore we see that while participants are more confdent in their ability to take clear photos, and found the tool helpful for achieving their favorite resulting photos, they didnt necessarily fnd that their photos were better with regard to their personal preferences or the decluttering principles.", "Thus, even though we did not fnd signifcant changes in CSI, we decided that we should compare against a baseline that provided a little more assistance.", "As we described earlier, photographers will sometimes use a grayscale display in their current practice, to help emphasize contrast in order to consider overall clarity and decluttering.", "We therefore use grayscale as our baseline condition.", "It is an active method employed by photographers and thus in some ways does encourage novices to see the image in the ways that expert photographers do.", "Exploration.", "In addition to encouraging more confdence, we found that the tool further encouraged creativity through exploring the space in new ways: It was really helpful with how I take photos because normally its more just snap and done. This one was more like, can I move things out of the background, can I move the subject to frame it to not have a distracting background? Another thing that I dont normally do is pivot the camera and usually just move within a fat plane (P12).", "5.3.1 Summative Study Results.", "Again we saw that the tool made the participants more confdent in their ability to address the decluttering principles of subject-background separation and image border ficker (Mdn = 6, IQR = 5-7), versus no guidance (Mdn = 5, IQR = 4-6) [ V = 8, p = . 03].", "For each favorited photo per task, we asked participants to self-assess them based on subject-background separation and image border ficker.", "Though we actually did not see a signifcant improvement in overall self-assessed quality in terms of these principles, participants did believe that the tool was helpful for the task of capturing clear and decluttered images (Mdn = 6, IQR = 5-6), versus no guidance (Mdn = 4, IQR = 4-6) [ V = 134, p = . 003].", "5.2.1 Pilot Study Results.", "We found that overall, this study design worked reasonably well in the Zoom environment.", "However, even with just 5 participants we were seeing signifcant results suggesting that our tool was preferable to no guidance for these photo tasks.", "In terms of the tools infuence on the process, participants felt more confdent in their ability to capture a clear photo using the abstraction overlay (Mdn = 5, IQR = 5-6), versus no guidance (Mdn = 4, IQR = 4-4) [Wilcoxon signed-rank test V = 0, p < . 05].", "Another participant described that the external representation provided by the interface assisted in the process of exploring the scene and quickly evaluating diferent options: It caused me to experiment more... didnt see it as a rule that I needed to minimize lines, but the tool made it easy to move around and check by that metric, how good it was (P9).", "For example in Figure 10, this participant (P7) refnes the camera angle until the edges in the overlay look the way she wants.", "She is watching the hook on the top left, making sure it doesnt end up in her shot.", "Thus upon capturing the fnal photo, she has intentionally refned some details that were brought to her attention by the overlay, and is therefore more confdent that this photo achieves her goals.", "Figure 11 shows how an unexpected edge highlight encourages the participant to explore diferent backgrounds and compositions.", "This participant (P15) notices an unwanted edge at the bottom of the plant from the stove top, so she tries out diferent camera angles", "5.3.2 Summative Study Discussion.", "We also did not fnd signifcant diferences in CSI, but did fnd support for the increased confdence and descriptions of how the tool encouraged participants to explore more in the qualitative feedback.", "See accompanying video fgures for more specifc examples from the user studies (including those described here).", "We ran remote studies over Zoom with 18 participants (6 male, 10 female), 24 to 32 years old (  = 29), to understand if the tool would help users declutter photos, and if users felt creative while using the tool.", "Users experienced two diferent conditions of the tool: a baseline grayscale overlay, and our tool highlighting edges along the subject and image borders.", "We ran a pilot study (n = 5) to test this study design in a remote setting.", "Participants (3 male, 2 female) were 23 to 31 years old (  = 29).", "For these pilots, we compared our tool to a no guidance baseline condition.", "Confdence.", "Participants described feeling like they could take fewer photos, because they could be more confdent in each photo they took: Usually when I take photos, I take a ton at once, but didnt do that here. I didnt need to because I was being so precise. I noticed myself reconsidering the composition more: e.g. should I have these things in the edges? (P15).", "study [17], with questions adapted to highlight decluttering principles rather than composition.", "Materials for the study can be found in supplemental materials.", "One participant (P1) observed that the tool jumps back and forth in its highlighting of a subject, She interprets this to mean that there is no clear subject in her photo, and confrms that this is consistent with her own perception.", "Therefore she tries to fnd a diferent way to capture this room with a more clear subject.", "On the other hand, another participant (P18) had a slightly different interpretation of the lack of a consistent subject or in this case, no identifed subject.", "He decided that since the large scale task shouldnt have a single focal subject, the lack of yellow aligned with the expectations of this goal.", "For either of these interpretations, the tool has given the participant another perspective from which to consider what it means to clearly capture a subject.", "As a result, the participant has more clearly considered the concept of telling the story of their subject in this space.", "Additionally, we found in our low-fdelity prototype that the abstraction also encouraged participants to be more aware of composition.", "What might our abstraction overlay look like if our focus were instead exploring composition overall rather than decluttering?", "We would be interested in running a similar design survey asking participants to select overlays based on which best assisted in understanding the overall composition and seeing if reactions signifcantly difered from our survey focused on decluttering.", "Our design survey (Section 3.2.3) provided us with a lot of interesting insight on how participants might imagine an abstraction overlay to assist with decluttering.", "For example, we saw the potential benefts of color fattening especially for SBS.", "In fact, a few participants observed that the goals difered between fnding clear separation between the subject and background and fnding distracting constrast in the background/along the image border.", "In the frst case, contrast is goodso it should be subdued to guarantee the contrast is still clear without details.", "In the second case, contrast is badso it should be emphasized to make sure the photographer realizes its presence and has a chance to remove it from the frame.", "Thus, participants actually suggested using a mixed visualization where regions around the subject used color fattening and distractors near the edge are highlighted through line drawings.", "In fact, we would be interested in comparing how such an interface might compare to other grid-based composition guidance [17], as well as understanding how these diferent camera interfaces", "to remove the stove, but notices the dark panel in the background, which she doesnt want.", "She turns the camera back towards the white wall, but notices the high contrast object at the top left entering her shot.", "In this case, the participant actually ends up using the same background as she started with and still includes the edge that she identifed as clutter.", "However, notice how through this process, this choice became much more intentional as she was aware of the alternative options she had in this space and decided that this best suited her preferences.", "Subject Identifcation.", "An interaction that we didnt expect that emerged from the studies was that participants used the tools ability to identify subjects to assess how someone might view their photos.", "It additionally could be interesting to experiment more thoroughly with diferent types of edge detection to see which would best match what humans actually perceive as noisee.g., in our user studies, we often found that textures like carpet ended up appearing as a lot of noise.", "If we remove the requirement of our camera guidance running interactively, there are further approaches that can be considered both for identifying objects in the scene for location context and for generating line drawings.", "We can imagine instead of the interactive guidance, having an overlay that is shown upon reviewing previously captured photos (similar to our low-fdelity prototype interaction).", "These algorithms can run for a little longer without having too much of an impact on the overall interaction.", "The tool can also perform calculations in the background as the user is focused on taking a series of photos.", "For example, Fried et al.", "[19] take a non-edge based approach to fnding distractors that better captures what humans annotate as being distractors than most edge detection algorithms.", "There also are a range of segmentation algorithms that could provide additional location context.", "We would like to thank Grifn Dietz for her assistance in transitioning to virtual user studies, Mitchell Gordon for his feedback and insightful discussions, and Matthew Cong and Charlene Seto Kung for their help with fgure photos.", "We would also like to thank all of our participants for their time and feedback.", "Our research is supported by the Brown Institute for Media Innovation, Adobe Research, the Microsoft Research Dissertation Grant, and the Hasso Plattner Institute Design Thinking Research Program.", "Much of the efort photographers put into designing a photo is to help more clearly communicate their intended story.", "Clutter in an image can greatly detract from the power of an image both in terms of efective communication and in terms of visual appeal.", "However, it can be easy for photographers to miss this clutter in the moment while paying attention to details in the subject.", "Inspired by the use of sketching in design to capture higher level structure, our goal was to bring some of the benefts of the abstraction in a sketch-like representation to photography.", "In this paper, we walked through the design process behind our abstraction overlay and guidance tool.", "We demonstrated this capture-time tool and how it encourages users to explore creative options to address the concept of decluttering.", "In this paper, we have described a type of annotation-based guidance.", "The goal in pursuing this design is to give the user creative fexibility and avoiding having the system express its opinion on how the fnal image should look [17].", "However through the design prototyping and user studies, weve noticed that decluttering seems difcult for people to address, perhaps because it is a new and unfamiliar concept.", "As a result, people still made mistakes even while being aware of specifc clutter to consider and carefully refning their photos.", "Considering the two decluttering principles of SBS and IBF, they also are somewhat unique in that there is a more defned good and bad (unless the photographer is choosing to intentionally blend the subject into the background or have a very cluttered", "While there isnt necessarily a clear defnition of failure, the main failure case with our current algorithm is when the main subject is not properly captured in the saliency map.", "We considered this in our design and tried to design the visualization to be robust to this case by providing the option of showing all lines.", "However, even this incorrect information can be informative to the user.", "It communicates that it is hard to identify a subject, and in many cases infuenced the users interpretation of the photo (see Section 5).", "Due to the modular nature of our implementation, better object detection or object-centric saliency methods methods can be used in the future.", "background).", "The creativity in decluttering comes at the stage of determining how to address the clutter.", "Therefore we wonder if it is ok to have a slightly more opinionated interface (at least for some training) as is suggested by one of our design survey participants: Making it very clear about the distinction between whether the overlay is used to indicate if the two properties are good, bad, or both would be very helpful (P18).", "In this case, we could imagine having the interface give specifc guidance such as rotating the phone, removing an object from the scene, or moving the camera closer to the subject.", "Giving the phone even more authority, one could imagine integrating Fried et al.", "s method for automatically remove clutter from the scene [19] directly into the phone.", "In designing our overlays, we were somewhat limited in the methods that we used in order to produce something that could be computed interactively.", "Our proposed technical approach was more a means of enabling the interaction of interest and not a core contribution.", "We additionally found a simpler algorithm was easier to explain to users when describing the tool for studies, and that users could interpret the visualizations in diferent contexts more easily.", "might be able to play together.", "For instance, how they might consider the context from the users process to determine when each might be most relevant to show.", "Human-centered computing  Graphical user interfaces  Computing methodologies  Graphics systems and interfaces ; Computational photography .", "our design process for determining what an abstraction overlay for decluttering might look like,  an interactive in-camera app that shows this edge highlighting overlay to users as decluttering guidance, and  a user evaluation comparing this overlay to a grayscale overlay, a baseline method that many photographers currently employ for decluttering photos.", "The evaluation shows that the tool was helpful for making users more confdent in their ability to take a clear and uncluttered photo.", "Through our design process, we aimed to answer two questions: (1) Will an abstracted visualization be efective in encouraging the user to see parts of the image outside of the main subject?", "If so, how does this make them change how they capture the scene?", "and (2) What is the right visualization to use for a photo abstraction to best invoke this type of awareness?", "(a) color fattening + line drawing (in black)", "(b) color fattening", "(c) line drawing (in white)", "(d) darkened image + line drawing (color-coded: yellow is subject, white is background, cyan is image border)", "(e) d without lines within subject", "(f) e with white lines removed", "Which overlay helps you to best determine if the image has good subject-background separation ?", "(If you dont have a preference between a few similar overlays, feel free to pick up to 3)  Which overlay helps you to best determine if the image has good image border ficker ?", "(If you dont have a preference between a few similar overlays, feel free to pick up to 3)  (Optional) You will be asked to explain your preferences at the end of the survey, but feel free to explain any specifc thoughts you have based on this image/video here."]}
