{"paper_id": "2010.07358", "sentences": ["Fig. 1.", "(a) We present a novel framework for AR assistance in object-rearrangement tasks such as house cleaning that leverages an embodied user-AR hybrid agent and a capacitated vehicle routing problem (CVRP) formulation to compute and display the optimal action sequence for the task to the user in AR.", "(b) We also introduce a novel AR simulator based on Habitat [37] that can enable large-scale web-based evaluation of AR-like assistance (Image courtesy [39]).", "(c) We deploy our framework on Amazon Mechanical Turk[3]tostudytheeffectofourproposedARassistanceonuserstaskperformanceandsenseofagencyoverarangeoftaskdifficulties.", "Augmented-reality (AR) glasseswhich will have access to real-time, high-fidelity data regarding a users environment via onboard sensors, as well as an ability to seamlessly display real-time information to the userpresent a unique opportunity to provide users with assistance in completing quotidian tasks.", "Many such taskssuch as house cleaning, packing for a trip, or organizing a living spacecan be characterized as object-rearrangement tasks defined by users navigating through an environment, picking up objects, and placing them in different locations.", "We introduce a novel framework for computing and displaying AR assistance that consists of (1) associating an optimal action sequence with the policy of an embodied agent and (2) presenting this optimal action sequence to the user as suggestion notifications in the AR systems heads-up display.", "The embodied agent comprises a hybrid between the AR system and the user, in that it has the observation space (i.e., sensor measurements) of the AR system and the action space (i.e., task-execution actions) of the user; its policy is learned by minimizing the the time to complete the task.", "In this initial study, we assume that the AR systems observations include a map of the environment and real-time localization of the objects and user within that map.", "These modeling choices allow us to formalize the problem of computing AR assistance for any object-rearrangement task as a planning problem that reduces to solving a capacitated vehicle-routing problem (CVRP), which is a variant of the classical traveling salesman problem (TSP) in combinatorial optimization.", "In addition, we introduce a novel AR simulator that can enable web-based evaluation of AR-like assistance and associated large-scale data collection; our approach is based on the Habitat [37] simulator for embodied artificial intelligence (AI).", "Finally, we perform a study that evaluates how users respond to the AR assistance generated by the proposed framework on a specific quotidian object-rearrangement taskhouse cleaningusing our proposed AR simulator.", "We perform the study at scale using Amazon", "Mechanical Turk (AMT) [3] and collect data using psiTurk [20].", "In particular, we study the effect of our proposed AR assistance on users task performance and sense of agency over a range of task difficulties.", "Our results indicate that providing users with the proposed form of AR assistance improves the users overall performance.", "Additionally, we show that while users report a negative impact to their agency, that they may prefer this when presented with a system that aides them in task completion."]}
